TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue May 29 14:46:46 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drv83523xx.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware_drv8353\motorware_1_01_00_18\sw\solutions\instaspin
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    3435                      .dwattr $C$DW$301, DW_AT_name("SPI_FifoStatus_2_Words")
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   66

    3436                      .dwattr $C$DW$301, DW_AT_const_value(0x200)
    3437              
    3438              $C$DW$302       .dwtag  DW_TAG_enumerator
    3439                      .dwattr $C$DW$302, DW_AT_name("SPI_FifoStatus_3_Words")
    3440                      .dwattr $C$DW$302, DW_AT_const_value(0x300)
    3441              
    3442              $C$DW$303       .dwtag  DW_TAG_enumerator
    3443                      .dwattr $C$DW$303, DW_AT_name("SPI_FifoStatus_4_Words")
    3444                      .dwattr $C$DW$303, DW_AT_const_value(0x400)
    3445              
    3446                      .dwendtag $C$DW$T$100
    3447              
    3448              $C$DW$T$101     .dwtag  DW_TAG_typedef
    3449                      .dwattr $C$DW$T$101, DW_AT_name("SPI_FifoStatus_e")
    3450                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    3451                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    3452              
    3453              $C$DW$304       .dwtag  DW_TAG_TI_far_type
    3454                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$101)
    3455              
    3456              $C$DW$T$102     .dwtag  DW_TAG_volatile_type
    3457                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$304)
    3458              
    3459              
    3460              $C$DW$T$106     .dwtag  DW_TAG_enumeration_type
    3461                      .dwattr $C$DW$T$106, DW_AT_byte_size(0x01)
    3462              $C$DW$305       .dwtag  DW_TAG_enumerator
    3463                      .dwattr $C$DW$305, DW_AT_name("CtrlMode_Read")
    3464                      .dwattr $C$DW$305, DW_AT_const_value(-32768)
    3465              
    3466              $C$DW$306       .dwtag  DW_TAG_enumerator
    3467                      .dwattr $C$DW$306, DW_AT_name("CtrlMode_Write")
    3468                      .dwattr $C$DW$306, DW_AT_const_value(0x00)
    3469              
    3470                      .dwendtag $C$DW$T$106
    3471              
    3472              $C$DW$T$107     .dwtag  DW_TAG_typedef
    3473                      .dwattr $C$DW$T$107, DW_AT_name("DRV8323_CtrlMode_e")
    3474                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
    3475                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    3476              
    3477              
    3478              $C$DW$T$109     .dwtag  DW_TAG_enumeration_type
    3479                      .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
    3480              $C$DW$307       .dwtag  DW_TAG_enumerator
    3481                      .dwattr $C$DW$307, DW_AT_name("Address_Status_0")
    3482                      .dwattr $C$DW$307, DW_AT_const_value(0x00)
    3483              
    3484              $C$DW$308       .dwtag  DW_TAG_enumerator
    3485                      .dwattr $C$DW$308, DW_AT_name("Address_Status_1")
    3486                      .dwattr $C$DW$308, DW_AT_const_value(0x800)
    3487              
    3488              $C$DW$309       .dwtag  DW_TAG_enumerator
    3489                      .dwattr $C$DW$309, DW_AT_name("Address_Control_2")
    3490                      .dwattr $C$DW$309, DW_AT_const_value(0x1000)
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   67

    3491              
    3492              $C$DW$310       .dwtag  DW_TAG_enumerator
    3493                      .dwattr $C$DW$310, DW_AT_name("Address_Control_3")
    3494                      .dwattr $C$DW$310, DW_AT_const_value(0x1800)
    3495              
    3496              $C$DW$311       .dwtag  DW_TAG_enumerator
    3497                      .dwattr $C$DW$311, DW_AT_name("Address_Control_4")
    3498                      .dwattr $C$DW$311, DW_AT_const_value(0x2000)
    3499              
    3500              $C$DW$312       .dwtag  DW_TAG_enumerator
    3501                      .dwattr $C$DW$312, DW_AT_name("Address_Control_5")
    3502                      .dwattr $C$DW$312, DW_AT_const_value(0x2800)
    3503              
    3504              $C$DW$313       .dwtag  DW_TAG_enumerator
    3505                      .dwattr $C$DW$313, DW_AT_name("Address_Control_6")
    3506                      .dwattr $C$DW$313, DW_AT_const_value(0x3000)
    3507              
    3508                      .dwendtag $C$DW$T$109
    3509              
    3510              $C$DW$T$110     .dwtag  DW_TAG_typedef
    3511                      .dwattr $C$DW$T$110, DW_AT_name("DRV8323_Address_e")
    3512                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    3513                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    3514              
    3515              $C$DW$314       .dwtag  DW_TAG_TI_far_type
    3516                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$110)
    3517              
    3518              $C$DW$T$111     .dwtag  DW_TAG_const_type
    3519                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$314)
    3520              
    3521              
    3522              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3523                      .dwattr $C$DW$T$26, DW_AT_name("_DRV8323_Obj_")
    3524                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    3525              $C$DW$315       .dwtag  DW_TAG_member
    3526                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$20)
    3527                      .dwattr $C$DW$315, DW_AT_name("spiHandle")
    3528                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_spiHandle")
    3529                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3530                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3531              
    3532              $C$DW$316       .dwtag  DW_TAG_member
    3533                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$22)
    3534                      .dwattr $C$DW$316, DW_AT_name("gpioHandle")
    3535                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_gpioHandle")
    3536                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3537                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3538              
    3539              $C$DW$317       .dwtag  DW_TAG_member
    3540                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$24)
    3541                      .dwattr $C$DW$317, DW_AT_name("gpioNumber")
    3542                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_gpioNumber")
    3543                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3544                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3545              
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   68

    3546              $C$DW$318       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$25)
    3548                      .dwattr $C$DW$318, DW_AT_name("RxTimeOut")
    3549                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_RxTimeOut")
    3550                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3551                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3552              
    3553              $C$DW$319       .dwtag  DW_TAG_member
    3554                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$25)
    3555                      .dwattr $C$DW$319, DW_AT_name("enableTimeOut")
    3556                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_enableTimeOut")
    3557                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3558                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3559              
    3560                      .dwendtag $C$DW$T$26
    3561              
    3562              $C$DW$T$112     .dwtag  DW_TAG_typedef
    3563                      .dwattr $C$DW$T$112, DW_AT_name("DRV8323_Obj")
    3564                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$26)
    3565                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    3566              
    3567              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    3568                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$26)
    3569                      .dwattr $C$DW$T$82, DW_AT_address_class(0x20)
    3570              
    3571              $C$DW$T$83      .dwtag  DW_TAG_typedef
    3572                      .dwattr $C$DW$T$83, DW_AT_name("DRV8323_Handle")
    3573                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3574                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3575              
    3576              $C$DW$320       .dwtag  DW_TAG_TI_far_type
    3577                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$83)
    3578              
    3579              $C$DW$T$113     .dwtag  DW_TAG_const_type
    3580                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$320)
    3581              
    3582              
    3583              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3584                      .dwattr $C$DW$T$29, DW_AT_name("_DRV_SPI_8323_Ctrl02_t_")
    3585                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x0a)
    3586              $C$DW$321       .dwtag  DW_TAG_member
    3587                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$25)
    3588                      .dwattr $C$DW$321, DW_AT_name("CLR_FLT")
    3589                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_CLR_FLT")
    3590                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3591                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3592              
    3593              $C$DW$322       .dwtag  DW_TAG_member
    3594                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$25)
    3595                      .dwattr $C$DW$322, DW_AT_name("BRAKE")
    3596                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_BRAKE")
    3597                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3598                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3599              
    3600              $C$DW$323       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   69

    3601                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$25)
    3602                      .dwattr $C$DW$323, DW_AT_name("COAST")
    3603                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_COAST")
    3604                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3605                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3606              
    3607              $C$DW$324       .dwtag  DW_TAG_member
    3608                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$25)
    3609                      .dwattr $C$DW$324, DW_AT_name("PWM1_DIR")
    3610                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_PWM1_DIR")
    3611                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3612                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3613              
    3614              $C$DW$325       .dwtag  DW_TAG_member
    3615                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$25)
    3616                      .dwattr $C$DW$325, DW_AT_name("PWM1_COM")
    3617                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_PWM1_COM")
    3618                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3619                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3620              
    3621              $C$DW$326       .dwtag  DW_TAG_member
    3622                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$28)
    3623                      .dwattr $C$DW$326, DW_AT_name("PWM_MODE")
    3624                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_PWM_MODE")
    3625                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3626                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3627              
    3628              $C$DW$327       .dwtag  DW_TAG_member
    3629                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$25)
    3630                      .dwattr $C$DW$327, DW_AT_name("OTW_REP")
    3631                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_OTW_REP")
    3632                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3633                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3634              
    3635              $C$DW$328       .dwtag  DW_TAG_member
    3636                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$25)
    3637                      .dwattr $C$DW$328, DW_AT_name("DIS_GDF")
    3638                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_DIS_GDF")
    3639                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3640                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3641              
    3642              $C$DW$329       .dwtag  DW_TAG_member
    3643                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$25)
    3644                      .dwattr $C$DW$329, DW_AT_name("DIS_CPUV")
    3645                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_DIS_CPUV")
    3646                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3647                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3648              
    3649              $C$DW$330       .dwtag  DW_TAG_member
    3650                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$25)
    3651                      .dwattr $C$DW$330, DW_AT_name("CTRL02_RSV1")
    3652                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_CTRL02_RSV1")
    3653                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3654                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3655              
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   70

    3656                      .dwendtag $C$DW$T$29
    3657              
    3658              $C$DW$T$62      .dwtag  DW_TAG_typedef
    3659                      .dwattr $C$DW$T$62, DW_AT_name("DRV_SPI_8323_Ctrl02_t_")
    3660                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$29)
    3661                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3662              
    3663              
    3664              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3665                      .dwattr $C$DW$T$36, DW_AT_name("_DRV_SPI_8323_Ctrl03_t_")
    3666                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x03)
    3667              $C$DW$331       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$31)
    3669                      .dwattr $C$DW$331, DW_AT_name("IDRIVEN_HS")
    3670                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_IDRIVEN_HS")
    3671                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3672                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3673              
    3674              $C$DW$332       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$33)
    3676                      .dwattr $C$DW$332, DW_AT_name("IDRIVEP_HS")
    3677                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_IDRIVEP_HS")
    3678                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3679                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3680              
    3681              $C$DW$333       .dwtag  DW_TAG_member
    3682                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$35)
    3683                      .dwattr $C$DW$333, DW_AT_name("LOCK")
    3684                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_LOCK")
    3685                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3686                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3687              
    3688                      .dwendtag $C$DW$T$36
    3689              
    3690              $C$DW$T$63      .dwtag  DW_TAG_typedef
    3691                      .dwattr $C$DW$T$63, DW_AT_name("DRV_SPI_8323_Ctrl03_t_")
    3692                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$36)
    3693                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3694              
    3695              
    3696              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3697                      .dwattr $C$DW$T$43, DW_AT_name("_DRV_SPI_8323_Ctrl04_t_")
    3698                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    3699              $C$DW$334       .dwtag  DW_TAG_member
    3700                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$38)
    3701                      .dwattr $C$DW$334, DW_AT_name("IDRIVEN_LS")
    3702                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_IDRIVEN_LS")
    3703                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3704                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3705              
    3706              $C$DW$335       .dwtag  DW_TAG_member
    3707                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$40)
    3708                      .dwattr $C$DW$335, DW_AT_name("IDRIVEP_LS")
    3709                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_IDRIVEP_LS")
    3710                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   71

    3711                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3712              
    3713              $C$DW$336       .dwtag  DW_TAG_member
    3714                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$42)
    3715                      .dwattr $C$DW$336, DW_AT_name("TDRIVE")
    3716                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_TDRIVE")
    3717                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3718                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3719              
    3720              $C$DW$337       .dwtag  DW_TAG_member
    3721                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$25)
    3722                      .dwattr $C$DW$337, DW_AT_name("CBC")
    3723                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_CBC")
    3724                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3725                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3726              
    3727                      .dwendtag $C$DW$T$43
    3728              
    3729              $C$DW$T$64      .dwtag  DW_TAG_typedef
    3730                      .dwattr $C$DW$T$64, DW_AT_name("DRV_SPI_8323_Ctrl04_t_")
    3731                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$43)
    3732                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3733              
    3734              
    3735              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3736                      .dwattr $C$DW$T$52, DW_AT_name("_DRV_SPI_8323_Ctrl05_t_")
    3737                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x05)
    3738              $C$DW$338       .dwtag  DW_TAG_member
    3739                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$45)
    3740                      .dwattr $C$DW$338, DW_AT_name("VDS_LVL")
    3741                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_VDS_LVL")
    3742                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3743                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3744              
    3745              $C$DW$339       .dwtag  DW_TAG_member
    3746                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$47)
    3747                      .dwattr $C$DW$339, DW_AT_name("OCP_DEG")
    3748                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_OCP_DEG")
    3749                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3750                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3751              
    3752              $C$DW$340       .dwtag  DW_TAG_member
    3753                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$49)
    3754                      .dwattr $C$DW$340, DW_AT_name("OCP_MODE")
    3755                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_OCP_MODE")
    3756                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3757                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3758              
    3759              $C$DW$341       .dwtag  DW_TAG_member
    3760                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$51)
    3761                      .dwattr $C$DW$341, DW_AT_name("DEAD_TIME")
    3762                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_DEAD_TIME")
    3763                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3764                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3765              
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   72

    3766              $C$DW$342       .dwtag  DW_TAG_member
    3767                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$25)
    3768                      .dwattr $C$DW$342, DW_AT_name("TRETRY")
    3769                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_TRETRY")
    3770                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3771                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3772              
    3773                      .dwendtag $C$DW$T$52
    3774              
    3775              $C$DW$T$65      .dwtag  DW_TAG_typedef
    3776                      .dwattr $C$DW$T$65, DW_AT_name("DRV_SPI_8323_Ctrl05_t_")
    3777                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$52)
    3778                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3779              
    3780              
    3781              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3782                      .dwattr $C$DW$T$57, DW_AT_name("_DRV_SPI_8323_Ctrl06_t_")
    3783                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x09)
    3784              $C$DW$343       .dwtag  DW_TAG_member
    3785                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$54)
    3786                      .dwattr $C$DW$343, DW_AT_name("SEN_LVL")
    3787                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_SEN_LVL")
    3788                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3789                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3790              
    3791              $C$DW$344       .dwtag  DW_TAG_member
    3792                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$25)
    3793                      .dwattr $C$DW$344, DW_AT_name("CSA_CAL_C")
    3794                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_CSA_CAL_C")
    3795                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3796                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3797              
    3798              $C$DW$345       .dwtag  DW_TAG_member
    3799                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$25)
    3800                      .dwattr $C$DW$345, DW_AT_name("CSA_CAL_B")
    3801                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_CSA_CAL_B")
    3802                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3803                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3804              
    3805              $C$DW$346       .dwtag  DW_TAG_member
    3806                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$25)
    3807                      .dwattr $C$DW$346, DW_AT_name("CSA_CAL_A")
    3808                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_CSA_CAL_A")
    3809                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3810                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3811              
    3812              $C$DW$347       .dwtag  DW_TAG_member
    3813                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$25)
    3814                      .dwattr $C$DW$347, DW_AT_name("DIS_SEN")
    3815                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_DIS_SEN")
    3816                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3817                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3818              
    3819              $C$DW$348       .dwtag  DW_TAG_member
    3820                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$56)
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   73

    3821                      .dwattr $C$DW$348, DW_AT_name("CSA_GAIN")
    3822                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_CSA_GAIN")
    3823                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3824                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3825              
    3826              $C$DW$349       .dwtag  DW_TAG_member
    3827                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$25)
    3828                      .dwattr $C$DW$349, DW_AT_name("LS_REF")
    3829                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_LS_REF")
    3830                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3831                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3832              
    3833              $C$DW$350       .dwtag  DW_TAG_member
    3834                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$25)
    3835                      .dwattr $C$DW$350, DW_AT_name("VREF_DIV")
    3836                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_VREF_DIV")
    3837                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3838                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3839              
    3840              $C$DW$351       .dwtag  DW_TAG_member
    3841                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$25)
    3842                      .dwattr $C$DW$351, DW_AT_name("CSA_FET")
    3843                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_CSA_FET")
    3844                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3845                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3846              
    3847                      .dwendtag $C$DW$T$57
    3848              
    3849              $C$DW$T$66      .dwtag  DW_TAG_typedef
    3850                      .dwattr $C$DW$T$66, DW_AT_name("DRV_SPI_8323_Ctrl06_t_")
    3851                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$57)
    3852                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3853              
    3854              
    3855              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3856                      .dwattr $C$DW$T$58, DW_AT_name("_DRV_SPI_8323_Stat00_t_")
    3857                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x0b)
    3858              $C$DW$352       .dwtag  DW_TAG_member
    3859                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$25)
    3860                      .dwattr $C$DW$352, DW_AT_name("VDS_LC")
    3861                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_VDS_LC")
    3862                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3863                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3864              
    3865              $C$DW$353       .dwtag  DW_TAG_member
    3866                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$25)
    3867                      .dwattr $C$DW$353, DW_AT_name("VDS_HC")
    3868                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_VDS_HC")
    3869                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3870                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3871              
    3872              $C$DW$354       .dwtag  DW_TAG_member
    3873                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$25)
    3874                      .dwattr $C$DW$354, DW_AT_name("VDS_LB")
    3875                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_VDS_LB")
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   74

    3876                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3877                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3878              
    3879              $C$DW$355       .dwtag  DW_TAG_member
    3880                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$25)
    3881                      .dwattr $C$DW$355, DW_AT_name("VDS_HB")
    3882                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_VDS_HB")
    3883                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3884                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3885              
    3886              $C$DW$356       .dwtag  DW_TAG_member
    3887                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$25)
    3888                      .dwattr $C$DW$356, DW_AT_name("VDS_LA")
    3889                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_VDS_LA")
    3890                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3891                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3892              
    3893              $C$DW$357       .dwtag  DW_TAG_member
    3894                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$25)
    3895                      .dwattr $C$DW$357, DW_AT_name("VDS_HA")
    3896                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_VDS_HA")
    3897                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3898                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3899              
    3900              $C$DW$358       .dwtag  DW_TAG_member
    3901                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$25)
    3902                      .dwattr $C$DW$358, DW_AT_name("OTSD")
    3903                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_OTSD")
    3904                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3905                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3906              
    3907              $C$DW$359       .dwtag  DW_TAG_member
    3908                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$25)
    3909                      .dwattr $C$DW$359, DW_AT_name("UVLO")
    3910                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_UVLO")
    3911                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3912                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3913              
    3914              $C$DW$360       .dwtag  DW_TAG_member
    3915                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$25)
    3916                      .dwattr $C$DW$360, DW_AT_name("GDF")
    3917                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_GDF")
    3918                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3919                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3920              
    3921              $C$DW$361       .dwtag  DW_TAG_member
    3922                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$25)
    3923                      .dwattr $C$DW$361, DW_AT_name("VDS_OCP")
    3924                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_VDS_OCP")
    3925                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3926                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3927              
    3928              $C$DW$362       .dwtag  DW_TAG_member
    3929                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$25)
    3930                      .dwattr $C$DW$362, DW_AT_name("FAULT")
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   75

    3931                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_FAULT")
    3932                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3933                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3934              
    3935                      .dwendtag $C$DW$T$58
    3936              
    3937              $C$DW$T$60      .dwtag  DW_TAG_typedef
    3938                      .dwattr $C$DW$T$60, DW_AT_name("DRV_SPI_8323_Stat00_t_")
    3939                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$58)
    3940                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3941              
    3942              
    3943              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    3944                      .dwattr $C$DW$T$59, DW_AT_name("_DRV_SPI_8323_Stat01_t_")
    3945                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x0b)
    3946              $C$DW$363       .dwtag  DW_TAG_member
    3947                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$25)
    3948                      .dwattr $C$DW$363, DW_AT_name("VGS_LC")
    3949                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_VGS_LC")
    3950                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3951                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3952              
    3953              $C$DW$364       .dwtag  DW_TAG_member
    3954                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$25)
    3955                      .dwattr $C$DW$364, DW_AT_name("VGS_HC")
    3956                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_VGS_HC")
    3957                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3958                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3959              
    3960              $C$DW$365       .dwtag  DW_TAG_member
    3961                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$25)
    3962                      .dwattr $C$DW$365, DW_AT_name("VGS_LB")
    3963                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_VGS_LB")
    3964                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3965                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3966              
    3967              $C$DW$366       .dwtag  DW_TAG_member
    3968                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$25)
    3969                      .dwattr $C$DW$366, DW_AT_name("VGS_HB")
    3970                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_VGS_HB")
    3971                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3972                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3973              
    3974              $C$DW$367       .dwtag  DW_TAG_member
    3975                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$25)
    3976                      .dwattr $C$DW$367, DW_AT_name("VGS_LA")
    3977                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_VGS_LA")
    3978                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3979                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3980              
    3981              $C$DW$368       .dwtag  DW_TAG_member
    3982                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$25)
    3983                      .dwattr $C$DW$368, DW_AT_name("VGS_HA")
    3984                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_VGS_HA")
    3985                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   76

    3986                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3987              
    3988              $C$DW$369       .dwtag  DW_TAG_member
    3989                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$25)
    3990                      .dwattr $C$DW$369, DW_AT_name("CPUV")
    3991                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_CPUV")
    3992                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3993                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3994              
    3995              $C$DW$370       .dwtag  DW_TAG_member
    3996                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$25)
    3997                      .dwattr $C$DW$370, DW_AT_name("OTW")
    3998                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_OTW")
    3999                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4000                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4001              
    4002              $C$DW$371       .dwtag  DW_TAG_member
    4003                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$25)
    4004                      .dwattr $C$DW$371, DW_AT_name("SC_OC")
    4005                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_SC_OC")
    4006                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4007                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4008              
    4009              $C$DW$372       .dwtag  DW_TAG_member
    4010                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$25)
    4011                      .dwattr $C$DW$372, DW_AT_name("SB_OC")
    4012                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_SB_OC")
    4013                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4014                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4015              
    4016              $C$DW$373       .dwtag  DW_TAG_member
    4017                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$25)
    4018                      .dwattr $C$DW$373, DW_AT_name("SA_OC")
    4019                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_SA_OC")
    4020                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4021                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4022              
    4023                      .dwendtag $C$DW$T$59
    4024              
    4025              $C$DW$T$61      .dwtag  DW_TAG_typedef
    4026                      .dwattr $C$DW$T$61, DW_AT_name("DRV_SPI_8323_Stat01_t_")
    4027                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$59)
    4028                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4029              
    4030              
    4031              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    4032                      .dwattr $C$DW$T$68, DW_AT_name("_DRV_SPI_8323_Vars_t_")
    4033                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x3d)
    4034              $C$DW$374       .dwtag  DW_TAG_member
    4035                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$60)
    4036                      .dwattr $C$DW$374, DW_AT_name("Stat_Reg_00")
    4037                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_Stat_Reg_00")
    4038                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4039                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4040              
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   77

    4041              $C$DW$375       .dwtag  DW_TAG_member
    4042                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$61)
    4043                      .dwattr $C$DW$375, DW_AT_name("Stat_Reg_01")
    4044                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_Stat_Reg_01")
    4045                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4046                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4047              
    4048              $C$DW$376       .dwtag  DW_TAG_member
    4049                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$62)
    4050                      .dwattr $C$DW$376, DW_AT_name("Ctrl_Reg_02")
    4051                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_Ctrl_Reg_02")
    4052                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4053                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4054              
    4055              $C$DW$377       .dwtag  DW_TAG_member
    4056                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$63)
    4057                      .dwattr $C$DW$377, DW_AT_name("Ctrl_Reg_03")
    4058                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_Ctrl_Reg_03")
    4059                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4060                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4061              
    4062              $C$DW$378       .dwtag  DW_TAG_member
    4063                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$64)
    4064                      .dwattr $C$DW$378, DW_AT_name("Ctrl_Reg_04")
    4065                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_Ctrl_Reg_04")
    4066                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4067                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4068              
    4069              $C$DW$379       .dwtag  DW_TAG_member
    4070                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$65)
    4071                      .dwattr $C$DW$379, DW_AT_name("Ctrl_Reg_05")
    4072                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_Ctrl_Reg_05")
    4073                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4074                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4075              
    4076              $C$DW$380       .dwtag  DW_TAG_member
    4077                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$66)
    4078                      .dwattr $C$DW$380, DW_AT_name("Ctrl_Reg_06")
    4079                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_Ctrl_Reg_06")
    4080                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4081                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4082              
    4083              $C$DW$381       .dwtag  DW_TAG_member
    4084                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$25)
    4085                      .dwattr $C$DW$381, DW_AT_name("WriteCmd")
    4086                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_WriteCmd")
    4087                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4088                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4089              
    4090              $C$DW$382       .dwtag  DW_TAG_member
    4091                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$25)
    4092                      .dwattr $C$DW$382, DW_AT_name("ReadCmd")
    4093                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_ReadCmd")
    4094                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4095                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   78

    4096              
    4097              $C$DW$383       .dwtag  DW_TAG_member
    4098                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$67)
    4099                      .dwattr $C$DW$383, DW_AT_name("ManWriteAddr")
    4100                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_ManWriteAddr")
    4101                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4102                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4103              
    4104              $C$DW$384       .dwtag  DW_TAG_member
    4105                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$67)
    4106                      .dwattr $C$DW$384, DW_AT_name("ManReadAddr")
    4107                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_ManReadAddr")
    4108                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4109                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4110              
    4111              $C$DW$385       .dwtag  DW_TAG_member
    4112                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$67)
    4113                      .dwattr $C$DW$385, DW_AT_name("ManWriteData")
    4114                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_ManWriteData")
    4115                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4116                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4117              
    4118              $C$DW$386       .dwtag  DW_TAG_member
    4119                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$67)
    4120                      .dwattr $C$DW$386, DW_AT_name("ManReadData")
    4121                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_ManReadData")
    4122                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4123                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4124              
    4125              $C$DW$387       .dwtag  DW_TAG_member
    4126                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$25)
    4127                      .dwattr $C$DW$387, DW_AT_name("ManWriteCmd")
    4128                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_ManWriteCmd")
    4129                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4130                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4131              
    4132              $C$DW$388       .dwtag  DW_TAG_member
    4133                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$25)
    4134                      .dwattr $C$DW$388, DW_AT_name("ManReadCmd")
    4135                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_ManReadCmd")
    4136                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4137                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4138              
    4139                      .dwendtag $C$DW$T$68
    4140              
    4141              $C$DW$T$119     .dwtag  DW_TAG_typedef
    4142                      .dwattr $C$DW$T$119, DW_AT_name("DRV_SPI_8323_Vars_t")
    4143                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$68)
    4144                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    4145              
    4146              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    4147                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
    4148                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    4149              
    4150              $C$DW$389       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   79

    4151                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$120)
    4152              
    4153              $C$DW$T$121     .dwtag  DW_TAG_const_type
    4154                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$389)
    4155              
    4156              
    4157              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    4158                      .dwattr $C$DW$T$78, DW_AT_name("_GPIO_Obj_")
    4159                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x6a)
    4160              $C$DW$390       .dwtag  DW_TAG_member
    4161                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$70)
    4162                      .dwattr $C$DW$390, DW_AT_name("GPACTRL")
    4163                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_GPACTRL")
    4164                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4165                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4166              
    4167              $C$DW$391       .dwtag  DW_TAG_member
    4168                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$70)
    4169                      .dwattr $C$DW$391, DW_AT_name("GPAQSEL1")
    4170                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_GPAQSEL1")
    4171                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4172                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4173              
    4174              $C$DW$392       .dwtag  DW_TAG_member
    4175                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$70)
    4176                      .dwattr $C$DW$392, DW_AT_name("GPAQSEL2")
    4177                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_GPAQSEL2")
    4178                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4179                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4180              
    4181              $C$DW$393       .dwtag  DW_TAG_member
    4182                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$70)
    4183                      .dwattr $C$DW$393, DW_AT_name("GPAMUX1")
    4184                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_GPAMUX1")
    4185                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4186                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4187              
    4188              $C$DW$394       .dwtag  DW_TAG_member
    4189                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$70)
    4190                      .dwattr $C$DW$394, DW_AT_name("GPAMUX2")
    4191                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_GPAMUX2")
    4192                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4193                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4194              
    4195              $C$DW$395       .dwtag  DW_TAG_member
    4196                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$70)
    4197                      .dwattr $C$DW$395, DW_AT_name("GPADIR")
    4198                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_GPADIR")
    4199                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4200                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4201              
    4202              $C$DW$396       .dwtag  DW_TAG_member
    4203                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$70)
    4204                      .dwattr $C$DW$396, DW_AT_name("GPAPUD")
    4205                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_GPAPUD")
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   80

    4206                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4207                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4208              
    4209              $C$DW$397       .dwtag  DW_TAG_member
    4210                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$72)
    4211                      .dwattr $C$DW$397, DW_AT_name("rsvd_1")
    4212                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_rsvd_1")
    4213                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4214                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4215              
    4216              $C$DW$398       .dwtag  DW_TAG_member
    4217                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$70)
    4218                      .dwattr $C$DW$398, DW_AT_name("GPBCTRL")
    4219                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_GPBCTRL")
    4220                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4221                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4222              
    4223              $C$DW$399       .dwtag  DW_TAG_member
    4224                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$70)
    4225                      .dwattr $C$DW$399, DW_AT_name("GPBQSEL1")
    4226                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_GPBQSEL1")
    4227                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4228                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4229              
    4230              $C$DW$400       .dwtag  DW_TAG_member
    4231                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$72)
    4232                      .dwattr $C$DW$400, DW_AT_name("rsvd_2")
    4233                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_rsvd_2")
    4234                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4235                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4236              
    4237              $C$DW$401       .dwtag  DW_TAG_member
    4238                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$70)
    4239                      .dwattr $C$DW$401, DW_AT_name("GPBMUX1")
    4240                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_GPBMUX1")
    4241                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4242                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4243              
    4244              $C$DW$402       .dwtag  DW_TAG_member
    4245                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$72)
    4246                      .dwattr $C$DW$402, DW_AT_name("rsvd_3")
    4247                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_rsvd_3")
    4248                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4249                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4250              
    4251              $C$DW$403       .dwtag  DW_TAG_member
    4252                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$70)
    4253                      .dwattr $C$DW$403, DW_AT_name("GPBDIR")
    4254                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_GPBDIR")
    4255                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4256                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4257              
    4258              $C$DW$404       .dwtag  DW_TAG_member
    4259                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$70)
    4260                      .dwattr $C$DW$404, DW_AT_name("GPBPUD")
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   81

    4261                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_GPBPUD")
    4262                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4263                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4264              
    4265              $C$DW$405       .dwtag  DW_TAG_member
    4266                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$73)
    4267                      .dwattr $C$DW$405, DW_AT_name("rsvd_4")
    4268                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_rsvd_4")
    4269                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4270                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4271              
    4272              $C$DW$406       .dwtag  DW_TAG_member
    4273                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$70)
    4274                      .dwattr $C$DW$406, DW_AT_name("AIOMUX1")
    4275                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_AIOMUX1")
    4276                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4277                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4278              
    4279              $C$DW$407       .dwtag  DW_TAG_member
    4280                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$72)
    4281                      .dwattr $C$DW$407, DW_AT_name("rsvd_5")
    4282                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_rsvd_5")
    4283                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4284                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4285              
    4286              $C$DW$408       .dwtag  DW_TAG_member
    4287                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$70)
    4288                      .dwattr $C$DW$408, DW_AT_name("AIODIR")
    4289                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_AIODIR")
    4290                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4291                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4292              
    4293              $C$DW$409       .dwtag  DW_TAG_member
    4294                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$74)
    4295                      .dwattr $C$DW$409, DW_AT_name("rsvd_6")
    4296                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_rsvd_6")
    4297                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4298                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4299              
    4300              $C$DW$410       .dwtag  DW_TAG_member
    4301                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$70)
    4302                      .dwattr $C$DW$410, DW_AT_name("GPADAT")
    4303                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_GPADAT")
    4304                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4305                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4306              
    4307              $C$DW$411       .dwtag  DW_TAG_member
    4308                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$70)
    4309                      .dwattr $C$DW$411, DW_AT_name("GPASET")
    4310                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_GPASET")
    4311                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4312                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4313              
    4314              $C$DW$412       .dwtag  DW_TAG_member
    4315                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$70)
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   82

    4316                      .dwattr $C$DW$412, DW_AT_name("GPACLEAR")
    4317                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_GPACLEAR")
    4318                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4319                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4320              
    4321              $C$DW$413       .dwtag  DW_TAG_member
    4322                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$70)
    4323                      .dwattr $C$DW$413, DW_AT_name("GPATOGGLE")
    4324                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_GPATOGGLE")
    4325                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4326                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4327              
    4328              $C$DW$414       .dwtag  DW_TAG_member
    4329                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$70)
    4330                      .dwattr $C$DW$414, DW_AT_name("GPBDAT")
    4331                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_GPBDAT")
    4332                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4333                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4334              
    4335              $C$DW$415       .dwtag  DW_TAG_member
    4336                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$70)
    4337                      .dwattr $C$DW$415, DW_AT_name("GPBSET")
    4338                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_GPBSET")
    4339                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4340                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4341              
    4342              $C$DW$416       .dwtag  DW_TAG_member
    4343                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$70)
    4344                      .dwattr $C$DW$416, DW_AT_name("GPBCLEAR")
    4345                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_GPBCLEAR")
    4346                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4347                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4348              
    4349              $C$DW$417       .dwtag  DW_TAG_member
    4350                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$70)
    4351                      .dwattr $C$DW$417, DW_AT_name("GPBTOGGLE")
    4352                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_GPBTOGGLE")
    4353                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4354                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4355              
    4356              $C$DW$418       .dwtag  DW_TAG_member
    4357                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$75)
    4358                      .dwattr $C$DW$418, DW_AT_name("rsvd_7")
    4359                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_rsvd_7")
    4360                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4361                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4362              
    4363              $C$DW$419       .dwtag  DW_TAG_member
    4364                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$70)
    4365                      .dwattr $C$DW$419, DW_AT_name("AIODAT")
    4366                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_AIODAT")
    4367                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4368                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4369              
    4370              $C$DW$420       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   83

    4371                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$70)
    4372                      .dwattr $C$DW$420, DW_AT_name("AIOSET")
    4373                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_AIOSET")
    4374                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    4375                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4376              
    4377              $C$DW$421       .dwtag  DW_TAG_member
    4378                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$70)
    4379                      .dwattr $C$DW$421, DW_AT_name("AIOCLEAR")
    4380                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_AIOCLEAR")
    4381                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4382                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4383              
    4384              $C$DW$422       .dwtag  DW_TAG_member
    4385                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$70)
    4386                      .dwattr $C$DW$422, DW_AT_name("AIOTOGGLE")
    4387                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_AIOTOGGLE")
    4388                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4389                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4390              
    4391              $C$DW$423       .dwtag  DW_TAG_member
    4392                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$76)
    4393                      .dwattr $C$DW$423, DW_AT_name("GPIOXINTnSEL")
    4394                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    4395                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4396                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4397              
    4398              $C$DW$424       .dwtag  DW_TAG_member
    4399                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$77)
    4400                      .dwattr $C$DW$424, DW_AT_name("rsvd_8")
    4401                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_rsvd_8")
    4402                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    4403                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4404              
    4405              $C$DW$425       .dwtag  DW_TAG_member
    4406                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$70)
    4407                      .dwattr $C$DW$425, DW_AT_name("GPIOLPMSEL")
    4408                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    4409                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    4410                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4411              
    4412                      .dwendtag $C$DW$T$78
    4413              
    4414              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    4415                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$78)
    4416                      .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    4417              
    4418              $C$DW$T$22      .dwtag  DW_TAG_typedef
    4419                      .dwattr $C$DW$T$22, DW_AT_name("GPIO_Handle")
    4420                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    4421                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    4422              
    4423              $C$DW$426       .dwtag  DW_TAG_TI_far_type
    4424                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$22)
    4425              
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   84

    4426              $C$DW$T$124     .dwtag  DW_TAG_const_type
    4427                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$426)
    4428              
    4429              
    4430              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    4431                      .dwattr $C$DW$T$79, DW_AT_name("_SPI_Obj_")
    4432                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x10)
    4433              $C$DW$427       .dwtag  DW_TAG_member
    4434                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$71)
    4435                      .dwattr $C$DW$427, DW_AT_name("SPICCR")
    4436                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_SPICCR")
    4437                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4438                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4439              
    4440              $C$DW$428       .dwtag  DW_TAG_member
    4441                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$71)
    4442                      .dwattr $C$DW$428, DW_AT_name("SPICTL")
    4443                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_SPICTL")
    4444                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4445                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4446              
    4447              $C$DW$429       .dwtag  DW_TAG_member
    4448                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$71)
    4449                      .dwattr $C$DW$429, DW_AT_name("SPIST")
    4450                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_SPIST")
    4451                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4452                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4453              
    4454              $C$DW$430       .dwtag  DW_TAG_member
    4455                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$71)
    4456                      .dwattr $C$DW$430, DW_AT_name("rsvd_1")
    4457                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_rsvd_1")
    4458                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4459                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4460              
    4461              $C$DW$431       .dwtag  DW_TAG_member
    4462                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$71)
    4463                      .dwattr $C$DW$431, DW_AT_name("SPIBRR")
    4464                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_SPIBRR")
    4465                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4466                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4467              
    4468              $C$DW$432       .dwtag  DW_TAG_member
    4469                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$71)
    4470                      .dwattr $C$DW$432, DW_AT_name("rsvd_2")
    4471                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_rsvd_2")
    4472                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4473                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4474              
    4475              $C$DW$433       .dwtag  DW_TAG_member
    4476                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$71)
    4477                      .dwattr $C$DW$433, DW_AT_name("SPIEMU")
    4478                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_SPIEMU")
    4479                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4480                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   85

    4481              
    4482              $C$DW$434       .dwtag  DW_TAG_member
    4483                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$71)
    4484                      .dwattr $C$DW$434, DW_AT_name("SPIRXBUF")
    4485                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_SPIRXBUF")
    4486                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4487                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4488              
    4489              $C$DW$435       .dwtag  DW_TAG_member
    4490                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$71)
    4491                      .dwattr $C$DW$435, DW_AT_name("SPITXBUF")
    4492                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_SPITXBUF")
    4493                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4494                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4495              
    4496              $C$DW$436       .dwtag  DW_TAG_member
    4497                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$71)
    4498                      .dwattr $C$DW$436, DW_AT_name("SPIDAT")
    4499                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_SPIDAT")
    4500                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4501                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4502              
    4503              $C$DW$437       .dwtag  DW_TAG_member
    4504                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$71)
    4505                      .dwattr $C$DW$437, DW_AT_name("SPIFFTX")
    4506                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_SPIFFTX")
    4507                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4508                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4509              
    4510              $C$DW$438       .dwtag  DW_TAG_member
    4511                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$71)
    4512                      .dwattr $C$DW$438, DW_AT_name("SPIFFRX")
    4513                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_SPIFFRX")
    4514                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4515                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4516              
    4517              $C$DW$439       .dwtag  DW_TAG_member
    4518                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$71)
    4519                      .dwattr $C$DW$439, DW_AT_name("SPIFFCT")
    4520                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_SPIFFCT")
    4521                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4522                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4523              
    4524              $C$DW$440       .dwtag  DW_TAG_member
    4525                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$72)
    4526                      .dwattr $C$DW$440, DW_AT_name("rsvd_3")
    4527                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_rsvd_3")
    4528                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4529                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4530              
    4531              $C$DW$441       .dwtag  DW_TAG_member
    4532                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$71)
    4533                      .dwattr $C$DW$441, DW_AT_name("SPIPRI")
    4534                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_SPIPRI")
    4535                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   86

    4536                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4537              
    4538                      .dwendtag $C$DW$T$79
    4539              
    4540              $C$DW$T$126     .dwtag  DW_TAG_typedef
    4541                      .dwattr $C$DW$T$126, DW_AT_name("SPI_Obj")
    4542                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$79)
    4543                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    4544              
    4545              $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    4546                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$79)
    4547                      .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
    4548              
    4549              $C$DW$T$20      .dwtag  DW_TAG_typedef
    4550                      .dwattr $C$DW$T$20, DW_AT_name("SPI_Handle")
    4551                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    4552                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4553              
    4554              $C$DW$442       .dwtag  DW_TAG_TI_far_type
    4555                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$20)
    4556              
    4557              $C$DW$T$127     .dwtag  DW_TAG_const_type
    4558                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$442)
    4559              
    4560              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4561                      .dwattr $C$DW$T$2, DW_AT_name("void")
    4562              
    4563              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4564                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    4565                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    4566              
    4567              $C$DW$443       .dwtag  DW_TAG_TI_far_type
    4568                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$3)
    4569              
    4570              $C$DW$T$129     .dwtag  DW_TAG_const_type
    4571                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$443)
    4572              
    4573              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4574                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4575                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4576                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4577              
    4578              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4579                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4580                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4581                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4582              
    4583              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4584                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4585                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4586                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4587              
    4588              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4589                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4590                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
TMS320C2000 Assembler PC v15.12.3 Tue May 29 14:46:46 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\6936410                         PAGE   87

    4591                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4592              
    4593              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4594                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4595                      .dwattr $C$DW$T$8, DW_AT_name("short")
