TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Wed Jul 04 16:10:52 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware_drv8353/motorware_1_01_00_18/sw/drivers/drvic/drv8353/s
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware_drv8353\motorware_1_01_00_18\sw\solutions\instaspin
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3760              $C$DW$325       .dwtag  DW_TAG_enumerator
    3761                      .dwattr $C$DW$325, DW_AT_name("SPI_FifoStatus_3_Words")
    3762                      .dwattr $C$DW$325, DW_AT_const_value(0x300)
    3763              
    3764              $C$DW$326       .dwtag  DW_TAG_enumerator
    3765                      .dwattr $C$DW$326, DW_AT_name("SPI_FifoStatus_4_Words")
    3766                      .dwattr $C$DW$326, DW_AT_const_value(0x400)
    3767              
    3768                      .dwendtag $C$DW$T$102
    3769              
    3770              $C$DW$T$103     .dwtag  DW_TAG_typedef
    3771                      .dwattr $C$DW$T$103, DW_AT_name("SPI_FifoStatus_e")
    3772                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    3773                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    3774              
    3775              $C$DW$327       .dwtag  DW_TAG_TI_far_type
    3776                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$103)
    3777              
    3778              $C$DW$T$104     .dwtag  DW_TAG_volatile_type
    3779                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$327)
    3780              
    3781              
    3782              $C$DW$T$108     .dwtag  DW_TAG_enumeration_type
    3783                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x01)
    3784              $C$DW$328       .dwtag  DW_TAG_enumerator
    3785                      .dwattr $C$DW$328, DW_AT_name("CtrlMode_Read")
    3786                      .dwattr $C$DW$328, DW_AT_const_value(-32768)
    3787              
    3788              $C$DW$329       .dwtag  DW_TAG_enumerator
    3789                      .dwattr $C$DW$329, DW_AT_name("CtrlMode_Write")
    3790                      .dwattr $C$DW$329, DW_AT_const_value(0x00)
    3791              
    3792                      .dwendtag $C$DW$T$108
    3793              
    3794              $C$DW$T$109     .dwtag  DW_TAG_typedef
    3795                      .dwattr $C$DW$T$109, DW_AT_name("DRV8353_CtrlMode_e")
    3796                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
    3797                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   73

    3798              
    3799              
    3800              $C$DW$T$111     .dwtag  DW_TAG_enumeration_type
    3801                      .dwattr $C$DW$T$111, DW_AT_byte_size(0x01)
    3802              $C$DW$330       .dwtag  DW_TAG_enumerator
    3803                      .dwattr $C$DW$330, DW_AT_name("Address_Status_0")
    3804                      .dwattr $C$DW$330, DW_AT_const_value(0x00)
    3805              
    3806              $C$DW$331       .dwtag  DW_TAG_enumerator
    3807                      .dwattr $C$DW$331, DW_AT_name("Address_Status_1")
    3808                      .dwattr $C$DW$331, DW_AT_const_value(0x800)
    3809              
    3810              $C$DW$332       .dwtag  DW_TAG_enumerator
    3811                      .dwattr $C$DW$332, DW_AT_name("Address_Control_2")
    3812                      .dwattr $C$DW$332, DW_AT_const_value(0x1000)
    3813              
    3814              $C$DW$333       .dwtag  DW_TAG_enumerator
    3815                      .dwattr $C$DW$333, DW_AT_name("Address_Control_3")
    3816                      .dwattr $C$DW$333, DW_AT_const_value(0x1800)
    3817              
    3818              $C$DW$334       .dwtag  DW_TAG_enumerator
    3819                      .dwattr $C$DW$334, DW_AT_name("Address_Control_4")
    3820                      .dwattr $C$DW$334, DW_AT_const_value(0x2000)
    3821              
    3822              $C$DW$335       .dwtag  DW_TAG_enumerator
    3823                      .dwattr $C$DW$335, DW_AT_name("Address_Control_5")
    3824                      .dwattr $C$DW$335, DW_AT_const_value(0x2800)
    3825              
    3826              $C$DW$336       .dwtag  DW_TAG_enumerator
    3827                      .dwattr $C$DW$336, DW_AT_name("Address_Control_6")
    3828                      .dwattr $C$DW$336, DW_AT_const_value(0x3000)
    3829              
    3830              $C$DW$337       .dwtag  DW_TAG_enumerator
    3831                      .dwattr $C$DW$337, DW_AT_name("Address_Control_7")
    3832                      .dwattr $C$DW$337, DW_AT_const_value(0x3800)
    3833              
    3834                      .dwendtag $C$DW$T$111
    3835              
    3836              $C$DW$T$112     .dwtag  DW_TAG_typedef
    3837                      .dwattr $C$DW$T$112, DW_AT_name("DRV8353_Address_e")
    3838                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
    3839                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    3840              
    3841              $C$DW$338       .dwtag  DW_TAG_TI_far_type
    3842                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$112)
    3843              
    3844              $C$DW$T$113     .dwtag  DW_TAG_const_type
    3845                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$338)
    3846              
    3847              
    3848              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3849                      .dwattr $C$DW$T$26, DW_AT_name("_DRV8353_Obj_")
    3850                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    3851              $C$DW$339       .dwtag  DW_TAG_member
    3852                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   74

    3853                      .dwattr $C$DW$339, DW_AT_name("spiHandle")
    3854                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_spiHandle")
    3855                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3856                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3857              
    3858              $C$DW$340       .dwtag  DW_TAG_member
    3859                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$22)
    3860                      .dwattr $C$DW$340, DW_AT_name("gpioHandle")
    3861                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_gpioHandle")
    3862                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3863                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3864              
    3865              $C$DW$341       .dwtag  DW_TAG_member
    3866                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$24)
    3867                      .dwattr $C$DW$341, DW_AT_name("gpioNumber")
    3868                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_gpioNumber")
    3869                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3870                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3871              
    3872              $C$DW$342       .dwtag  DW_TAG_member
    3873                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$25)
    3874                      .dwattr $C$DW$342, DW_AT_name("RxTimeOut")
    3875                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_RxTimeOut")
    3876                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3877                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3878              
    3879              $C$DW$343       .dwtag  DW_TAG_member
    3880                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$25)
    3881                      .dwattr $C$DW$343, DW_AT_name("enableTimeOut")
    3882                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_enableTimeOut")
    3883                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3884                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3885              
    3886                      .dwendtag $C$DW$T$26
    3887              
    3888              $C$DW$T$114     .dwtag  DW_TAG_typedef
    3889                      .dwattr $C$DW$T$114, DW_AT_name("DRV8353_Obj")
    3890                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$26)
    3891                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    3892              
    3893              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    3894                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$26)
    3895                      .dwattr $C$DW$T$84, DW_AT_address_class(0x20)
    3896              
    3897              $C$DW$T$85      .dwtag  DW_TAG_typedef
    3898                      .dwattr $C$DW$T$85, DW_AT_name("DRV8353_Handle")
    3899                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    3900                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3901              
    3902              $C$DW$344       .dwtag  DW_TAG_TI_far_type
    3903                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$85)
    3904              
    3905              $C$DW$T$115     .dwtag  DW_TAG_const_type
    3906                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$344)
    3907              
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   75

    3908              
    3909              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3910                      .dwattr $C$DW$T$29, DW_AT_name("_DRV_SPI_8353_Ctrl02_t_")
    3911                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x0a)
    3912              $C$DW$345       .dwtag  DW_TAG_member
    3913                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$25)
    3914                      .dwattr $C$DW$345, DW_AT_name("CLR_FLT")
    3915                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_CLR_FLT")
    3916                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3917                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3918              
    3919              $C$DW$346       .dwtag  DW_TAG_member
    3920                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$25)
    3921                      .dwattr $C$DW$346, DW_AT_name("BRAKE")
    3922                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_BRAKE")
    3923                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3924                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3925              
    3926              $C$DW$347       .dwtag  DW_TAG_member
    3927                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$25)
    3928                      .dwattr $C$DW$347, DW_AT_name("COAST")
    3929                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_COAST")
    3930                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3931                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3932              
    3933              $C$DW$348       .dwtag  DW_TAG_member
    3934                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$25)
    3935                      .dwattr $C$DW$348, DW_AT_name("PWM1_DIR")
    3936                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_PWM1_DIR")
    3937                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3938                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3939              
    3940              $C$DW$349       .dwtag  DW_TAG_member
    3941                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$25)
    3942                      .dwattr $C$DW$349, DW_AT_name("PWM1_COM")
    3943                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_PWM1_COM")
    3944                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3945                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3946              
    3947              $C$DW$350       .dwtag  DW_TAG_member
    3948                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$28)
    3949                      .dwattr $C$DW$350, DW_AT_name("PWM_MODE")
    3950                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_PWM_MODE")
    3951                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3952                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3953              
    3954              $C$DW$351       .dwtag  DW_TAG_member
    3955                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$25)
    3956                      .dwattr $C$DW$351, DW_AT_name("OTW_REP")
    3957                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_OTW_REP")
    3958                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3959                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3960              
    3961              $C$DW$352       .dwtag  DW_TAG_member
    3962                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   76

    3963                      .dwattr $C$DW$352, DW_AT_name("DIS_GDF")
    3964                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_DIS_GDF")
    3965                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3966                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3967              
    3968              $C$DW$353       .dwtag  DW_TAG_member
    3969                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$25)
    3970                      .dwattr $C$DW$353, DW_AT_name("DIS_CPUV")
    3971                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_DIS_CPUV")
    3972                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3973                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3974              
    3975              $C$DW$354       .dwtag  DW_TAG_member
    3976                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$25)
    3977                      .dwattr $C$DW$354, DW_AT_name("OCP_ACT")
    3978                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_OCP_ACT")
    3979                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3980                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3981              
    3982                      .dwendtag $C$DW$T$29
    3983              
    3984              $C$DW$T$63      .dwtag  DW_TAG_typedef
    3985                      .dwattr $C$DW$T$63, DW_AT_name("DRV_SPI_8353_Ctrl02_t_")
    3986                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$29)
    3987                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3988              
    3989              
    3990              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3991                      .dwattr $C$DW$T$36, DW_AT_name("_DRV_SPI_8353_Ctrl03_t_")
    3992                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x03)
    3993              $C$DW$355       .dwtag  DW_TAG_member
    3994                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$31)
    3995                      .dwattr $C$DW$355, DW_AT_name("IDRIVEN_HS")
    3996                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_IDRIVEN_HS")
    3997                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3998                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3999              
    4000              $C$DW$356       .dwtag  DW_TAG_member
    4001                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$33)
    4002                      .dwattr $C$DW$356, DW_AT_name("IDRIVEP_HS")
    4003                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_IDRIVEP_HS")
    4004                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4005                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4006              
    4007              $C$DW$357       .dwtag  DW_TAG_member
    4008                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$35)
    4009                      .dwattr $C$DW$357, DW_AT_name("LOCK")
    4010                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_LOCK")
    4011                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4012                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4013              
    4014                      .dwendtag $C$DW$T$36
    4015              
    4016              $C$DW$T$64      .dwtag  DW_TAG_typedef
    4017                      .dwattr $C$DW$T$64, DW_AT_name("DRV_SPI_8353_Ctrl03_t_")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   77

    4018                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$36)
    4019                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4020              
    4021              
    4022              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    4023                      .dwattr $C$DW$T$43, DW_AT_name("_DRV_SPI_8353_Ctrl04_t_")
    4024                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    4025              $C$DW$358       .dwtag  DW_TAG_member
    4026                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$38)
    4027                      .dwattr $C$DW$358, DW_AT_name("IDRIVEN_LS")
    4028                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_IDRIVEN_LS")
    4029                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4030                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4031              
    4032              $C$DW$359       .dwtag  DW_TAG_member
    4033                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$40)
    4034                      .dwattr $C$DW$359, DW_AT_name("IDRIVEP_LS")
    4035                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_IDRIVEP_LS")
    4036                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4037                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4038              
    4039              $C$DW$360       .dwtag  DW_TAG_member
    4040                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$42)
    4041                      .dwattr $C$DW$360, DW_AT_name("TDRIVE")
    4042                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_TDRIVE")
    4043                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4044                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4045              
    4046              $C$DW$361       .dwtag  DW_TAG_member
    4047                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$25)
    4048                      .dwattr $C$DW$361, DW_AT_name("CBC")
    4049                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_CBC")
    4050                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4051                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4052              
    4053                      .dwendtag $C$DW$T$43
    4054              
    4055              $C$DW$T$65      .dwtag  DW_TAG_typedef
    4056                      .dwattr $C$DW$T$65, DW_AT_name("DRV_SPI_8353_Ctrl04_t_")
    4057                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$43)
    4058                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4059              
    4060              
    4061              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    4062                      .dwattr $C$DW$T$52, DW_AT_name("_DRV_SPI_8353_Ctrl05_t_")
    4063                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x05)
    4064              $C$DW$362       .dwtag  DW_TAG_member
    4065                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$45)
    4066                      .dwattr $C$DW$362, DW_AT_name("VDS_LVL")
    4067                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_VDS_LVL")
    4068                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4069                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4070              
    4071              $C$DW$363       .dwtag  DW_TAG_member
    4072                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$47)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   78

    4073                      .dwattr $C$DW$363, DW_AT_name("OCP_DEG")
    4074                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_OCP_DEG")
    4075                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4076                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4077              
    4078              $C$DW$364       .dwtag  DW_TAG_member
    4079                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$49)
    4080                      .dwattr $C$DW$364, DW_AT_name("OCP_MODE")
    4081                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_OCP_MODE")
    4082                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4083                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4084              
    4085              $C$DW$365       .dwtag  DW_TAG_member
    4086                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$51)
    4087                      .dwattr $C$DW$365, DW_AT_name("DEAD_TIME")
    4088                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_DEAD_TIME")
    4089                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4090                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4091              
    4092              $C$DW$366       .dwtag  DW_TAG_member
    4093                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$25)
    4094                      .dwattr $C$DW$366, DW_AT_name("TRETRY")
    4095                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_TRETRY")
    4096                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4097                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4098              
    4099                      .dwendtag $C$DW$T$52
    4100              
    4101              $C$DW$T$66      .dwtag  DW_TAG_typedef
    4102                      .dwattr $C$DW$T$66, DW_AT_name("DRV_SPI_8353_Ctrl05_t_")
    4103                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$52)
    4104                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4105              
    4106              
    4107              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    4108                      .dwattr $C$DW$T$57, DW_AT_name("_DRV_SPI_8353_Ctrl06_t_")
    4109                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x09)
    4110              $C$DW$367       .dwtag  DW_TAG_member
    4111                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$54)
    4112                      .dwattr $C$DW$367, DW_AT_name("SEN_LVL")
    4113                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_SEN_LVL")
    4114                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4115                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4116              
    4117              $C$DW$368       .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$25)
    4119                      .dwattr $C$DW$368, DW_AT_name("CSA_CAL_C")
    4120                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_CSA_CAL_C")
    4121                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4122                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4123              
    4124              $C$DW$369       .dwtag  DW_TAG_member
    4125                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$25)
    4126                      .dwattr $C$DW$369, DW_AT_name("CSA_CAL_B")
    4127                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_CSA_CAL_B")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   79

    4128                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4129                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4130              
    4131              $C$DW$370       .dwtag  DW_TAG_member
    4132                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$25)
    4133                      .dwattr $C$DW$370, DW_AT_name("CSA_CAL_A")
    4134                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_CSA_CAL_A")
    4135                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4136                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4137              
    4138              $C$DW$371       .dwtag  DW_TAG_member
    4139                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$25)
    4140                      .dwattr $C$DW$371, DW_AT_name("DIS_SEN")
    4141                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_DIS_SEN")
    4142                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4143                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4144              
    4145              $C$DW$372       .dwtag  DW_TAG_member
    4146                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$56)
    4147                      .dwattr $C$DW$372, DW_AT_name("CSA_GAIN")
    4148                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_CSA_GAIN")
    4149                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4150                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4151              
    4152              $C$DW$373       .dwtag  DW_TAG_member
    4153                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$25)
    4154                      .dwattr $C$DW$373, DW_AT_name("LS_REF")
    4155                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_LS_REF")
    4156                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4157                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4158              
    4159              $C$DW$374       .dwtag  DW_TAG_member
    4160                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$25)
    4161                      .dwattr $C$DW$374, DW_AT_name("VREF_DIV")
    4162                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_VREF_DIV")
    4163                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4164                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4165              
    4166              $C$DW$375       .dwtag  DW_TAG_member
    4167                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$25)
    4168                      .dwattr $C$DW$375, DW_AT_name("CSA_FET")
    4169                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_CSA_FET")
    4170                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4171                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4172              
    4173                      .dwendtag $C$DW$T$57
    4174              
    4175              $C$DW$T$67      .dwtag  DW_TAG_typedef
    4176                      .dwattr $C$DW$T$67, DW_AT_name("DRV_SPI_8353_Ctrl06_t_")
    4177                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$57)
    4178                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    4179              
    4180              
    4181              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    4182                      .dwattr $C$DW$T$58, DW_AT_name("_DRV_SPI_8353_Ctrl07_t_")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   80

    4183                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x0b)
    4184              $C$DW$376       .dwtag  DW_TAG_member
    4185                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$25)
    4186                      .dwattr $C$DW$376, DW_AT_name("CAL_MODE")
    4187                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_CAL_MODE")
    4188                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4189                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4190              
    4191              $C$DW$377       .dwtag  DW_TAG_member
    4192                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$25)
    4193                      .dwattr $C$DW$377, DW_AT_name("RESERVED_1")
    4194                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_RESERVED_1")
    4195                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4196                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4197              
    4198              $C$DW$378       .dwtag  DW_TAG_member
    4199                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$25)
    4200                      .dwattr $C$DW$378, DW_AT_name("RESERVED_2")
    4201                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_RESERVED_2")
    4202                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4203                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4204              
    4205              $C$DW$379       .dwtag  DW_TAG_member
    4206                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$25)
    4207                      .dwattr $C$DW$379, DW_AT_name("RESERVED_3")
    4208                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_RESERVED_3")
    4209                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4210                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4211              
    4212              $C$DW$380       .dwtag  DW_TAG_member
    4213                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$25)
    4214                      .dwattr $C$DW$380, DW_AT_name("RESERVED_4")
    4215                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_RESERVED_4")
    4216                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4217                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4218              
    4219              $C$DW$381       .dwtag  DW_TAG_member
    4220                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$25)
    4221                      .dwattr $C$DW$381, DW_AT_name("RESERVED_5")
    4222                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_RESERVED_5")
    4223                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4224                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4225              
    4226              $C$DW$382       .dwtag  DW_TAG_member
    4227                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$25)
    4228                      .dwattr $C$DW$382, DW_AT_name("RESERVED_6")
    4229                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_RESERVED_6")
    4230                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4231                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4232              
    4233              $C$DW$383       .dwtag  DW_TAG_member
    4234                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$25)
    4235                      .dwattr $C$DW$383, DW_AT_name("RESERVED_7")
    4236                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_RESERVED_7")
    4237                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   81

    4238                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4239              
    4240              $C$DW$384       .dwtag  DW_TAG_member
    4241                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$25)
    4242                      .dwattr $C$DW$384, DW_AT_name("RESERVED_8")
    4243                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_RESERVED_8")
    4244                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4245                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4246              
    4247              $C$DW$385       .dwtag  DW_TAG_member
    4248                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$25)
    4249                      .dwattr $C$DW$385, DW_AT_name("RESERVED_9")
    4250                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_RESERVED_9")
    4251                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4252                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4253              
    4254              $C$DW$386       .dwtag  DW_TAG_member
    4255                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$25)
    4256                      .dwattr $C$DW$386, DW_AT_name("RESERVED_10")
    4257                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_RESERVED_10")
    4258                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4259                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4260              
    4261                      .dwendtag $C$DW$T$58
    4262              
    4263              $C$DW$T$68      .dwtag  DW_TAG_typedef
    4264                      .dwattr $C$DW$T$68, DW_AT_name("DRV_SPI_8353_Ctrl07_t_")
    4265                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$58)
    4266                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    4267              
    4268              
    4269              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    4270                      .dwattr $C$DW$T$59, DW_AT_name("_DRV_SPI_8353_Stat00_t_")
    4271                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x0b)
    4272              $C$DW$387       .dwtag  DW_TAG_member
    4273                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$25)
    4274                      .dwattr $C$DW$387, DW_AT_name("VDS_LC")
    4275                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_VDS_LC")
    4276                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4277                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4278              
    4279              $C$DW$388       .dwtag  DW_TAG_member
    4280                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$25)
    4281                      .dwattr $C$DW$388, DW_AT_name("VDS_HC")
    4282                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_VDS_HC")
    4283                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4284                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4285              
    4286              $C$DW$389       .dwtag  DW_TAG_member
    4287                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$25)
    4288                      .dwattr $C$DW$389, DW_AT_name("VDS_LB")
    4289                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_VDS_LB")
    4290                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4291                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4292              
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   82

    4293              $C$DW$390       .dwtag  DW_TAG_member
    4294                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$25)
    4295                      .dwattr $C$DW$390, DW_AT_name("VDS_HB")
    4296                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_VDS_HB")
    4297                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4298                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4299              
    4300              $C$DW$391       .dwtag  DW_TAG_member
    4301                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$25)
    4302                      .dwattr $C$DW$391, DW_AT_name("VDS_LA")
    4303                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_VDS_LA")
    4304                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4305                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4306              
    4307              $C$DW$392       .dwtag  DW_TAG_member
    4308                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$25)
    4309                      .dwattr $C$DW$392, DW_AT_name("VDS_HA")
    4310                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_VDS_HA")
    4311                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4312                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4313              
    4314              $C$DW$393       .dwtag  DW_TAG_member
    4315                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$25)
    4316                      .dwattr $C$DW$393, DW_AT_name("OTSD")
    4317                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_OTSD")
    4318                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4319                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4320              
    4321              $C$DW$394       .dwtag  DW_TAG_member
    4322                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$25)
    4323                      .dwattr $C$DW$394, DW_AT_name("UVLO")
    4324                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_UVLO")
    4325                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4326                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4327              
    4328              $C$DW$395       .dwtag  DW_TAG_member
    4329                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$25)
    4330                      .dwattr $C$DW$395, DW_AT_name("GDF")
    4331                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_GDF")
    4332                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4333                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4334              
    4335              $C$DW$396       .dwtag  DW_TAG_member
    4336                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$25)
    4337                      .dwattr $C$DW$396, DW_AT_name("VDS_OCP")
    4338                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_VDS_OCP")
    4339                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4340                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4341              
    4342              $C$DW$397       .dwtag  DW_TAG_member
    4343                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$25)
    4344                      .dwattr $C$DW$397, DW_AT_name("FAULT")
    4345                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_FAULT")
    4346                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4347                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   83

    4348              
    4349                      .dwendtag $C$DW$T$59
    4350              
    4351              $C$DW$T$61      .dwtag  DW_TAG_typedef
    4352                      .dwattr $C$DW$T$61, DW_AT_name("DRV_SPI_8353_Stat00_t_")
    4353                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$59)
    4354                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4355              
    4356              
    4357              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4358                      .dwattr $C$DW$T$60, DW_AT_name("_DRV_SPI_8353_Stat01_t_")
    4359                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x0b)
    4360              $C$DW$398       .dwtag  DW_TAG_member
    4361                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$25)
    4362                      .dwattr $C$DW$398, DW_AT_name("VGS_LC")
    4363                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_VGS_LC")
    4364                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4365                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4366              
    4367              $C$DW$399       .dwtag  DW_TAG_member
    4368                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$25)
    4369                      .dwattr $C$DW$399, DW_AT_name("VGS_HC")
    4370                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_VGS_HC")
    4371                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4372                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4373              
    4374              $C$DW$400       .dwtag  DW_TAG_member
    4375                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$25)
    4376                      .dwattr $C$DW$400, DW_AT_name("VGS_LB")
    4377                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_VGS_LB")
    4378                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4379                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4380              
    4381              $C$DW$401       .dwtag  DW_TAG_member
    4382                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$25)
    4383                      .dwattr $C$DW$401, DW_AT_name("VGS_HB")
    4384                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_VGS_HB")
    4385                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4386                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4387              
    4388              $C$DW$402       .dwtag  DW_TAG_member
    4389                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$25)
    4390                      .dwattr $C$DW$402, DW_AT_name("VGS_LA")
    4391                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_VGS_LA")
    4392                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4393                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4394              
    4395              $C$DW$403       .dwtag  DW_TAG_member
    4396                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$25)
    4397                      .dwattr $C$DW$403, DW_AT_name("VGS_HA")
    4398                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_VGS_HA")
    4399                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4400                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4401              
    4402              $C$DW$404       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   84

    4403                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$25)
    4404                      .dwattr $C$DW$404, DW_AT_name("GDUV")
    4405                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_GDUV")
    4406                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4407                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4408              
    4409              $C$DW$405       .dwtag  DW_TAG_member
    4410                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$25)
    4411                      .dwattr $C$DW$405, DW_AT_name("OTW")
    4412                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_OTW")
    4413                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4414                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4415              
    4416              $C$DW$406       .dwtag  DW_TAG_member
    4417                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$25)
    4418                      .dwattr $C$DW$406, DW_AT_name("SC_OC")
    4419                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_SC_OC")
    4420                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4421                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4422              
    4423              $C$DW$407       .dwtag  DW_TAG_member
    4424                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$25)
    4425                      .dwattr $C$DW$407, DW_AT_name("SB_OC")
    4426                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_SB_OC")
    4427                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4428                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4429              
    4430              $C$DW$408       .dwtag  DW_TAG_member
    4431                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$25)
    4432                      .dwattr $C$DW$408, DW_AT_name("SA_OC")
    4433                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_SA_OC")
    4434                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4435                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4436              
    4437                      .dwendtag $C$DW$T$60
    4438              
    4439              $C$DW$T$62      .dwtag  DW_TAG_typedef
    4440                      .dwattr $C$DW$T$62, DW_AT_name("DRV_SPI_8353_Stat01_t_")
    4441                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$60)
    4442                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4443              
    4444              
    4445              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4446                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8353_Vars_t_")
    4447                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x48)
    4448              $C$DW$409       .dwtag  DW_TAG_member
    4449                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$61)
    4450                      .dwattr $C$DW$409, DW_AT_name("Stat_Reg_00")
    4451                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Stat_Reg_00")
    4452                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4453                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4454              
    4455              $C$DW$410       .dwtag  DW_TAG_member
    4456                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$62)
    4457                      .dwattr $C$DW$410, DW_AT_name("Stat_Reg_01")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   85

    4458                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Stat_Reg_01")
    4459                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4460                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4461              
    4462              $C$DW$411       .dwtag  DW_TAG_member
    4463                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$63)
    4464                      .dwattr $C$DW$411, DW_AT_name("Ctrl_Reg_02")
    4465                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Ctrl_Reg_02")
    4466                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4467                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4468              
    4469              $C$DW$412       .dwtag  DW_TAG_member
    4470                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$64)
    4471                      .dwattr $C$DW$412, DW_AT_name("Ctrl_Reg_03")
    4472                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Ctrl_Reg_03")
    4473                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4474                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4475              
    4476              $C$DW$413       .dwtag  DW_TAG_member
    4477                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$65)
    4478                      .dwattr $C$DW$413, DW_AT_name("Ctrl_Reg_04")
    4479                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Ctrl_Reg_04")
    4480                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4481                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4482              
    4483              $C$DW$414       .dwtag  DW_TAG_member
    4484                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$66)
    4485                      .dwattr $C$DW$414, DW_AT_name("Ctrl_Reg_05")
    4486                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Ctrl_Reg_05")
    4487                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4488                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4489              
    4490              $C$DW$415       .dwtag  DW_TAG_member
    4491                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$67)
    4492                      .dwattr $C$DW$415, DW_AT_name("Ctrl_Reg_06")
    4493                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Ctrl_Reg_06")
    4494                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4495                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4496              
    4497              $C$DW$416       .dwtag  DW_TAG_member
    4498                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$68)
    4499                      .dwattr $C$DW$416, DW_AT_name("Ctrl_Reg_07")
    4500                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Ctrl_Reg_07")
    4501                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4502                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4503              
    4504              $C$DW$417       .dwtag  DW_TAG_member
    4505                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$25)
    4506                      .dwattr $C$DW$417, DW_AT_name("WriteCmd")
    4507                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_WriteCmd")
    4508                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4509                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4510              
    4511              $C$DW$418       .dwtag  DW_TAG_member
    4512                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   86

    4513                      .dwattr $C$DW$418, DW_AT_name("ReadCmd")
    4514                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_ReadCmd")
    4515                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4516                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4517              
    4518              $C$DW$419       .dwtag  DW_TAG_member
    4519                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$69)
    4520                      .dwattr $C$DW$419, DW_AT_name("ManWriteAddr")
    4521                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_ManWriteAddr")
    4522                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4523                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4524              
    4525              $C$DW$420       .dwtag  DW_TAG_member
    4526                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$69)
    4527                      .dwattr $C$DW$420, DW_AT_name("ManReadAddr")
    4528                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_ManReadAddr")
    4529                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4530                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4531              
    4532              $C$DW$421       .dwtag  DW_TAG_member
    4533                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$69)
    4534                      .dwattr $C$DW$421, DW_AT_name("ManWriteData")
    4535                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_ManWriteData")
    4536                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4537                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4538              
    4539              $C$DW$422       .dwtag  DW_TAG_member
    4540                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$69)
    4541                      .dwattr $C$DW$422, DW_AT_name("ManReadData")
    4542                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_ManReadData")
    4543                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4544                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4545              
    4546              $C$DW$423       .dwtag  DW_TAG_member
    4547                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$25)
    4548                      .dwattr $C$DW$423, DW_AT_name("ManWriteCmd")
    4549                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_ManWriteCmd")
    4550                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4551                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4552              
    4553              $C$DW$424       .dwtag  DW_TAG_member
    4554                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$25)
    4555                      .dwattr $C$DW$424, DW_AT_name("ManReadCmd")
    4556                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_ManReadCmd")
    4557                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4558                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4559              
    4560                      .dwendtag $C$DW$T$70
    4561              
    4562              $C$DW$T$121     .dwtag  DW_TAG_typedef
    4563                      .dwattr $C$DW$T$121, DW_AT_name("DRV_SPI_8353_Vars_t")
    4564                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$70)
    4565                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    4566              
    4567              $C$DW$T$122     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   87

    4568                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    4569                      .dwattr $C$DW$T$122, DW_AT_address_class(0x20)
    4570              
    4571              $C$DW$425       .dwtag  DW_TAG_TI_far_type
    4572                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$122)
    4573              
    4574              $C$DW$T$123     .dwtag  DW_TAG_const_type
    4575                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$425)
    4576              
    4577              
    4578              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    4579                      .dwattr $C$DW$T$80, DW_AT_name("_GPIO_Obj_")
    4580                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x6a)
    4581              $C$DW$426       .dwtag  DW_TAG_member
    4582                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$72)
    4583                      .dwattr $C$DW$426, DW_AT_name("GPACTRL")
    4584                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_GPACTRL")
    4585                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4586                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4587              
    4588              $C$DW$427       .dwtag  DW_TAG_member
    4589                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$72)
    4590                      .dwattr $C$DW$427, DW_AT_name("GPAQSEL1")
    4591                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_GPAQSEL1")
    4592                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4593                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4594              
    4595              $C$DW$428       .dwtag  DW_TAG_member
    4596                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$72)
    4597                      .dwattr $C$DW$428, DW_AT_name("GPAQSEL2")
    4598                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_GPAQSEL2")
    4599                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4600                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4601              
    4602              $C$DW$429       .dwtag  DW_TAG_member
    4603                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$72)
    4604                      .dwattr $C$DW$429, DW_AT_name("GPAMUX1")
    4605                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_GPAMUX1")
    4606                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4607                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4608              
    4609              $C$DW$430       .dwtag  DW_TAG_member
    4610                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$72)
    4611                      .dwattr $C$DW$430, DW_AT_name("GPAMUX2")
    4612                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_GPAMUX2")
    4613                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4614                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4615              
    4616              $C$DW$431       .dwtag  DW_TAG_member
    4617                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$72)
    4618                      .dwattr $C$DW$431, DW_AT_name("GPADIR")
    4619                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_GPADIR")
    4620                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4621                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4622              
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   88

    4623              $C$DW$432       .dwtag  DW_TAG_member
    4624                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$72)
    4625                      .dwattr $C$DW$432, DW_AT_name("GPAPUD")
    4626                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_GPAPUD")
    4627                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4628                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4629              
    4630              $C$DW$433       .dwtag  DW_TAG_member
    4631                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$74)
    4632                      .dwattr $C$DW$433, DW_AT_name("rsvd_1")
    4633                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_rsvd_1")
    4634                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4635                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4636              
    4637              $C$DW$434       .dwtag  DW_TAG_member
    4638                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$72)
    4639                      .dwattr $C$DW$434, DW_AT_name("GPBCTRL")
    4640                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_GPBCTRL")
    4641                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4642                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4643              
    4644              $C$DW$435       .dwtag  DW_TAG_member
    4645                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$72)
    4646                      .dwattr $C$DW$435, DW_AT_name("GPBQSEL1")
    4647                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_GPBQSEL1")
    4648                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4649                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4650              
    4651              $C$DW$436       .dwtag  DW_TAG_member
    4652                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$74)
    4653                      .dwattr $C$DW$436, DW_AT_name("rsvd_2")
    4654                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_rsvd_2")
    4655                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4656                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4657              
    4658              $C$DW$437       .dwtag  DW_TAG_member
    4659                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$72)
    4660                      .dwattr $C$DW$437, DW_AT_name("GPBMUX1")
    4661                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_GPBMUX1")
    4662                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4663                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4664              
    4665              $C$DW$438       .dwtag  DW_TAG_member
    4666                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$74)
    4667                      .dwattr $C$DW$438, DW_AT_name("rsvd_3")
    4668                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_rsvd_3")
    4669                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4670                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4671              
    4672              $C$DW$439       .dwtag  DW_TAG_member
    4673                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$72)
    4674                      .dwattr $C$DW$439, DW_AT_name("GPBDIR")
    4675                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_GPBDIR")
    4676                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4677                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   89

    4678              
    4679              $C$DW$440       .dwtag  DW_TAG_member
    4680                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$72)
    4681                      .dwattr $C$DW$440, DW_AT_name("GPBPUD")
    4682                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_GPBPUD")
    4683                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4684                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4685              
    4686              $C$DW$441       .dwtag  DW_TAG_member
    4687                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$75)
    4688                      .dwattr $C$DW$441, DW_AT_name("rsvd_4")
    4689                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_rsvd_4")
    4690                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4691                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4692              
    4693              $C$DW$442       .dwtag  DW_TAG_member
    4694                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$72)
    4695                      .dwattr $C$DW$442, DW_AT_name("AIOMUX1")
    4696                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_AIOMUX1")
    4697                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4698                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4699              
    4700              $C$DW$443       .dwtag  DW_TAG_member
    4701                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$74)
    4702                      .dwattr $C$DW$443, DW_AT_name("rsvd_5")
    4703                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_rsvd_5")
    4704                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4705                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4706              
    4707              $C$DW$444       .dwtag  DW_TAG_member
    4708                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$72)
    4709                      .dwattr $C$DW$444, DW_AT_name("AIODIR")
    4710                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_AIODIR")
    4711                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4712                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4713              
    4714              $C$DW$445       .dwtag  DW_TAG_member
    4715                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$76)
    4716                      .dwattr $C$DW$445, DW_AT_name("rsvd_6")
    4717                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_rsvd_6")
    4718                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4719                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4720              
    4721              $C$DW$446       .dwtag  DW_TAG_member
    4722                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$72)
    4723                      .dwattr $C$DW$446, DW_AT_name("GPADAT")
    4724                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_GPADAT")
    4725                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4726                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4727              
    4728              $C$DW$447       .dwtag  DW_TAG_member
    4729                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$72)
    4730                      .dwattr $C$DW$447, DW_AT_name("GPASET")
    4731                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_GPASET")
    4732                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   90

    4733                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4734              
    4735              $C$DW$448       .dwtag  DW_TAG_member
    4736                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$72)
    4737                      .dwattr $C$DW$448, DW_AT_name("GPACLEAR")
    4738                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_GPACLEAR")
    4739                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4740                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4741              
    4742              $C$DW$449       .dwtag  DW_TAG_member
    4743                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$72)
    4744                      .dwattr $C$DW$449, DW_AT_name("GPATOGGLE")
    4745                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_GPATOGGLE")
    4746                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4747                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4748              
    4749              $C$DW$450       .dwtag  DW_TAG_member
    4750                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$72)
    4751                      .dwattr $C$DW$450, DW_AT_name("GPBDAT")
    4752                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_GPBDAT")
    4753                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4754                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4755              
    4756              $C$DW$451       .dwtag  DW_TAG_member
    4757                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$72)
    4758                      .dwattr $C$DW$451, DW_AT_name("GPBSET")
    4759                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_GPBSET")
    4760                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4761                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4762              
    4763              $C$DW$452       .dwtag  DW_TAG_member
    4764                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$72)
    4765                      .dwattr $C$DW$452, DW_AT_name("GPBCLEAR")
    4766                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_GPBCLEAR")
    4767                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4768                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4769              
    4770              $C$DW$453       .dwtag  DW_TAG_member
    4771                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$72)
    4772                      .dwattr $C$DW$453, DW_AT_name("GPBTOGGLE")
    4773                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_GPBTOGGLE")
    4774                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4775                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4776              
    4777              $C$DW$454       .dwtag  DW_TAG_member
    4778                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$77)
    4779                      .dwattr $C$DW$454, DW_AT_name("rsvd_7")
    4780                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_rsvd_7")
    4781                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4782                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4783              
    4784              $C$DW$455       .dwtag  DW_TAG_member
    4785                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$72)
    4786                      .dwattr $C$DW$455, DW_AT_name("AIODAT")
    4787                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_AIODAT")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   91

    4788                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4789                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4790              
    4791              $C$DW$456       .dwtag  DW_TAG_member
    4792                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$72)
    4793                      .dwattr $C$DW$456, DW_AT_name("AIOSET")
    4794                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_AIOSET")
    4795                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    4796                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4797              
    4798              $C$DW$457       .dwtag  DW_TAG_member
    4799                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$72)
    4800                      .dwattr $C$DW$457, DW_AT_name("AIOCLEAR")
    4801                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_AIOCLEAR")
    4802                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4803                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4804              
    4805              $C$DW$458       .dwtag  DW_TAG_member
    4806                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$72)
    4807                      .dwattr $C$DW$458, DW_AT_name("AIOTOGGLE")
    4808                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_AIOTOGGLE")
    4809                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4810                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4811              
    4812              $C$DW$459       .dwtag  DW_TAG_member
    4813                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$78)
    4814                      .dwattr $C$DW$459, DW_AT_name("GPIOXINTnSEL")
    4815                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    4816                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4817                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4818              
    4819              $C$DW$460       .dwtag  DW_TAG_member
    4820                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$79)
    4821                      .dwattr $C$DW$460, DW_AT_name("rsvd_8")
    4822                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_rsvd_8")
    4823                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    4824                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4825              
    4826              $C$DW$461       .dwtag  DW_TAG_member
    4827                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$72)
    4828                      .dwattr $C$DW$461, DW_AT_name("GPIOLPMSEL")
    4829                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    4830                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    4831                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4832              
    4833                      .dwendtag $C$DW$T$80
    4834              
    4835              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    4836                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$80)
    4837                      .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    4838              
    4839              $C$DW$T$22      .dwtag  DW_TAG_typedef
    4840                      .dwattr $C$DW$T$22, DW_AT_name("GPIO_Handle")
    4841                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    4842                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   92

    4843              
    4844              $C$DW$462       .dwtag  DW_TAG_TI_far_type
    4845                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$22)
    4846              
    4847              $C$DW$T$126     .dwtag  DW_TAG_const_type
    4848                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$462)
    4849              
    4850              
    4851              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    4852                      .dwattr $C$DW$T$81, DW_AT_name("_SPI_Obj_")
    4853                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x10)
    4854              $C$DW$463       .dwtag  DW_TAG_member
    4855                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$73)
    4856                      .dwattr $C$DW$463, DW_AT_name("SPICCR")
    4857                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_SPICCR")
    4858                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4859                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4860              
    4861              $C$DW$464       .dwtag  DW_TAG_member
    4862                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$73)
    4863                      .dwattr $C$DW$464, DW_AT_name("SPICTL")
    4864                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_SPICTL")
    4865                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4866                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4867              
    4868              $C$DW$465       .dwtag  DW_TAG_member
    4869                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$73)
    4870                      .dwattr $C$DW$465, DW_AT_name("SPIST")
    4871                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_SPIST")
    4872                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4873                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4874              
    4875              $C$DW$466       .dwtag  DW_TAG_member
    4876                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$73)
    4877                      .dwattr $C$DW$466, DW_AT_name("rsvd_1")
    4878                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_rsvd_1")
    4879                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4880                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4881              
    4882              $C$DW$467       .dwtag  DW_TAG_member
    4883                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$73)
    4884                      .dwattr $C$DW$467, DW_AT_name("SPIBRR")
    4885                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_SPIBRR")
    4886                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4887                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4888              
    4889              $C$DW$468       .dwtag  DW_TAG_member
    4890                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$73)
    4891                      .dwattr $C$DW$468, DW_AT_name("rsvd_2")
    4892                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_rsvd_2")
    4893                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4894                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4895              
    4896              $C$DW$469       .dwtag  DW_TAG_member
    4897                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$73)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   93

    4898                      .dwattr $C$DW$469, DW_AT_name("SPIEMU")
    4899                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_SPIEMU")
    4900                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4901                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4902              
    4903              $C$DW$470       .dwtag  DW_TAG_member
    4904                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$73)
    4905                      .dwattr $C$DW$470, DW_AT_name("SPIRXBUF")
    4906                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_SPIRXBUF")
    4907                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4908                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4909              
    4910              $C$DW$471       .dwtag  DW_TAG_member
    4911                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$73)
    4912                      .dwattr $C$DW$471, DW_AT_name("SPITXBUF")
    4913                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_SPITXBUF")
    4914                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4915                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4916              
    4917              $C$DW$472       .dwtag  DW_TAG_member
    4918                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$73)
    4919                      .dwattr $C$DW$472, DW_AT_name("SPIDAT")
    4920                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_SPIDAT")
    4921                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4922                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4923              
    4924              $C$DW$473       .dwtag  DW_TAG_member
    4925                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$73)
    4926                      .dwattr $C$DW$473, DW_AT_name("SPIFFTX")
    4927                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_SPIFFTX")
    4928                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4929                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4930              
    4931              $C$DW$474       .dwtag  DW_TAG_member
    4932                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$73)
    4933                      .dwattr $C$DW$474, DW_AT_name("SPIFFRX")
    4934                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_SPIFFRX")
    4935                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4936                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4937              
    4938              $C$DW$475       .dwtag  DW_TAG_member
    4939                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$73)
    4940                      .dwattr $C$DW$475, DW_AT_name("SPIFFCT")
    4941                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_SPIFFCT")
    4942                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4943                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4944              
    4945              $C$DW$476       .dwtag  DW_TAG_member
    4946                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$74)
    4947                      .dwattr $C$DW$476, DW_AT_name("rsvd_3")
    4948                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_rsvd_3")
    4949                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4950                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4951              
    4952              $C$DW$477       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   94

    4953                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$73)
    4954                      .dwattr $C$DW$477, DW_AT_name("SPIPRI")
    4955                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_SPIPRI")
    4956                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4957                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4958              
    4959                      .dwendtag $C$DW$T$81
    4960              
    4961              $C$DW$T$128     .dwtag  DW_TAG_typedef
    4962                      .dwattr $C$DW$T$128, DW_AT_name("SPI_Obj")
    4963                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$81)
    4964                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    4965              
    4966              $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    4967                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$81)
    4968                      .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
    4969              
    4970              $C$DW$T$20      .dwtag  DW_TAG_typedef
    4971                      .dwattr $C$DW$T$20, DW_AT_name("SPI_Handle")
    4972                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    4973                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4974              
    4975              $C$DW$478       .dwtag  DW_TAG_TI_far_type
    4976                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
    4977              
    4978              $C$DW$T$129     .dwtag  DW_TAG_const_type
    4979                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$478)
    4980              
    4981              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4982                      .dwattr $C$DW$T$2, DW_AT_name("void")
    4983              
    4984              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4985                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    4986                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    4987              
    4988              $C$DW$479       .dwtag  DW_TAG_TI_far_type
    4989                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$3)
    4990              
    4991              $C$DW$T$131     .dwtag  DW_TAG_const_type
    4992                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$479)
    4993              
    4994              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4995                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4996                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4997                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4998              
    4999              $C$DW$T$5       .dwtag  DW_TAG_base_type
    5000                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    5001                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    5002                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    5003              
    5004              $C$DW$T$6       .dwtag  DW_TAG_base_type
    5005                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    5006                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    5007                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 16:10:52 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1506410                         PAGE   95

    5008              
    5009              $C$DW$T$7       .dwtag  DW_TAG_base_type
    5010                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    5011                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    5012                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    5013              
    5014              $C$DW$T$8       .dwtag  DW_TAG_base_type
    5015                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    5016                      .dwattr $C$DW$T$8, DW_AT_name("short")
    5017                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    5018              
    5019              $C$DW$T$9       .dwtag  DW_TAG_base_type
