TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Wed Jul 04 10:32:23 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware_drv8353/motorware_1_01_00_18/sw/modules/hal/boards/drv8
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware_drv8353\motorware_1_01_00_18\sw\solutions\instaspin
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SPI_setBaudRate")

   13035                      .dwendtag $C$DW$T$336
   13036              
   13037              $C$DW$T$337     .dwtag  DW_TAG_typedef
   13038                      .dwattr $C$DW$T$337, DW_AT_name("SPI_Mode_e")
   13039                      .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$336)
   13040                      .dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
   13041              
   13042              $C$DW$1736      .dwtag  DW_TAG_TI_far_type
   13043                      .dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$337)
   13044              
   13045              $C$DW$T$338     .dwtag  DW_TAG_const_type
   13046                      .dwattr $C$DW$T$338, DW_AT_type(*$C$DW$1736)
   13047              
   13048              
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  247

   13049              $C$DW$T$339     .dwtag  DW_TAG_enumeration_type
   13050                      .dwattr $C$DW$T$339, DW_AT_byte_size(0x01)
   13051              $C$DW$1737      .dwtag  DW_TAG_enumerator
   13052                      .dwattr $C$DW$1737, DW_AT_name("SPI_TxSuspend_00")
   13053                      .dwattr $C$DW$1737, DW_AT_const_value(0x00)
   13054              
   13055              $C$DW$1738      .dwtag  DW_TAG_enumerator
   13056                      .dwattr $C$DW$1738, DW_AT_name("SPI_TxSuspend_10")
   13057                      .dwattr $C$DW$1738, DW_AT_const_value(0x20)
   13058              
   13059              $C$DW$1739      .dwtag  DW_TAG_enumerator
   13060                      .dwattr $C$DW$1739, DW_AT_name("SPI_TxSuspend_free")
   13061                      .dwattr $C$DW$1739, DW_AT_const_value(0x10)
   13062              
   13063                      .dwendtag $C$DW$T$339
   13064              
   13065              $C$DW$T$340     .dwtag  DW_TAG_typedef
   13066                      .dwattr $C$DW$T$340, DW_AT_name("SPI_EmulationSuspend_e")
   13067                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$T$339)
   13068                      .dwattr $C$DW$T$340, DW_AT_language(DW_LANG_C)
   13069              
   13070              $C$DW$1740      .dwtag  DW_TAG_TI_far_type
   13071                      .dwattr $C$DW$1740, DW_AT_type(*$C$DW$T$340)
   13072              
   13073              $C$DW$T$341     .dwtag  DW_TAG_const_type
   13074                      .dwattr $C$DW$T$341, DW_AT_type(*$C$DW$1740)
   13075              
   13076              
   13077              $C$DW$T$342     .dwtag  DW_TAG_enumeration_type
   13078                      .dwattr $C$DW$T$342, DW_AT_byte_size(0x01)
   13079              $C$DW$1741      .dwtag  DW_TAG_enumerator
   13080                      .dwattr $C$DW$1741, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement")
   13081                      .dwattr $C$DW$1741, DW_AT_const_value(0x00)
   13082              
   13083              $C$DW$1742      .dwtag  DW_TAG_enumerator
   13084                      .dwattr $C$DW$1742, DW_AT_name("TIMER_EmulationMode_StopAtZero")
   13085                      .dwattr $C$DW$1742, DW_AT_const_value(0x400)
   13086              
   13087              $C$DW$1743      .dwtag  DW_TAG_enumerator
   13088                      .dwattr $C$DW$1743, DW_AT_name("TIMER_EmulationMode_RunFree")
   13089                      .dwattr $C$DW$1743, DW_AT_const_value(0x800)
   13090              
   13091                      .dwendtag $C$DW$T$342
   13092              
   13093              $C$DW$T$343     .dwtag  DW_TAG_typedef
   13094                      .dwattr $C$DW$T$343, DW_AT_name("TIMER_EmulationMode_e")
   13095                      .dwattr $C$DW$T$343, DW_AT_type(*$C$DW$T$342)
   13096                      .dwattr $C$DW$T$343, DW_AT_language(DW_LANG_C)
   13097              
   13098              $C$DW$1744      .dwtag  DW_TAG_TI_far_type
   13099                      .dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$343)
   13100              
   13101              $C$DW$T$344     .dwtag  DW_TAG_const_type
   13102                      .dwattr $C$DW$T$344, DW_AT_type(*$C$DW$1744)
   13103              
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  248

   13104              
   13105              $C$DW$T$345     .dwtag  DW_TAG_enumeration_type
   13106                      .dwattr $C$DW$T$345, DW_AT_byte_size(0x01)
   13107              $C$DW$1745      .dwtag  DW_TAG_enumerator
   13108                      .dwattr $C$DW$1745, DW_AT_name("HAL_SensorType_Current")
   13109                      .dwattr $C$DW$1745, DW_AT_const_value(0x00)
   13110              
   13111              $C$DW$1746      .dwtag  DW_TAG_enumerator
   13112                      .dwattr $C$DW$1746, DW_AT_name("HAL_SensorType_Voltage")
   13113                      .dwattr $C$DW$1746, DW_AT_const_value(0x01)
   13114              
   13115                      .dwendtag $C$DW$T$345
   13116              
   13117              $C$DW$T$346     .dwtag  DW_TAG_typedef
   13118                      .dwattr $C$DW$T$346, DW_AT_name("HAL_SensorType_e")
   13119                      .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$345)
   13120                      .dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
   13121              
   13122              
   13123              $C$DW$T$29      .dwtag  DW_TAG_structure_type
   13124                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
   13125                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
   13126              $C$DW$1747      .dwtag  DW_TAG_member
   13127                      .dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$23)
   13128                      .dwattr $C$DW$1747, DW_AT_name("ADCRESULT")
   13129                      .dwattr $C$DW$1747, DW_AT_TI_symbol_name("_ADCRESULT")
   13130                      .dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13131                      .dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
   13132              
   13133              $C$DW$1748      .dwtag  DW_TAG_member
   13134                      .dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$24)
   13135                      .dwattr $C$DW$1748, DW_AT_name("resvd_1")
   13136                      .dwattr $C$DW$1748, DW_AT_TI_symbol_name("_resvd_1")
   13137                      .dwattr $C$DW$1748, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13138                      .dwattr $C$DW$1748, DW_AT_accessibility(DW_ACCESS_public)
   13139              
   13140              $C$DW$1749      .dwtag  DW_TAG_member
   13141                      .dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$22)
   13142                      .dwattr $C$DW$1749, DW_AT_name("ADCCTL1")
   13143                      .dwattr $C$DW$1749, DW_AT_TI_symbol_name("_ADCCTL1")
   13144                      .dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   13145                      .dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
   13146              
   13147              $C$DW$1750      .dwtag  DW_TAG_member
   13148                      .dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$22)
   13149                      .dwattr $C$DW$1750, DW_AT_name("ADCCTL2")
   13150                      .dwattr $C$DW$1750, DW_AT_TI_symbol_name("_ADCCTL2")
   13151                      .dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   13152                      .dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
   13153              
   13154              $C$DW$1751      .dwtag  DW_TAG_member
   13155                      .dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$25)
   13156                      .dwattr $C$DW$1751, DW_AT_name("rsvd_2")
   13157                      .dwattr $C$DW$1751, DW_AT_TI_symbol_name("_rsvd_2")
   13158                      .dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  249

   13159                      .dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
   13160              
   13161              $C$DW$1752      .dwtag  DW_TAG_member
   13162                      .dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$22)
   13163                      .dwattr $C$DW$1752, DW_AT_name("ADCINTFLG")
   13164                      .dwattr $C$DW$1752, DW_AT_TI_symbol_name("_ADCINTFLG")
   13165                      .dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   13166                      .dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
   13167              
   13168              $C$DW$1753      .dwtag  DW_TAG_member
   13169                      .dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$22)
   13170                      .dwattr $C$DW$1753, DW_AT_name("ADCINTFLGCLR")
   13171                      .dwattr $C$DW$1753, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   13172                      .dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   13173                      .dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
   13174              
   13175              $C$DW$1754      .dwtag  DW_TAG_member
   13176                      .dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$22)
   13177                      .dwattr $C$DW$1754, DW_AT_name("ADCINTOVF")
   13178                      .dwattr $C$DW$1754, DW_AT_TI_symbol_name("_ADCINTOVF")
   13179                      .dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   13180                      .dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
   13181              
   13182              $C$DW$1755      .dwtag  DW_TAG_member
   13183                      .dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$22)
   13184                      .dwattr $C$DW$1755, DW_AT_name("ADCINTOVFCLR")
   13185                      .dwattr $C$DW$1755, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   13186                      .dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   13187                      .dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
   13188              
   13189              $C$DW$1756      .dwtag  DW_TAG_member
   13190                      .dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$26)
   13191                      .dwattr $C$DW$1756, DW_AT_name("INTSELxNy")
   13192                      .dwattr $C$DW$1756, DW_AT_TI_symbol_name("_INTSELxNy")
   13193                      .dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   13194                      .dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
   13195              
   13196              $C$DW$1757      .dwtag  DW_TAG_member
   13197                      .dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$27)
   13198                      .dwattr $C$DW$1757, DW_AT_name("rsvd_3")
   13199                      .dwattr $C$DW$1757, DW_AT_TI_symbol_name("_rsvd_3")
   13200                      .dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   13201                      .dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
   13202              
   13203              $C$DW$1758      .dwtag  DW_TAG_member
   13204                      .dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$22)
   13205                      .dwattr $C$DW$1758, DW_AT_name("SOCPRICTRL")
   13206                      .dwattr $C$DW$1758, DW_AT_TI_symbol_name("_SOCPRICTRL")
   13207                      .dwattr $C$DW$1758, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   13208                      .dwattr $C$DW$1758, DW_AT_accessibility(DW_ACCESS_public)
   13209              
   13210              $C$DW$1759      .dwtag  DW_TAG_member
   13211                      .dwattr $C$DW$1759, DW_AT_type(*$C$DW$T$22)
   13212                      .dwattr $C$DW$1759, DW_AT_name("rsvd_4")
   13213                      .dwattr $C$DW$1759, DW_AT_TI_symbol_name("_rsvd_4")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  250

   13214                      .dwattr $C$DW$1759, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   13215                      .dwattr $C$DW$1759, DW_AT_accessibility(DW_ACCESS_public)
   13216              
   13217              $C$DW$1760      .dwtag  DW_TAG_member
   13218                      .dwattr $C$DW$1760, DW_AT_type(*$C$DW$T$22)
   13219                      .dwattr $C$DW$1760, DW_AT_name("ADCSAMPLEMODE")
   13220                      .dwattr $C$DW$1760, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   13221                      .dwattr $C$DW$1760, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   13222                      .dwattr $C$DW$1760, DW_AT_accessibility(DW_ACCESS_public)
   13223              
   13224              $C$DW$1761      .dwtag  DW_TAG_member
   13225                      .dwattr $C$DW$1761, DW_AT_type(*$C$DW$T$22)
   13226                      .dwattr $C$DW$1761, DW_AT_name("rsvd_5")
   13227                      .dwattr $C$DW$1761, DW_AT_TI_symbol_name("_rsvd_5")
   13228                      .dwattr $C$DW$1761, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   13229                      .dwattr $C$DW$1761, DW_AT_accessibility(DW_ACCESS_public)
   13230              
   13231              $C$DW$1762      .dwtag  DW_TAG_member
   13232                      .dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$22)
   13233                      .dwattr $C$DW$1762, DW_AT_name("ADCINTSOCSEL1")
   13234                      .dwattr $C$DW$1762, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   13235                      .dwattr $C$DW$1762, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   13236                      .dwattr $C$DW$1762, DW_AT_accessibility(DW_ACCESS_public)
   13237              
   13238              $C$DW$1763      .dwtag  DW_TAG_member
   13239                      .dwattr $C$DW$1763, DW_AT_type(*$C$DW$T$22)
   13240                      .dwattr $C$DW$1763, DW_AT_name("ADCINTSOCSEL2")
   13241                      .dwattr $C$DW$1763, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   13242                      .dwattr $C$DW$1763, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   13243                      .dwattr $C$DW$1763, DW_AT_accessibility(DW_ACCESS_public)
   13244              
   13245              $C$DW$1764      .dwtag  DW_TAG_member
   13246                      .dwattr $C$DW$1764, DW_AT_type(*$C$DW$T$25)
   13247                      .dwattr $C$DW$1764, DW_AT_name("rsvd_6")
   13248                      .dwattr $C$DW$1764, DW_AT_TI_symbol_name("_rsvd_6")
   13249                      .dwattr $C$DW$1764, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   13250                      .dwattr $C$DW$1764, DW_AT_accessibility(DW_ACCESS_public)
   13251              
   13252              $C$DW$1765      .dwtag  DW_TAG_member
   13253                      .dwattr $C$DW$1765, DW_AT_type(*$C$DW$T$22)
   13254                      .dwattr $C$DW$1765, DW_AT_name("ADCSOCFLG1")
   13255                      .dwattr $C$DW$1765, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   13256                      .dwattr $C$DW$1765, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   13257                      .dwattr $C$DW$1765, DW_AT_accessibility(DW_ACCESS_public)
   13258              
   13259              $C$DW$1766      .dwtag  DW_TAG_member
   13260                      .dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$22)
   13261                      .dwattr $C$DW$1766, DW_AT_name("rsvd_7")
   13262                      .dwattr $C$DW$1766, DW_AT_TI_symbol_name("_rsvd_7")
   13263                      .dwattr $C$DW$1766, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   13264                      .dwattr $C$DW$1766, DW_AT_accessibility(DW_ACCESS_public)
   13265              
   13266              $C$DW$1767      .dwtag  DW_TAG_member
   13267                      .dwattr $C$DW$1767, DW_AT_type(*$C$DW$T$22)
   13268                      .dwattr $C$DW$1767, DW_AT_name("ADCSOCFRC1")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  251

   13269                      .dwattr $C$DW$1767, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   13270                      .dwattr $C$DW$1767, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   13271                      .dwattr $C$DW$1767, DW_AT_accessibility(DW_ACCESS_public)
   13272              
   13273              $C$DW$1768      .dwtag  DW_TAG_member
   13274                      .dwattr $C$DW$1768, DW_AT_type(*$C$DW$T$22)
   13275                      .dwattr $C$DW$1768, DW_AT_name("rsvd_8")
   13276                      .dwattr $C$DW$1768, DW_AT_TI_symbol_name("_rsvd_8")
   13277                      .dwattr $C$DW$1768, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   13278                      .dwattr $C$DW$1768, DW_AT_accessibility(DW_ACCESS_public)
   13279              
   13280              $C$DW$1769      .dwtag  DW_TAG_member
   13281                      .dwattr $C$DW$1769, DW_AT_type(*$C$DW$T$22)
   13282                      .dwattr $C$DW$1769, DW_AT_name("ADCSOCOVF1")
   13283                      .dwattr $C$DW$1769, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   13284                      .dwattr $C$DW$1769, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   13285                      .dwattr $C$DW$1769, DW_AT_accessibility(DW_ACCESS_public)
   13286              
   13287              $C$DW$1770      .dwtag  DW_TAG_member
   13288                      .dwattr $C$DW$1770, DW_AT_type(*$C$DW$T$22)
   13289                      .dwattr $C$DW$1770, DW_AT_name("rsvd_9")
   13290                      .dwattr $C$DW$1770, DW_AT_TI_symbol_name("_rsvd_9")
   13291                      .dwattr $C$DW$1770, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   13292                      .dwattr $C$DW$1770, DW_AT_accessibility(DW_ACCESS_public)
   13293              
   13294              $C$DW$1771      .dwtag  DW_TAG_member
   13295                      .dwattr $C$DW$1771, DW_AT_type(*$C$DW$T$22)
   13296                      .dwattr $C$DW$1771, DW_AT_name("ADCSOCOVFCLR1")
   13297                      .dwattr $C$DW$1771, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   13298                      .dwattr $C$DW$1771, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   13299                      .dwattr $C$DW$1771, DW_AT_accessibility(DW_ACCESS_public)
   13300              
   13301              $C$DW$1772      .dwtag  DW_TAG_member
   13302                      .dwattr $C$DW$1772, DW_AT_type(*$C$DW$T$22)
   13303                      .dwattr $C$DW$1772, DW_AT_name("rsvd_10")
   13304                      .dwattr $C$DW$1772, DW_AT_TI_symbol_name("_rsvd_10")
   13305                      .dwattr $C$DW$1772, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   13306                      .dwattr $C$DW$1772, DW_AT_accessibility(DW_ACCESS_public)
   13307              
   13308              $C$DW$1773      .dwtag  DW_TAG_member
   13309                      .dwattr $C$DW$1773, DW_AT_type(*$C$DW$T$23)
   13310                      .dwattr $C$DW$1773, DW_AT_name("ADCSOCxCTL")
   13311                      .dwattr $C$DW$1773, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   13312                      .dwattr $C$DW$1773, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   13313                      .dwattr $C$DW$1773, DW_AT_accessibility(DW_ACCESS_public)
   13314              
   13315              $C$DW$1774      .dwtag  DW_TAG_member
   13316                      .dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$23)
   13317                      .dwattr $C$DW$1774, DW_AT_name("rsvd_11")
   13318                      .dwattr $C$DW$1774, DW_AT_TI_symbol_name("_rsvd_11")
   13319                      .dwattr $C$DW$1774, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   13320                      .dwattr $C$DW$1774, DW_AT_accessibility(DW_ACCESS_public)
   13321              
   13322              $C$DW$1775      .dwtag  DW_TAG_member
   13323                      .dwattr $C$DW$1775, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  252

   13324                      .dwattr $C$DW$1775, DW_AT_name("ADCREFTRIM")
   13325                      .dwattr $C$DW$1775, DW_AT_TI_symbol_name("_ADCREFTRIM")
   13326                      .dwattr $C$DW$1775, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   13327                      .dwattr $C$DW$1775, DW_AT_accessibility(DW_ACCESS_public)
   13328              
   13329              $C$DW$1776      .dwtag  DW_TAG_member
   13330                      .dwattr $C$DW$1776, DW_AT_type(*$C$DW$T$22)
   13331                      .dwattr $C$DW$1776, DW_AT_name("ADCOFFTRIM")
   13332                      .dwattr $C$DW$1776, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   13333                      .dwattr $C$DW$1776, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   13334                      .dwattr $C$DW$1776, DW_AT_accessibility(DW_ACCESS_public)
   13335              
   13336              $C$DW$1777      .dwtag  DW_TAG_member
   13337                      .dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$28)
   13338                      .dwattr $C$DW$1777, DW_AT_name("resvd_12")
   13339                      .dwattr $C$DW$1777, DW_AT_TI_symbol_name("_resvd_12")
   13340                      .dwattr $C$DW$1777, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   13341                      .dwattr $C$DW$1777, DW_AT_accessibility(DW_ACCESS_public)
   13342              
   13343              $C$DW$1778      .dwtag  DW_TAG_member
   13344                      .dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$22)
   13345                      .dwattr $C$DW$1778, DW_AT_name("ADCREV")
   13346                      .dwattr $C$DW$1778, DW_AT_TI_symbol_name("_ADCREV")
   13347                      .dwattr $C$DW$1778, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   13348                      .dwattr $C$DW$1778, DW_AT_accessibility(DW_ACCESS_public)
   13349              
   13350                      .dwendtag $C$DW$T$29
   13351              
   13352              $C$DW$T$348     .dwtag  DW_TAG_typedef
   13353                      .dwattr $C$DW$T$348, DW_AT_name("ADC_Obj")
   13354                      .dwattr $C$DW$T$348, DW_AT_type(*$C$DW$T$29)
   13355                      .dwattr $C$DW$T$348, DW_AT_language(DW_LANG_C)
   13356              
   13357              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
   13358                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$29)
   13359                      .dwattr $C$DW$T$100, DW_AT_address_class(0x20)
   13360              
   13361              $C$DW$T$101     .dwtag  DW_TAG_typedef
   13362                      .dwattr $C$DW$T$101, DW_AT_name("ADC_Handle")
   13363                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
   13364                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
   13365              
   13366              
   13367              $C$DW$T$31      .dwtag  DW_TAG_structure_type
   13368                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
   13369                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
   13370              $C$DW$1779      .dwtag  DW_TAG_member
   13371                      .dwattr $C$DW$1779, DW_AT_type(*$C$DW$T$22)
   13372                      .dwattr $C$DW$1779, DW_AT_name("XCLK")
   13373                      .dwattr $C$DW$1779, DW_AT_TI_symbol_name("_XCLK")
   13374                      .dwattr $C$DW$1779, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13375                      .dwattr $C$DW$1779, DW_AT_accessibility(DW_ACCESS_public)
   13376              
   13377              $C$DW$1780      .dwtag  DW_TAG_member
   13378                      .dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  253

   13379                      .dwattr $C$DW$1780, DW_AT_name("rsvd_1")
   13380                      .dwattr $C$DW$1780, DW_AT_TI_symbol_name("_rsvd_1")
   13381                      .dwattr $C$DW$1780, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13382                      .dwattr $C$DW$1780, DW_AT_accessibility(DW_ACCESS_public)
   13383              
   13384              $C$DW$1781      .dwtag  DW_TAG_member
   13385                      .dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$22)
   13386                      .dwattr $C$DW$1781, DW_AT_name("CLKCTL")
   13387                      .dwattr $C$DW$1781, DW_AT_TI_symbol_name("_CLKCTL")
   13388                      .dwattr $C$DW$1781, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13389                      .dwattr $C$DW$1781, DW_AT_accessibility(DW_ACCESS_public)
   13390              
   13391              $C$DW$1782      .dwtag  DW_TAG_member
   13392                      .dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$30)
   13393                      .dwattr $C$DW$1782, DW_AT_name("rsvd_2")
   13394                      .dwattr $C$DW$1782, DW_AT_TI_symbol_name("_rsvd_2")
   13395                      .dwattr $C$DW$1782, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13396                      .dwattr $C$DW$1782, DW_AT_accessibility(DW_ACCESS_public)
   13397              
   13398              $C$DW$1783      .dwtag  DW_TAG_member
   13399                      .dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$22)
   13400                      .dwattr $C$DW$1783, DW_AT_name("LOSPCP")
   13401                      .dwattr $C$DW$1783, DW_AT_TI_symbol_name("_LOSPCP")
   13402                      .dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13403                      .dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
   13404              
   13405              $C$DW$1784      .dwtag  DW_TAG_member
   13406                      .dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$22)
   13407                      .dwattr $C$DW$1784, DW_AT_name("PCLKCR0")
   13408                      .dwattr $C$DW$1784, DW_AT_TI_symbol_name("_PCLKCR0")
   13409                      .dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13410                      .dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
   13411              
   13412              $C$DW$1785      .dwtag  DW_TAG_member
   13413                      .dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$22)
   13414                      .dwattr $C$DW$1785, DW_AT_name("PCLKCR1")
   13415                      .dwattr $C$DW$1785, DW_AT_TI_symbol_name("_PCLKCR1")
   13416                      .dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13417                      .dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
   13418              
   13419              $C$DW$1786      .dwtag  DW_TAG_member
   13420                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$25)
   13421                      .dwattr $C$DW$1786, DW_AT_name("rsvd_3")
   13422                      .dwattr $C$DW$1786, DW_AT_TI_symbol_name("_rsvd_3")
   13423                      .dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13424                      .dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
   13425              
   13426              $C$DW$1787      .dwtag  DW_TAG_member
   13427                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$22)
   13428                      .dwattr $C$DW$1787, DW_AT_name("PCLKCR3")
   13429                      .dwattr $C$DW$1787, DW_AT_TI_symbol_name("_PCLKCR3")
   13430                      .dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13431                      .dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
   13432              
   13433                      .dwendtag $C$DW$T$31
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  254

   13434              
   13435              $C$DW$T$102     .dwtag  DW_TAG_pointer_type
   13436                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$31)
   13437                      .dwattr $C$DW$T$102, DW_AT_address_class(0x20)
   13438              
   13439              $C$DW$T$103     .dwtag  DW_TAG_typedef
   13440                      .dwattr $C$DW$T$103, DW_AT_name("CLK_Handle")
   13441                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
   13442                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
   13443              
   13444              
   13445              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   13446                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
   13447                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
   13448              $C$DW$1788      .dwtag  DW_TAG_member
   13449                      .dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$32)
   13450                      .dwattr $C$DW$1788, DW_AT_name("tmp")
   13451                      .dwattr $C$DW$1788, DW_AT_TI_symbol_name("_tmp")
   13452                      .dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13453                      .dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
   13454              
   13455                      .dwendtag $C$DW$T$33
   13456              
   13457              $C$DW$T$357     .dwtag  DW_TAG_typedef
   13458                      .dwattr $C$DW$T$357, DW_AT_name("CPU_Obj")
   13459                      .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$33)
   13460                      .dwattr $C$DW$T$357, DW_AT_language(DW_LANG_C)
   13461              
   13462              $C$DW$T$104     .dwtag  DW_TAG_pointer_type
   13463                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$33)
   13464                      .dwattr $C$DW$T$104, DW_AT_address_class(0x20)
   13465              
   13466              $C$DW$T$105     .dwtag  DW_TAG_typedef
   13467                      .dwattr $C$DW$T$105, DW_AT_name("CPU_Handle")
   13468                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
   13469                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
   13470              
   13471              
   13472              $C$DW$T$41      .dwtag  DW_TAG_structure_type
   13473                      .dwattr $C$DW$T$41, DW_AT_name("_DRV8353_Obj_")
   13474                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
   13475              $C$DW$1789      .dwtag  DW_TAG_member
   13476                      .dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$35)
   13477                      .dwattr $C$DW$1789, DW_AT_name("spiHandle")
   13478                      .dwattr $C$DW$1789, DW_AT_TI_symbol_name("_spiHandle")
   13479                      .dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13480                      .dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
   13481              
   13482              $C$DW$1790      .dwtag  DW_TAG_member
   13483                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$37)
   13484                      .dwattr $C$DW$1790, DW_AT_name("gpioHandle")
   13485                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_gpioHandle")
   13486                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13487                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
   13488              
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  255

   13489              $C$DW$1791      .dwtag  DW_TAG_member
   13490                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$39)
   13491                      .dwattr $C$DW$1791, DW_AT_name("gpioNumber")
   13492                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_gpioNumber")
   13493                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13494                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
   13495              
   13496              $C$DW$1792      .dwtag  DW_TAG_member
   13497                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$40)
   13498                      .dwattr $C$DW$1792, DW_AT_name("RxTimeOut")
   13499                      .dwattr $C$DW$1792, DW_AT_TI_symbol_name("_RxTimeOut")
   13500                      .dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13501                      .dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
   13502              
   13503              $C$DW$1793      .dwtag  DW_TAG_member
   13504                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$40)
   13505                      .dwattr $C$DW$1793, DW_AT_name("enableTimeOut")
   13506                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_enableTimeOut")
   13507                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13508                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
   13509              
   13510                      .dwendtag $C$DW$T$41
   13511              
   13512              $C$DW$T$133     .dwtag  DW_TAG_typedef
   13513                      .dwattr $C$DW$T$133, DW_AT_name("DRV8353_Obj")
   13514                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$41)
   13515                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
   13516              
   13517              $C$DW$T$131     .dwtag  DW_TAG_pointer_type
   13518                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$41)
   13519                      .dwattr $C$DW$T$131, DW_AT_address_class(0x20)
   13520              
   13521              $C$DW$T$132     .dwtag  DW_TAG_typedef
   13522                      .dwattr $C$DW$T$132, DW_AT_name("DRV8353_Handle")
   13523                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
   13524                      .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
   13525              
   13526              
   13527              $C$DW$T$44      .dwtag  DW_TAG_structure_type
   13528                      .dwattr $C$DW$T$44, DW_AT_name("_DRV_SPI_8353_Ctrl02_t_")
   13529                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x0a)
   13530              $C$DW$1794      .dwtag  DW_TAG_member
   13531                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$40)
   13532                      .dwattr $C$DW$1794, DW_AT_name("CLR_FLT")
   13533                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_CLR_FLT")
   13534                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13535                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
   13536              
   13537              $C$DW$1795      .dwtag  DW_TAG_member
   13538                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$40)
   13539                      .dwattr $C$DW$1795, DW_AT_name("BRAKE")
   13540                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_BRAKE")
   13541                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13542                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
   13543              
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  256

   13544              $C$DW$1796      .dwtag  DW_TAG_member
   13545                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$40)
   13546                      .dwattr $C$DW$1796, DW_AT_name("COAST")
   13547                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_COAST")
   13548                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13549                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
   13550              
   13551              $C$DW$1797      .dwtag  DW_TAG_member
   13552                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$40)
   13553                      .dwattr $C$DW$1797, DW_AT_name("PWM1_DIR")
   13554                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_PWM1_DIR")
   13555                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13556                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
   13557              
   13558              $C$DW$1798      .dwtag  DW_TAG_member
   13559                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$40)
   13560                      .dwattr $C$DW$1798, DW_AT_name("PWM1_COM")
   13561                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_PWM1_COM")
   13562                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13563                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
   13564              
   13565              $C$DW$1799      .dwtag  DW_TAG_member
   13566                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$43)
   13567                      .dwattr $C$DW$1799, DW_AT_name("PWM_MODE")
   13568                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_PWM_MODE")
   13569                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13570                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
   13571              
   13572              $C$DW$1800      .dwtag  DW_TAG_member
   13573                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$40)
   13574                      .dwattr $C$DW$1800, DW_AT_name("OTW_REP")
   13575                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_OTW_REP")
   13576                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13577                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
   13578              
   13579              $C$DW$1801      .dwtag  DW_TAG_member
   13580                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$40)
   13581                      .dwattr $C$DW$1801, DW_AT_name("DIS_GDF")
   13582                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_DIS_GDF")
   13583                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13584                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
   13585              
   13586              $C$DW$1802      .dwtag  DW_TAG_member
   13587                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$40)
   13588                      .dwattr $C$DW$1802, DW_AT_name("DIS_CPUV")
   13589                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_DIS_CPUV")
   13590                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13591                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
   13592              
   13593              $C$DW$1803      .dwtag  DW_TAG_member
   13594                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$40)
   13595                      .dwattr $C$DW$1803, DW_AT_name("OCP_ACT")
   13596                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_OCP_ACT")
   13597                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13598                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  257

   13599              
   13600                      .dwendtag $C$DW$T$44
   13601              
   13602              $C$DW$T$78      .dwtag  DW_TAG_typedef
   13603                      .dwattr $C$DW$T$78, DW_AT_name("DRV_SPI_8353_Ctrl02_t_")
   13604                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$44)
   13605                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
   13606              
   13607              
   13608              $C$DW$T$51      .dwtag  DW_TAG_structure_type
   13609                      .dwattr $C$DW$T$51, DW_AT_name("_DRV_SPI_8353_Ctrl03_t_")
   13610                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x03)
   13611              $C$DW$1804      .dwtag  DW_TAG_member
   13612                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$46)
   13613                      .dwattr $C$DW$1804, DW_AT_name("IDRIVEN_HS")
   13614                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_IDRIVEN_HS")
   13615                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13616                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
   13617              
   13618              $C$DW$1805      .dwtag  DW_TAG_member
   13619                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$48)
   13620                      .dwattr $C$DW$1805, DW_AT_name("IDRIVEP_HS")
   13621                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_IDRIVEP_HS")
   13622                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13623                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
   13624              
   13625              $C$DW$1806      .dwtag  DW_TAG_member
   13626                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$50)
   13627                      .dwattr $C$DW$1806, DW_AT_name("LOCK")
   13628                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_LOCK")
   13629                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13630                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
   13631              
   13632                      .dwendtag $C$DW$T$51
   13633              
   13634              $C$DW$T$79      .dwtag  DW_TAG_typedef
   13635                      .dwattr $C$DW$T$79, DW_AT_name("DRV_SPI_8353_Ctrl03_t_")
   13636                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$51)
   13637                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
   13638              
   13639              
   13640              $C$DW$T$58      .dwtag  DW_TAG_structure_type
   13641                      .dwattr $C$DW$T$58, DW_AT_name("_DRV_SPI_8353_Ctrl04_t_")
   13642                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x04)
   13643              $C$DW$1807      .dwtag  DW_TAG_member
   13644                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$53)
   13645                      .dwattr $C$DW$1807, DW_AT_name("IDRIVEN_LS")
   13646                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_IDRIVEN_LS")
   13647                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13648                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
   13649              
   13650              $C$DW$1808      .dwtag  DW_TAG_member
   13651                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$55)
   13652                      .dwattr $C$DW$1808, DW_AT_name("IDRIVEP_LS")
   13653                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_IDRIVEP_LS")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  258

   13654                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13655                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
   13656              
   13657              $C$DW$1809      .dwtag  DW_TAG_member
   13658                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$57)
   13659                      .dwattr $C$DW$1809, DW_AT_name("TDRIVE")
   13660                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_TDRIVE")
   13661                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13662                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
   13663              
   13664              $C$DW$1810      .dwtag  DW_TAG_member
   13665                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$40)
   13666                      .dwattr $C$DW$1810, DW_AT_name("CBC")
   13667                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_CBC")
   13668                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13669                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
   13670              
   13671                      .dwendtag $C$DW$T$58
   13672              
   13673              $C$DW$T$80      .dwtag  DW_TAG_typedef
   13674                      .dwattr $C$DW$T$80, DW_AT_name("DRV_SPI_8353_Ctrl04_t_")
   13675                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$58)
   13676                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   13677              
   13678              
   13679              $C$DW$T$67      .dwtag  DW_TAG_structure_type
   13680                      .dwattr $C$DW$T$67, DW_AT_name("_DRV_SPI_8353_Ctrl05_t_")
   13681                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x05)
   13682              $C$DW$1811      .dwtag  DW_TAG_member
   13683                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$60)
   13684                      .dwattr $C$DW$1811, DW_AT_name("VDS_LVL")
   13685                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_VDS_LVL")
   13686                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13687                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
   13688              
   13689              $C$DW$1812      .dwtag  DW_TAG_member
   13690                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$62)
   13691                      .dwattr $C$DW$1812, DW_AT_name("OCP_DEG")
   13692                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_OCP_DEG")
   13693                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13694                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
   13695              
   13696              $C$DW$1813      .dwtag  DW_TAG_member
   13697                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$64)
   13698                      .dwattr $C$DW$1813, DW_AT_name("OCP_MODE")
   13699                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_OCP_MODE")
   13700                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13701                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   13702              
   13703              $C$DW$1814      .dwtag  DW_TAG_member
   13704                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$66)
   13705                      .dwattr $C$DW$1814, DW_AT_name("DEAD_TIME")
   13706                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_DEAD_TIME")
   13707                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13708                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  259

   13709              
   13710              $C$DW$1815      .dwtag  DW_TAG_member
   13711                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$40)
   13712                      .dwattr $C$DW$1815, DW_AT_name("TRETRY")
   13713                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_TRETRY")
   13714                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13715                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   13716              
   13717                      .dwendtag $C$DW$T$67
   13718              
   13719              $C$DW$T$81      .dwtag  DW_TAG_typedef
   13720                      .dwattr $C$DW$T$81, DW_AT_name("DRV_SPI_8353_Ctrl05_t_")
   13721                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$67)
   13722                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
   13723              
   13724              
   13725              $C$DW$T$72      .dwtag  DW_TAG_structure_type
   13726                      .dwattr $C$DW$T$72, DW_AT_name("_DRV_SPI_8353_Ctrl06_t_")
   13727                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x09)
   13728              $C$DW$1816      .dwtag  DW_TAG_member
   13729                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$69)
   13730                      .dwattr $C$DW$1816, DW_AT_name("SEN_LVL")
   13731                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_SEN_LVL")
   13732                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13733                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   13734              
   13735              $C$DW$1817      .dwtag  DW_TAG_member
   13736                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$40)
   13737                      .dwattr $C$DW$1817, DW_AT_name("CSA_CAL_C")
   13738                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_CSA_CAL_C")
   13739                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13740                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   13741              
   13742              $C$DW$1818      .dwtag  DW_TAG_member
   13743                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$40)
   13744                      .dwattr $C$DW$1818, DW_AT_name("CSA_CAL_B")
   13745                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_CSA_CAL_B")
   13746                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13747                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   13748              
   13749              $C$DW$1819      .dwtag  DW_TAG_member
   13750                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$40)
   13751                      .dwattr $C$DW$1819, DW_AT_name("CSA_CAL_A")
   13752                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_CSA_CAL_A")
   13753                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13754                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   13755              
   13756              $C$DW$1820      .dwtag  DW_TAG_member
   13757                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$40)
   13758                      .dwattr $C$DW$1820, DW_AT_name("DIS_SEN")
   13759                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_DIS_SEN")
   13760                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13761                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   13762              
   13763              $C$DW$1821      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  260

   13764                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$71)
   13765                      .dwattr $C$DW$1821, DW_AT_name("CSA_GAIN")
   13766                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_CSA_GAIN")
   13767                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13768                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   13769              
   13770              $C$DW$1822      .dwtag  DW_TAG_member
   13771                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$40)
   13772                      .dwattr $C$DW$1822, DW_AT_name("LS_REF")
   13773                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_LS_REF")
   13774                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13775                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   13776              
   13777              $C$DW$1823      .dwtag  DW_TAG_member
   13778                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$40)
   13779                      .dwattr $C$DW$1823, DW_AT_name("VREF_DIV")
   13780                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_VREF_DIV")
   13781                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13782                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   13783              
   13784              $C$DW$1824      .dwtag  DW_TAG_member
   13785                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$40)
   13786                      .dwattr $C$DW$1824, DW_AT_name("CSA_FET")
   13787                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_CSA_FET")
   13788                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13789                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   13790              
   13791                      .dwendtag $C$DW$T$72
   13792              
   13793              $C$DW$T$82      .dwtag  DW_TAG_typedef
   13794                      .dwattr $C$DW$T$82, DW_AT_name("DRV_SPI_8353_Ctrl06_t_")
   13795                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$72)
   13796                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   13797              
   13798              
   13799              $C$DW$T$73      .dwtag  DW_TAG_structure_type
   13800                      .dwattr $C$DW$T$73, DW_AT_name("_DRV_SPI_8353_Ctrl07_t_")
   13801                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x0b)
   13802              $C$DW$1825      .dwtag  DW_TAG_member
   13803                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$40)
   13804                      .dwattr $C$DW$1825, DW_AT_name("CAL_MODE")
   13805                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_CAL_MODE")
   13806                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13807                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   13808              
   13809              $C$DW$1826      .dwtag  DW_TAG_member
   13810                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$40)
   13811                      .dwattr $C$DW$1826, DW_AT_name("RESERVED_1")
   13812                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_RESERVED_1")
   13813                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13814                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   13815              
   13816              $C$DW$1827      .dwtag  DW_TAG_member
   13817                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$40)
   13818                      .dwattr $C$DW$1827, DW_AT_name("RESERVED_2")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  261

   13819                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_RESERVED_2")
   13820                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13821                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   13822              
   13823              $C$DW$1828      .dwtag  DW_TAG_member
   13824                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$40)
   13825                      .dwattr $C$DW$1828, DW_AT_name("RESERVED_3")
   13826                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_RESERVED_3")
   13827                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13828                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   13829              
   13830              $C$DW$1829      .dwtag  DW_TAG_member
   13831                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$40)
   13832                      .dwattr $C$DW$1829, DW_AT_name("RESERVED_4")
   13833                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_RESERVED_4")
   13834                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13835                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   13836              
   13837              $C$DW$1830      .dwtag  DW_TAG_member
   13838                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$40)
   13839                      .dwattr $C$DW$1830, DW_AT_name("RESERVED_5")
   13840                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_RESERVED_5")
   13841                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13842                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   13843              
   13844              $C$DW$1831      .dwtag  DW_TAG_member
   13845                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$40)
   13846                      .dwattr $C$DW$1831, DW_AT_name("RESERVED_6")
   13847                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_RESERVED_6")
   13848                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13849                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   13850              
   13851              $C$DW$1832      .dwtag  DW_TAG_member
   13852                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$40)
   13853                      .dwattr $C$DW$1832, DW_AT_name("RESERVED_7")
   13854                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_RESERVED_7")
   13855                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13856                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   13857              
   13858              $C$DW$1833      .dwtag  DW_TAG_member
   13859                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$40)
   13860                      .dwattr $C$DW$1833, DW_AT_name("RESERVED_8")
   13861                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_RESERVED_8")
   13862                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13863                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   13864              
   13865              $C$DW$1834      .dwtag  DW_TAG_member
   13866                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$40)
   13867                      .dwattr $C$DW$1834, DW_AT_name("RESERVED_9")
   13868                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_RESERVED_9")
   13869                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13870                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   13871              
   13872              $C$DW$1835      .dwtag  DW_TAG_member
   13873                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  262

   13874                      .dwattr $C$DW$1835, DW_AT_name("RESERVED_10")
   13875                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_RESERVED_10")
   13876                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13877                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   13878              
   13879                      .dwendtag $C$DW$T$73
   13880              
   13881              $C$DW$T$83      .dwtag  DW_TAG_typedef
   13882                      .dwattr $C$DW$T$83, DW_AT_name("DRV_SPI_8353_Ctrl07_t_")
   13883                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$73)
   13884                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
   13885              
   13886              
   13887              $C$DW$T$74      .dwtag  DW_TAG_structure_type
   13888                      .dwattr $C$DW$T$74, DW_AT_name("_DRV_SPI_8353_Stat00_t_")
   13889                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0b)
   13890              $C$DW$1836      .dwtag  DW_TAG_member
   13891                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$40)
   13892                      .dwattr $C$DW$1836, DW_AT_name("VDS_LC")
   13893                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_VDS_LC")
   13894                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13895                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   13896              
   13897              $C$DW$1837      .dwtag  DW_TAG_member
   13898                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$40)
   13899                      .dwattr $C$DW$1837, DW_AT_name("VDS_HC")
   13900                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_VDS_HC")
   13901                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13902                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   13903              
   13904              $C$DW$1838      .dwtag  DW_TAG_member
   13905                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$40)
   13906                      .dwattr $C$DW$1838, DW_AT_name("VDS_LB")
   13907                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_VDS_LB")
   13908                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13909                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   13910              
   13911              $C$DW$1839      .dwtag  DW_TAG_member
   13912                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$40)
   13913                      .dwattr $C$DW$1839, DW_AT_name("VDS_HB")
   13914                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_VDS_HB")
   13915                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13916                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   13917              
   13918              $C$DW$1840      .dwtag  DW_TAG_member
   13919                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$40)
   13920                      .dwattr $C$DW$1840, DW_AT_name("VDS_LA")
   13921                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_VDS_LA")
   13922                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13923                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   13924              
   13925              $C$DW$1841      .dwtag  DW_TAG_member
   13926                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$40)
   13927                      .dwattr $C$DW$1841, DW_AT_name("VDS_HA")
   13928                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_VDS_HA")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  263

   13929                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13930                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   13931              
   13932              $C$DW$1842      .dwtag  DW_TAG_member
   13933                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$40)
   13934                      .dwattr $C$DW$1842, DW_AT_name("OTSD")
   13935                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_OTSD")
   13936                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13937                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   13938              
   13939              $C$DW$1843      .dwtag  DW_TAG_member
   13940                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$40)
   13941                      .dwattr $C$DW$1843, DW_AT_name("UVLO")
   13942                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_UVLO")
   13943                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13944                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   13945              
   13946              $C$DW$1844      .dwtag  DW_TAG_member
   13947                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$40)
   13948                      .dwattr $C$DW$1844, DW_AT_name("GDF")
   13949                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_GDF")
   13950                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13951                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   13952              
   13953              $C$DW$1845      .dwtag  DW_TAG_member
   13954                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$40)
   13955                      .dwattr $C$DW$1845, DW_AT_name("VDS_OCP")
   13956                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_VDS_OCP")
   13957                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13958                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   13959              
   13960              $C$DW$1846      .dwtag  DW_TAG_member
   13961                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$40)
   13962                      .dwattr $C$DW$1846, DW_AT_name("FAULT")
   13963                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_FAULT")
   13964                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13965                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   13966              
   13967                      .dwendtag $C$DW$T$74
   13968              
   13969              $C$DW$T$76      .dwtag  DW_TAG_typedef
   13970                      .dwattr $C$DW$T$76, DW_AT_name("DRV_SPI_8353_Stat00_t_")
   13971                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$74)
   13972                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
   13973              
   13974              
   13975              $C$DW$T$75      .dwtag  DW_TAG_structure_type
   13976                      .dwattr $C$DW$T$75, DW_AT_name("_DRV_SPI_8353_Stat01_t_")
   13977                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x0b)
   13978              $C$DW$1847      .dwtag  DW_TAG_member
   13979                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$40)
   13980                      .dwattr $C$DW$1847, DW_AT_name("VGS_LC")
   13981                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_VGS_LC")
   13982                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13983                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  264

   13984              
   13985              $C$DW$1848      .dwtag  DW_TAG_member
   13986                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$40)
   13987                      .dwattr $C$DW$1848, DW_AT_name("VGS_HC")
   13988                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_VGS_HC")
   13989                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13990                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   13991              
   13992              $C$DW$1849      .dwtag  DW_TAG_member
   13993                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$40)
   13994                      .dwattr $C$DW$1849, DW_AT_name("VGS_LB")
   13995                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_VGS_LB")
   13996                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13997                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   13998              
   13999              $C$DW$1850      .dwtag  DW_TAG_member
   14000                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$40)
   14001                      .dwattr $C$DW$1850, DW_AT_name("VGS_HB")
   14002                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_VGS_HB")
   14003                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14004                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   14005              
   14006              $C$DW$1851      .dwtag  DW_TAG_member
   14007                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$40)
   14008                      .dwattr $C$DW$1851, DW_AT_name("VGS_LA")
   14009                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_VGS_LA")
   14010                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14011                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   14012              
   14013              $C$DW$1852      .dwtag  DW_TAG_member
   14014                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$40)
   14015                      .dwattr $C$DW$1852, DW_AT_name("VGS_HA")
   14016                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_VGS_HA")
   14017                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14018                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   14019              
   14020              $C$DW$1853      .dwtag  DW_TAG_member
   14021                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$40)
   14022                      .dwattr $C$DW$1853, DW_AT_name("GDUV")
   14023                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_GDUV")
   14024                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14025                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   14026              
   14027              $C$DW$1854      .dwtag  DW_TAG_member
   14028                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$40)
   14029                      .dwattr $C$DW$1854, DW_AT_name("OTW")
   14030                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_OTW")
   14031                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14032                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   14033              
   14034              $C$DW$1855      .dwtag  DW_TAG_member
   14035                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$40)
   14036                      .dwattr $C$DW$1855, DW_AT_name("SC_OC")
   14037                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_SC_OC")
   14038                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  265

   14039                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   14040              
   14041              $C$DW$1856      .dwtag  DW_TAG_member
   14042                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$40)
   14043                      .dwattr $C$DW$1856, DW_AT_name("SB_OC")
   14044                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_SB_OC")
   14045                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   14046                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   14047              
   14048              $C$DW$1857      .dwtag  DW_TAG_member
   14049                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$40)
   14050                      .dwattr $C$DW$1857, DW_AT_name("SA_OC")
   14051                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_SA_OC")
   14052                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14053                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   14054              
   14055                      .dwendtag $C$DW$T$75
   14056              
   14057              $C$DW$T$77      .dwtag  DW_TAG_typedef
   14058                      .dwattr $C$DW$T$77, DW_AT_name("DRV_SPI_8353_Stat01_t_")
   14059                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$75)
   14060                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
   14061              
   14062              
   14063              $C$DW$T$84      .dwtag  DW_TAG_structure_type
   14064                      .dwattr $C$DW$T$84, DW_AT_name("_DRV_SPI_8353_Vars_t_")
   14065                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x48)
   14066              $C$DW$1858      .dwtag  DW_TAG_member
   14067                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$76)
   14068                      .dwattr $C$DW$1858, DW_AT_name("Stat_Reg_00")
   14069                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_Stat_Reg_00")
   14070                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14071                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   14072              
   14073              $C$DW$1859      .dwtag  DW_TAG_member
   14074                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$77)
   14075                      .dwattr $C$DW$1859, DW_AT_name("Stat_Reg_01")
   14076                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_Stat_Reg_01")
   14077                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   14078                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   14079              
   14080              $C$DW$1860      .dwtag  DW_TAG_member
   14081                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$78)
   14082                      .dwattr $C$DW$1860, DW_AT_name("Ctrl_Reg_02")
   14083                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_Ctrl_Reg_02")
   14084                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   14085                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   14086              
   14087              $C$DW$1861      .dwtag  DW_TAG_member
   14088                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$79)
   14089                      .dwattr $C$DW$1861, DW_AT_name("Ctrl_Reg_03")
   14090                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_Ctrl_Reg_03")
   14091                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   14092                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   14093              
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  266

   14094              $C$DW$1862      .dwtag  DW_TAG_member
   14095                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$80)
   14096                      .dwattr $C$DW$1862, DW_AT_name("Ctrl_Reg_04")
   14097                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_Ctrl_Reg_04")
   14098                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
   14099                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   14100              
   14101              $C$DW$1863      .dwtag  DW_TAG_member
   14102                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$81)
   14103                      .dwattr $C$DW$1863, DW_AT_name("Ctrl_Reg_05")
   14104                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_Ctrl_Reg_05")
   14105                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   14106                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   14107              
   14108              $C$DW$1864      .dwtag  DW_TAG_member
   14109                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$82)
   14110                      .dwattr $C$DW$1864, DW_AT_name("Ctrl_Reg_06")
   14111                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_Ctrl_Reg_06")
   14112                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   14113                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   14114              
   14115              $C$DW$1865      .dwtag  DW_TAG_member
   14116                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$83)
   14117                      .dwattr $C$DW$1865, DW_AT_name("Ctrl_Reg_07")
   14118                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_Ctrl_Reg_07")
   14119                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
   14120                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   14121              
   14122              $C$DW$1866      .dwtag  DW_TAG_member
   14123                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$40)
   14124                      .dwattr $C$DW$1866, DW_AT_name("WriteCmd")
   14125                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_WriteCmd")
   14126                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   14127                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   14128              
   14129              $C$DW$1867      .dwtag  DW_TAG_member
   14130                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$40)
   14131                      .dwattr $C$DW$1867, DW_AT_name("ReadCmd")
   14132                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_ReadCmd")
   14133                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
   14134                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   14135              
   14136              $C$DW$1868      .dwtag  DW_TAG_member
   14137                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$21)
   14138                      .dwattr $C$DW$1868, DW_AT_name("ManWriteAddr")
   14139                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_ManWriteAddr")
   14140                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   14141                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   14142              
   14143              $C$DW$1869      .dwtag  DW_TAG_member
   14144                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$21)
   14145                      .dwattr $C$DW$1869, DW_AT_name("ManReadAddr")
   14146                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_ManReadAddr")
   14147                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
   14148                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  267

   14149              
   14150              $C$DW$1870      .dwtag  DW_TAG_member
   14151                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$21)
   14152                      .dwattr $C$DW$1870, DW_AT_name("ManWriteData")
   14153                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_ManWriteData")
   14154                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   14155                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   14156              
   14157              $C$DW$1871      .dwtag  DW_TAG_member
   14158                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$21)
   14159                      .dwattr $C$DW$1871, DW_AT_name("ManReadData")
   14160                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_ManReadData")
   14161                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
   14162                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   14163              
   14164              $C$DW$1872      .dwtag  DW_TAG_member
   14165                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$40)
   14166                      .dwattr $C$DW$1872, DW_AT_name("ManWriteCmd")
   14167                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_ManWriteCmd")
   14168                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   14169                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   14170              
   14171              $C$DW$1873      .dwtag  DW_TAG_member
   14172                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$40)
   14173                      .dwattr $C$DW$1873, DW_AT_name("ManReadCmd")
   14174                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_ManReadCmd")
   14175                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
   14176                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   14177              
   14178                      .dwendtag $C$DW$T$84
   14179              
   14180              $C$DW$T$364     .dwtag  DW_TAG_typedef
   14181                      .dwattr $C$DW$T$364, DW_AT_name("DRV_SPI_8353_Vars_t")
   14182                      .dwattr $C$DW$T$364, DW_AT_type(*$C$DW$T$84)
   14183                      .dwattr $C$DW$T$364, DW_AT_language(DW_LANG_C)
   14184              
   14185              $C$DW$T$365     .dwtag  DW_TAG_pointer_type
   14186                      .dwattr $C$DW$T$365, DW_AT_type(*$C$DW$T$364)
   14187                      .dwattr $C$DW$T$365, DW_AT_address_class(0x20)
   14188              
   14189              
   14190              $C$DW$T$86      .dwtag  DW_TAG_structure_type
   14191                      .dwattr $C$DW$T$86, DW_AT_name("_FILTER_FO_")
   14192                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x0a)
   14193              $C$DW$1874      .dwtag  DW_TAG_member
   14194                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$85)
   14195                      .dwattr $C$DW$1874, DW_AT_name("a1")
   14196                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_a1")
   14197                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14198                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   14199              
   14200              $C$DW$1875      .dwtag  DW_TAG_member
   14201                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$85)
   14202                      .dwattr $C$DW$1875, DW_AT_name("b0")
   14203                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_b0")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  268

   14204                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14205                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   14206              
   14207              $C$DW$1876      .dwtag  DW_TAG_member
   14208                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$85)
   14209                      .dwattr $C$DW$1876, DW_AT_name("b1")
   14210                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_b1")
   14211                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14212                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   14213              
   14214              $C$DW$1877      .dwtag  DW_TAG_member
   14215                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$85)
   14216                      .dwattr $C$DW$1877, DW_AT_name("x1")
   14217                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_x1")
   14218                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14219                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   14220              
   14221              $C$DW$1878      .dwtag  DW_TAG_member
   14222                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$85)
   14223                      .dwattr $C$DW$1878, DW_AT_name("y1")
   14224                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_y1")
   14225                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14226                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   14227              
   14228                      .dwendtag $C$DW$T$86
   14229              
   14230              $C$DW$T$137     .dwtag  DW_TAG_typedef
   14231                      .dwattr $C$DW$T$137, DW_AT_name("FILTER_FO_Obj")
   14232                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$86)
   14233                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
   14234              
   14235              
   14236              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   14237                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   14238                      .dwattr $C$DW$T$19, DW_AT_declaration
   14239                      .dwendtag $C$DW$T$19
   14240              
   14241              $C$DW$T$138     .dwtag  DW_TAG_pointer_type
   14242                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$19)
   14243                      .dwattr $C$DW$T$138, DW_AT_address_class(0x20)
   14244              
   14245              $C$DW$T$139     .dwtag  DW_TAG_typedef
   14246                      .dwattr $C$DW$T$139, DW_AT_name("FILTER_FO_Handle")
   14247                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
   14248                      .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
   14249              
   14250              
   14251              $C$DW$T$87      .dwtag  DW_TAG_structure_type
   14252                      .dwattr $C$DW$T$87, DW_AT_name("_FLASH_Obj_")
   14253                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
   14254              $C$DW$1879      .dwtag  DW_TAG_member
   14255                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$22)
   14256                      .dwattr $C$DW$1879, DW_AT_name("FOPT")
   14257                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_FOPT")
   14258                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  269

   14259                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   14260              
   14261              $C$DW$1880      .dwtag  DW_TAG_member
   14262                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$22)
   14263                      .dwattr $C$DW$1880, DW_AT_name("rsvd_1")
   14264                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_rsvd_1")
   14265                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14266                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   14267              
   14268              $C$DW$1881      .dwtag  DW_TAG_member
   14269                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$22)
   14270                      .dwattr $C$DW$1881, DW_AT_name("FPWR")
   14271                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_FPWR")
   14272                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14273                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   14274              
   14275              $C$DW$1882      .dwtag  DW_TAG_member
   14276                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$22)
   14277                      .dwattr $C$DW$1882, DW_AT_name("FSTATUS")
   14278                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_FSTATUS")
   14279                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14280                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   14281              
   14282              $C$DW$1883      .dwtag  DW_TAG_member
   14283                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$22)
   14284                      .dwattr $C$DW$1883, DW_AT_name("FSTDBYWAIT")
   14285                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   14286                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14287                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   14288              
   14289              $C$DW$1884      .dwtag  DW_TAG_member
   14290                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$22)
   14291                      .dwattr $C$DW$1884, DW_AT_name("FACTIVEWAIT")
   14292                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   14293                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14294                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   14295              
   14296              $C$DW$1885      .dwtag  DW_TAG_member
   14297                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$22)
   14298                      .dwattr $C$DW$1885, DW_AT_name("FBANKWAIT")
   14299                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_FBANKWAIT")
   14300                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14301                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   14302              
   14303              $C$DW$1886      .dwtag  DW_TAG_member
   14304                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$22)
   14305                      .dwattr $C$DW$1886, DW_AT_name("FOTPWAIT")
   14306                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_FOTPWAIT")
   14307                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14308                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   14309              
   14310                      .dwendtag $C$DW$T$87
   14311              
   14312              $C$DW$T$106     .dwtag  DW_TAG_pointer_type
   14313                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$87)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  270

   14314                      .dwattr $C$DW$T$106, DW_AT_address_class(0x20)
   14315              
   14316              $C$DW$T$107     .dwtag  DW_TAG_typedef
   14317                      .dwattr $C$DW$T$107, DW_AT_name("FLASH_Handle")
   14318                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
   14319                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
   14320              
   14321              
   14322              $C$DW$T$92      .dwtag  DW_TAG_structure_type
   14323                      .dwattr $C$DW$T$92, DW_AT_name("_GPIO_Obj_")
   14324                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x6a)
   14325              $C$DW$1887      .dwtag  DW_TAG_member
   14326                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$89)
   14327                      .dwattr $C$DW$1887, DW_AT_name("GPACTRL")
   14328                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_GPACTRL")
   14329                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14330                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   14331              
   14332              $C$DW$1888      .dwtag  DW_TAG_member
   14333                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$89)
   14334                      .dwattr $C$DW$1888, DW_AT_name("GPAQSEL1")
   14335                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_GPAQSEL1")
   14336                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14337                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   14338              
   14339              $C$DW$1889      .dwtag  DW_TAG_member
   14340                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$89)
   14341                      .dwattr $C$DW$1889, DW_AT_name("GPAQSEL2")
   14342                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_GPAQSEL2")
   14343                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14344                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   14345              
   14346              $C$DW$1890      .dwtag  DW_TAG_member
   14347                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$89)
   14348                      .dwattr $C$DW$1890, DW_AT_name("GPAMUX1")
   14349                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_GPAMUX1")
   14350                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14351                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   14352              
   14353              $C$DW$1891      .dwtag  DW_TAG_member
   14354                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$89)
   14355                      .dwattr $C$DW$1891, DW_AT_name("GPAMUX2")
   14356                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_GPAMUX2")
   14357                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14358                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   14359              
   14360              $C$DW$1892      .dwtag  DW_TAG_member
   14361                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$89)
   14362                      .dwattr $C$DW$1892, DW_AT_name("GPADIR")
   14363                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_GPADIR")
   14364                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14365                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   14366              
   14367              $C$DW$1893      .dwtag  DW_TAG_member
   14368                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$89)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:24 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1392810                         PAGE  271

   14369                      .dwattr $C$DW$1893, DW_AT_name("GPAPUD")
   14370                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_GPAPUD")
   14371                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14372                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   14373              
   14374              $C$DW$1894      .dwtag  DW_TAG_member
   14375                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$25)
   14376                      .dwattr $C$DW$1894, DW_AT_name("rsvd_1")
   14377                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_rsvd_1")
   14378                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14379                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   14380              
   14381              $C$DW$1895      .dwtag  DW_TAG_member
   14382                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$89)
   14383                      .dwattr $C$DW$1895, DW_AT_name("GPBCTRL")
   14384                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_GPBCTRL")
   14385                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14386                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   14387              
   14388              $C$DW$1896      .dwtag  DW_TAG_member
   14389                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$89)
   14390                      .dwattr $C$DW$1896, DW_AT_name("GPBQSEL1")
   14391                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_GPBQSEL1")
   14392                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14393                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   14394              
   14395              $C$DW$1897      .dwtag  DW_TAG_member
