TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Wed Jul 04 10:32:31 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware_drv8353/motorware_1_01_00_18/sw/solutions/instaspin_foc
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware_drv8353\motorware_1_01_00_18\sw\solutions\instaspin
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    4399                      .dwattr $C$DW$550, DW_AT_name("PIE_GroupNumber_3")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE   86

    4400                      .dwattr $C$DW$550, DW_AT_const_value(0x02)
    4401              
    4402              $C$DW$551       .dwtag  DW_TAG_enumerator
    4403                      .dwattr $C$DW$551, DW_AT_name("PIE_GroupNumber_4")
    4404                      .dwattr $C$DW$551, DW_AT_const_value(0x03)
    4405              
    4406              $C$DW$552       .dwtag  DW_TAG_enumerator
    4407                      .dwattr $C$DW$552, DW_AT_name("PIE_GroupNumber_5")
    4408                      .dwattr $C$DW$552, DW_AT_const_value(0x04)
    4409              
    4410              $C$DW$553       .dwtag  DW_TAG_enumerator
    4411                      .dwattr $C$DW$553, DW_AT_name("PIE_GroupNumber_6")
    4412                      .dwattr $C$DW$553, DW_AT_const_value(0x05)
    4413              
    4414              $C$DW$554       .dwtag  DW_TAG_enumerator
    4415                      .dwattr $C$DW$554, DW_AT_name("PIE_GroupNumber_7")
    4416                      .dwattr $C$DW$554, DW_AT_const_value(0x06)
    4417              
    4418              $C$DW$555       .dwtag  DW_TAG_enumerator
    4419                      .dwattr $C$DW$555, DW_AT_name("PIE_GroupNumber_8")
    4420                      .dwattr $C$DW$555, DW_AT_const_value(0x07)
    4421              
    4422              $C$DW$556       .dwtag  DW_TAG_enumerator
    4423                      .dwattr $C$DW$556, DW_AT_name("PIE_GroupNumber_9")
    4424                      .dwattr $C$DW$556, DW_AT_const_value(0x08)
    4425              
    4426              $C$DW$557       .dwtag  DW_TAG_enumerator
    4427                      .dwattr $C$DW$557, DW_AT_name("PIE_GroupNumber_10")
    4428                      .dwattr $C$DW$557, DW_AT_const_value(0x09)
    4429              
    4430              $C$DW$558       .dwtag  DW_TAG_enumerator
    4431                      .dwattr $C$DW$558, DW_AT_name("PIE_GroupNumber_11")
    4432                      .dwattr $C$DW$558, DW_AT_const_value(0x0a)
    4433              
    4434              $C$DW$559       .dwtag  DW_TAG_enumerator
    4435                      .dwattr $C$DW$559, DW_AT_name("PIE_GroupNumber_12")
    4436                      .dwattr $C$DW$559, DW_AT_const_value(0x0b)
    4437              
    4438                      .dwendtag $C$DW$T$230
    4439              
    4440              $C$DW$T$231     .dwtag  DW_TAG_typedef
    4441                      .dwattr $C$DW$T$231, DW_AT_name("PIE_GroupNumber_e")
    4442                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    4443                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    4444              
    4445              
    4446              $C$DW$T$233     .dwtag  DW_TAG_enumeration_type
    4447                      .dwattr $C$DW$T$233, DW_AT_byte_size(0x01)
    4448              $C$DW$560       .dwtag  DW_TAG_enumerator
    4449                      .dwattr $C$DW$560, DW_AT_name("CTRL_Type_PID_spd")
    4450                      .dwattr $C$DW$560, DW_AT_const_value(0x00)
    4451              
    4452              $C$DW$561       .dwtag  DW_TAG_enumerator
    4453                      .dwattr $C$DW$561, DW_AT_name("CTRL_Type_PID_Id")
    4454                      .dwattr $C$DW$561, DW_AT_const_value(0x01)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE   87

    4455              
    4456              $C$DW$562       .dwtag  DW_TAG_enumerator
    4457                      .dwattr $C$DW$562, DW_AT_name("CTRL_Type_PID_Iq")
    4458                      .dwattr $C$DW$562, DW_AT_const_value(0x02)
    4459              
    4460                      .dwendtag $C$DW$T$233
    4461              
    4462              $C$DW$T$234     .dwtag  DW_TAG_typedef
    4463                      .dwattr $C$DW$T$234, DW_AT_name("CTRL_Type_e")
    4464                      .dwattr $C$DW$T$234, DW_AT_type(*$C$DW$T$233)
    4465                      .dwattr $C$DW$T$234, DW_AT_language(DW_LANG_C)
    4466              
    4467              
    4468              $C$DW$T$236     .dwtag  DW_TAG_enumeration_type
    4469                      .dwattr $C$DW$T$236, DW_AT_byte_size(0x01)
    4470              $C$DW$563       .dwtag  DW_TAG_enumerator
    4471                      .dwattr $C$DW$563, DW_AT_name("HAL_SensorType_Current")
    4472                      .dwattr $C$DW$563, DW_AT_const_value(0x00)
    4473              
    4474              $C$DW$564       .dwtag  DW_TAG_enumerator
    4475                      .dwattr $C$DW$564, DW_AT_name("HAL_SensorType_Voltage")
    4476                      .dwattr $C$DW$564, DW_AT_const_value(0x01)
    4477              
    4478                      .dwendtag $C$DW$T$236
    4479              
    4480              $C$DW$T$237     .dwtag  DW_TAG_typedef
    4481                      .dwattr $C$DW$T$237, DW_AT_name("HAL_SensorType_e")
    4482                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    4483                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    4484              
    4485              
    4486              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4487                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    4488                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    4489              $C$DW$565       .dwtag  DW_TAG_member
    4490                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$24)
    4491                      .dwattr $C$DW$565, DW_AT_name("ADCRESULT")
    4492                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_ADCRESULT")
    4493                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4494                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    4495              
    4496              $C$DW$566       .dwtag  DW_TAG_member
    4497                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$25)
    4498                      .dwattr $C$DW$566, DW_AT_name("resvd_1")
    4499                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_resvd_1")
    4500                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4501                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    4502              
    4503              $C$DW$567       .dwtag  DW_TAG_member
    4504                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$23)
    4505                      .dwattr $C$DW$567, DW_AT_name("ADCCTL1")
    4506                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_ADCCTL1")
    4507                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4508                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    4509              
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE   88

    4510              $C$DW$568       .dwtag  DW_TAG_member
    4511                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$23)
    4512                      .dwattr $C$DW$568, DW_AT_name("ADCCTL2")
    4513                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_ADCCTL2")
    4514                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4515                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    4516              
    4517              $C$DW$569       .dwtag  DW_TAG_member
    4518                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$26)
    4519                      .dwattr $C$DW$569, DW_AT_name("rsvd_2")
    4520                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_rsvd_2")
    4521                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4522                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    4523              
    4524              $C$DW$570       .dwtag  DW_TAG_member
    4525                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$23)
    4526                      .dwattr $C$DW$570, DW_AT_name("ADCINTFLG")
    4527                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_ADCINTFLG")
    4528                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4529                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    4530              
    4531              $C$DW$571       .dwtag  DW_TAG_member
    4532                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$23)
    4533                      .dwattr $C$DW$571, DW_AT_name("ADCINTFLGCLR")
    4534                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4535                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4536                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    4537              
    4538              $C$DW$572       .dwtag  DW_TAG_member
    4539                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$23)
    4540                      .dwattr $C$DW$572, DW_AT_name("ADCINTOVF")
    4541                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_ADCINTOVF")
    4542                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4543                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    4544              
    4545              $C$DW$573       .dwtag  DW_TAG_member
    4546                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$23)
    4547                      .dwattr $C$DW$573, DW_AT_name("ADCINTOVFCLR")
    4548                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4549                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4550                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    4551              
    4552              $C$DW$574       .dwtag  DW_TAG_member
    4553                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$27)
    4554                      .dwattr $C$DW$574, DW_AT_name("INTSELxNy")
    4555                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_INTSELxNy")
    4556                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4557                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    4558              
    4559              $C$DW$575       .dwtag  DW_TAG_member
    4560                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$28)
    4561                      .dwattr $C$DW$575, DW_AT_name("rsvd_3")
    4562                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_rsvd_3")
    4563                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4564                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE   89

    4565              
    4566              $C$DW$576       .dwtag  DW_TAG_member
    4567                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$23)
    4568                      .dwattr $C$DW$576, DW_AT_name("SOCPRICTRL")
    4569                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4570                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4571                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    4572              
    4573              $C$DW$577       .dwtag  DW_TAG_member
    4574                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$23)
    4575                      .dwattr $C$DW$577, DW_AT_name("rsvd_4")
    4576                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_rsvd_4")
    4577                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4578                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    4579              
    4580              $C$DW$578       .dwtag  DW_TAG_member
    4581                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$23)
    4582                      .dwattr $C$DW$578, DW_AT_name("ADCSAMPLEMODE")
    4583                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4584                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4585                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    4586              
    4587              $C$DW$579       .dwtag  DW_TAG_member
    4588                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$23)
    4589                      .dwattr $C$DW$579, DW_AT_name("rsvd_5")
    4590                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_rsvd_5")
    4591                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4592                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    4593              
    4594              $C$DW$580       .dwtag  DW_TAG_member
    4595                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$23)
    4596                      .dwattr $C$DW$580, DW_AT_name("ADCINTSOCSEL1")
    4597                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4598                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4599                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    4600              
    4601              $C$DW$581       .dwtag  DW_TAG_member
    4602                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$23)
    4603                      .dwattr $C$DW$581, DW_AT_name("ADCINTSOCSEL2")
    4604                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4605                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4606                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    4607              
    4608              $C$DW$582       .dwtag  DW_TAG_member
    4609                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$26)
    4610                      .dwattr $C$DW$582, DW_AT_name("rsvd_6")
    4611                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_rsvd_6")
    4612                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4613                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    4614              
    4615              $C$DW$583       .dwtag  DW_TAG_member
    4616                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$23)
    4617                      .dwattr $C$DW$583, DW_AT_name("ADCSOCFLG1")
    4618                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4619                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE   90

    4620                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    4621              
    4622              $C$DW$584       .dwtag  DW_TAG_member
    4623                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$23)
    4624                      .dwattr $C$DW$584, DW_AT_name("rsvd_7")
    4625                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_rsvd_7")
    4626                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4627                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    4628              
    4629              $C$DW$585       .dwtag  DW_TAG_member
    4630                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$23)
    4631                      .dwattr $C$DW$585, DW_AT_name("ADCSOCFRC1")
    4632                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4633                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4634                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    4635              
    4636              $C$DW$586       .dwtag  DW_TAG_member
    4637                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$23)
    4638                      .dwattr $C$DW$586, DW_AT_name("rsvd_8")
    4639                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_rsvd_8")
    4640                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4641                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    4642              
    4643              $C$DW$587       .dwtag  DW_TAG_member
    4644                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$23)
    4645                      .dwattr $C$DW$587, DW_AT_name("ADCSOCOVF1")
    4646                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4647                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4648                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    4649              
    4650              $C$DW$588       .dwtag  DW_TAG_member
    4651                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$23)
    4652                      .dwattr $C$DW$588, DW_AT_name("rsvd_9")
    4653                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_rsvd_9")
    4654                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4655                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    4656              
    4657              $C$DW$589       .dwtag  DW_TAG_member
    4658                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$23)
    4659                      .dwattr $C$DW$589, DW_AT_name("ADCSOCOVFCLR1")
    4660                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4661                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4662                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    4663              
    4664              $C$DW$590       .dwtag  DW_TAG_member
    4665                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$23)
    4666                      .dwattr $C$DW$590, DW_AT_name("rsvd_10")
    4667                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_rsvd_10")
    4668                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4669                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    4670              
    4671              $C$DW$591       .dwtag  DW_TAG_member
    4672                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$24)
    4673                      .dwattr $C$DW$591, DW_AT_name("ADCSOCxCTL")
    4674                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_ADCSOCxCTL")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE   91

    4675                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4676                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    4677              
    4678              $C$DW$592       .dwtag  DW_TAG_member
    4679                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$24)
    4680                      .dwattr $C$DW$592, DW_AT_name("rsvd_11")
    4681                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_rsvd_11")
    4682                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4683                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    4684              
    4685              $C$DW$593       .dwtag  DW_TAG_member
    4686                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$23)
    4687                      .dwattr $C$DW$593, DW_AT_name("ADCREFTRIM")
    4688                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4689                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4690                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    4691              
    4692              $C$DW$594       .dwtag  DW_TAG_member
    4693                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$23)
    4694                      .dwattr $C$DW$594, DW_AT_name("ADCOFFTRIM")
    4695                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4696                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4697                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    4698              
    4699              $C$DW$595       .dwtag  DW_TAG_member
    4700                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$29)
    4701                      .dwattr $C$DW$595, DW_AT_name("resvd_12")
    4702                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_resvd_12")
    4703                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4704                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    4705              
    4706              $C$DW$596       .dwtag  DW_TAG_member
    4707                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$23)
    4708                      .dwattr $C$DW$596, DW_AT_name("ADCREV")
    4709                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_ADCREV")
    4710                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4711                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    4712              
    4713                      .dwendtag $C$DW$T$30
    4714              
    4715              $C$DW$T$239     .dwtag  DW_TAG_typedef
    4716                      .dwattr $C$DW$T$239, DW_AT_name("ADC_Obj")
    4717                      .dwattr $C$DW$T$239, DW_AT_type(*$C$DW$T$30)
    4718                      .dwattr $C$DW$T$239, DW_AT_language(DW_LANG_C)
    4719              
    4720              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    4721                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$30)
    4722                      .dwattr $C$DW$T$132, DW_AT_address_class(0x20)
    4723              
    4724              $C$DW$T$133     .dwtag  DW_TAG_typedef
    4725                      .dwattr $C$DW$T$133, DW_AT_name("ADC_Handle")
    4726                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
    4727                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    4728              
    4729              
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE   92

    4730              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4731                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    4732                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    4733              $C$DW$597       .dwtag  DW_TAG_member
    4734                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$31)
    4735                      .dwattr $C$DW$597, DW_AT_name("alpha_sf")
    4736                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_alpha_sf")
    4737                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4738                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    4739              
    4740              $C$DW$598       .dwtag  DW_TAG_member
    4741                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$31)
    4742                      .dwattr $C$DW$598, DW_AT_name("beta_sf")
    4743                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_beta_sf")
    4744                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4745                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    4746              
    4747              $C$DW$599       .dwtag  DW_TAG_member
    4748                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$32)
    4749                      .dwattr $C$DW$599, DW_AT_name("numSensors")
    4750                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_numSensors")
    4751                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4752                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    4753              
    4754                      .dwendtag $C$DW$T$33
    4755              
    4756              $C$DW$T$44      .dwtag  DW_TAG_typedef
    4757                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Obj")
    4758                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    4759                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4760              
    4761              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    4762                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    4763                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    4764              
    4765              $C$DW$T$43      .dwtag  DW_TAG_typedef
    4766                      .dwattr $C$DW$T$43, DW_AT_name("CLARKE_Handle")
    4767                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4768                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4769              
    4770              
    4771              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4772                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    4773                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    4774              $C$DW$600       .dwtag  DW_TAG_member
    4775                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$23)
    4776                      .dwattr $C$DW$600, DW_AT_name("XCLK")
    4777                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_XCLK")
    4778                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4779                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4780              
    4781              $C$DW$601       .dwtag  DW_TAG_member
    4782                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$23)
    4783                      .dwattr $C$DW$601, DW_AT_name("rsvd_1")
    4784                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_rsvd_1")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE   93

    4785                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4786                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4787              
    4788              $C$DW$602       .dwtag  DW_TAG_member
    4789                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$23)
    4790                      .dwattr $C$DW$602, DW_AT_name("CLKCTL")
    4791                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_CLKCTL")
    4792                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4793                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    4794              
    4795              $C$DW$603       .dwtag  DW_TAG_member
    4796                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$34)
    4797                      .dwattr $C$DW$603, DW_AT_name("rsvd_2")
    4798                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_rsvd_2")
    4799                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4800                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4801              
    4802              $C$DW$604       .dwtag  DW_TAG_member
    4803                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$23)
    4804                      .dwattr $C$DW$604, DW_AT_name("LOSPCP")
    4805                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_LOSPCP")
    4806                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4807                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    4808              
    4809              $C$DW$605       .dwtag  DW_TAG_member
    4810                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$23)
    4811                      .dwattr $C$DW$605, DW_AT_name("PCLKCR0")
    4812                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_PCLKCR0")
    4813                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4814                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4815              
    4816              $C$DW$606       .dwtag  DW_TAG_member
    4817                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$23)
    4818                      .dwattr $C$DW$606, DW_AT_name("PCLKCR1")
    4819                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_PCLKCR1")
    4820                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4821                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4822              
    4823              $C$DW$607       .dwtag  DW_TAG_member
    4824                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$26)
    4825                      .dwattr $C$DW$607, DW_AT_name("rsvd_3")
    4826                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_rsvd_3")
    4827                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4828                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    4829              
    4830              $C$DW$608       .dwtag  DW_TAG_member
    4831                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$23)
    4832                      .dwattr $C$DW$608, DW_AT_name("PCLKCR3")
    4833                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_PCLKCR3")
    4834                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4835                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    4836              
    4837                      .dwendtag $C$DW$T$35
    4838              
    4839              $C$DW$T$134     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE   94

    4840                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$35)
    4841                      .dwattr $C$DW$T$134, DW_AT_address_class(0x20)
    4842              
    4843              $C$DW$T$135     .dwtag  DW_TAG_typedef
    4844                      .dwattr $C$DW$T$135, DW_AT_name("CLK_Handle")
    4845                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    4846                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    4847              
    4848              
    4849              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4850                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    4851                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    4852              $C$DW$609       .dwtag  DW_TAG_member
    4853                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$32)
    4854                      .dwattr $C$DW$609, DW_AT_name("tmp")
    4855                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_tmp")
    4856                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4857                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    4858              
    4859                      .dwendtag $C$DW$T$36
    4860              
    4861              $C$DW$T$136     .dwtag  DW_TAG_pointer_type
    4862                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$36)
    4863                      .dwattr $C$DW$T$136, DW_AT_address_class(0x20)
    4864              
    4865              $C$DW$T$137     .dwtag  DW_TAG_typedef
    4866                      .dwattr $C$DW$T$137, DW_AT_name("CPU_Handle")
    4867                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
    4868                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    4869              
    4870              
    4871              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4872                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    4873                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    4874              $C$DW$610       .dwtag  DW_TAG_member
    4875                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$37)
    4876                      .dwattr $C$DW$610, DW_AT_name("version")
    4877                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_version")
    4878                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4879                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4880              
    4881              $C$DW$611       .dwtag  DW_TAG_member
    4882                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$39)
    4883                      .dwattr $C$DW$611, DW_AT_name("state")
    4884                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_state")
    4885                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4886                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4887              
    4888              $C$DW$612       .dwtag  DW_TAG_member
    4889                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$39)
    4890                      .dwattr $C$DW$612, DW_AT_name("prevState")
    4891                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_prevState")
    4892                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4893                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4894              
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE   95

    4895              $C$DW$613       .dwtag  DW_TAG_member
    4896                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$41)
    4897                      .dwattr $C$DW$613, DW_AT_name("errorCode")
    4898                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_errorCode")
    4899                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4900                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4901              
    4902              $C$DW$614       .dwtag  DW_TAG_member
    4903                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$43)
    4904                      .dwattr $C$DW$614, DW_AT_name("clarkeHandle_I")
    4905                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4906                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4907                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4908              
    4909              $C$DW$615       .dwtag  DW_TAG_member
    4910                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$44)
    4911                      .dwattr $C$DW$615, DW_AT_name("clarke_I")
    4912                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_clarke_I")
    4913                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4914                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4915              
    4916              $C$DW$616       .dwtag  DW_TAG_member
    4917                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$43)
    4918                      .dwattr $C$DW$616, DW_AT_name("clarkeHandle_V")
    4919                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4920                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4921                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4922              
    4923              $C$DW$617       .dwtag  DW_TAG_member
    4924                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$44)
    4925                      .dwattr $C$DW$617, DW_AT_name("clarke_V")
    4926                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_clarke_V")
    4927                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4928                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4929              
    4930              $C$DW$618       .dwtag  DW_TAG_member
    4931                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$46)
    4932                      .dwattr $C$DW$618, DW_AT_name("estHandle")
    4933                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_estHandle")
    4934                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4935                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4936              
    4937              $C$DW$619       .dwtag  DW_TAG_member
    4938                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$48)
    4939                      .dwattr $C$DW$619, DW_AT_name("parkHandle")
    4940                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_parkHandle")
    4941                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4942                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4943              
    4944              $C$DW$620       .dwtag  DW_TAG_member
    4945                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$49)
    4946                      .dwattr $C$DW$620, DW_AT_name("park")
    4947                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_park")
    4948                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4949                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE   96

    4950              
    4951              $C$DW$621       .dwtag  DW_TAG_member
    4952                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$51)
    4953                      .dwattr $C$DW$621, DW_AT_name("pidHandle_Id")
    4954                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_pidHandle_Id")
    4955                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4956                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4957              
    4958              $C$DW$622       .dwtag  DW_TAG_member
    4959                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$52)
    4960                      .dwattr $C$DW$622, DW_AT_name("pid_Id")
    4961                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_pid_Id")
    4962                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4963                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4964              
    4965              $C$DW$623       .dwtag  DW_TAG_member
    4966                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$51)
    4967                      .dwattr $C$DW$623, DW_AT_name("pidHandle_Iq")
    4968                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4969                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4970                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4971              
    4972              $C$DW$624       .dwtag  DW_TAG_member
    4973                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$52)
    4974                      .dwattr $C$DW$624, DW_AT_name("pid_Iq")
    4975                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_pid_Iq")
    4976                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4977                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4978              
    4979              $C$DW$625       .dwtag  DW_TAG_member
    4980                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$51)
    4981                      .dwattr $C$DW$625, DW_AT_name("pidHandle_spd")
    4982                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_pidHandle_spd")
    4983                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4984                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4985              
    4986              $C$DW$626       .dwtag  DW_TAG_member
    4987                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$52)
    4988                      .dwattr $C$DW$626, DW_AT_name("pid_spd")
    4989                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_pid_spd")
    4990                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4991                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4992              
    4993              $C$DW$627       .dwtag  DW_TAG_member
    4994                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$54)
    4995                      .dwattr $C$DW$627, DW_AT_name("iparkHandle")
    4996                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_iparkHandle")
    4997                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4998                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4999              
    5000              $C$DW$628       .dwtag  DW_TAG_member
    5001                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$55)
    5002                      .dwattr $C$DW$628, DW_AT_name("ipark")
    5003                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_ipark")
    5004                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE   97

    5005                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    5006              
    5007              $C$DW$629       .dwtag  DW_TAG_member
    5008                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$57)
    5009                      .dwattr $C$DW$629, DW_AT_name("svgenHandle")
    5010                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_svgenHandle")
    5011                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5012                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    5013              
    5014              $C$DW$630       .dwtag  DW_TAG_member
    5015                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$58)
    5016                      .dwattr $C$DW$630, DW_AT_name("svgen")
    5017                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_svgen")
    5018                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5019                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    5020              
    5021              $C$DW$631       .dwtag  DW_TAG_member
    5022                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$60)
    5023                      .dwattr $C$DW$631, DW_AT_name("trajHandle_Id")
    5024                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_trajHandle_Id")
    5025                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5026                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    5027              
    5028              $C$DW$632       .dwtag  DW_TAG_member
    5029                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$61)
    5030                      .dwattr $C$DW$632, DW_AT_name("traj_Id")
    5031                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_traj_Id")
    5032                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    5033                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    5034              
    5035              $C$DW$633       .dwtag  DW_TAG_member
    5036                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$60)
    5037                      .dwattr $C$DW$633, DW_AT_name("trajHandle_spd")
    5038                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_trajHandle_spd")
    5039                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    5040                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    5041              
    5042              $C$DW$634       .dwtag  DW_TAG_member
    5043                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$61)
    5044                      .dwattr $C$DW$634, DW_AT_name("traj_spd")
    5045                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_traj_spd")
    5046                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    5047                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    5048              
    5049              $C$DW$635       .dwtag  DW_TAG_member
    5050                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$60)
    5051                      .dwattr $C$DW$635, DW_AT_name("trajHandle_spdMax")
    5052                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    5053                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5054                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    5055              
    5056              $C$DW$636       .dwtag  DW_TAG_member
    5057                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$61)
    5058                      .dwattr $C$DW$636, DW_AT_name("traj_spdMax")
    5059                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_traj_spdMax")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE   98

    5060                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5061                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    5062              
    5063              $C$DW$637       .dwtag  DW_TAG_member
    5064                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$62)
    5065                      .dwattr $C$DW$637, DW_AT_name("motorParams")
    5066                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_motorParams")
    5067                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    5068                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    5069              
    5070              $C$DW$638       .dwtag  DW_TAG_member
    5071                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$65)
    5072                      .dwattr $C$DW$638, DW_AT_name("waitTimes")
    5073                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_waitTimes")
    5074                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    5075                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    5076              
    5077              $C$DW$639       .dwtag  DW_TAG_member
    5078                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$64)
    5079                      .dwattr $C$DW$639, DW_AT_name("counter_state")
    5080                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_counter_state")
    5081                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    5082                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    5083              
    5084              $C$DW$640       .dwtag  DW_TAG_member
    5085                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$66)
    5086                      .dwattr $C$DW$640, DW_AT_name("numIsrTicksPerCtrlTick")
    5087                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    5088                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    5089                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    5090              
    5091              $C$DW$641       .dwtag  DW_TAG_member
    5092                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$66)
    5093                      .dwattr $C$DW$641, DW_AT_name("numCtrlTicksPerCurrentTick")
    5094                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    5095                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    5096                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    5097              
    5098              $C$DW$642       .dwtag  DW_TAG_member
    5099                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$66)
    5100                      .dwattr $C$DW$642, DW_AT_name("numCtrlTicksPerSpeedTick")
    5101                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    5102                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    5103                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    5104              
    5105              $C$DW$643       .dwtag  DW_TAG_member
    5106                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$66)
    5107                      .dwattr $C$DW$643, DW_AT_name("numCtrlTicksPerTrajTick")
    5108                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    5109                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    5110                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    5111              
    5112              $C$DW$644       .dwtag  DW_TAG_member
    5113                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$64)
    5114                      .dwattr $C$DW$644, DW_AT_name("ctrlFreq_Hz")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE   99

    5115                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    5116                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    5117                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    5118              
    5119              $C$DW$645       .dwtag  DW_TAG_member
    5120                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$64)
    5121                      .dwattr $C$DW$645, DW_AT_name("trajFreq_Hz")
    5122                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_trajFreq_Hz")
    5123                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    5124                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    5125              
    5126              $C$DW$646       .dwtag  DW_TAG_member
    5127                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$31)
    5128                      .dwattr $C$DW$646, DW_AT_name("trajPeriod_sec")
    5129                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_trajPeriod_sec")
    5130                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    5131                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    5132              
    5133              $C$DW$647       .dwtag  DW_TAG_member
    5134                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$67)
    5135                      .dwattr $C$DW$647, DW_AT_name("ctrlPeriod_sec")
    5136                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    5137                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    5138                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    5139              
    5140              $C$DW$648       .dwtag  DW_TAG_member
    5141                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$31)
    5142                      .dwattr $C$DW$648, DW_AT_name("maxVsMag_pu")
    5143                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_maxVsMag_pu")
    5144                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    5145                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    5146              
    5147              $C$DW$649       .dwtag  DW_TAG_member
    5148                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$68)
    5149                      .dwattr $C$DW$649, DW_AT_name("Iab_in")
    5150                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_Iab_in")
    5151                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    5152                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    5153              
    5154              $C$DW$650       .dwtag  DW_TAG_member
    5155                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$68)
    5156                      .dwattr $C$DW$650, DW_AT_name("Iab_filt")
    5157                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_Iab_filt")
    5158                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    5159                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    5160              
    5161              $C$DW$651       .dwtag  DW_TAG_member
    5162                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$68)
    5163                      .dwattr $C$DW$651, DW_AT_name("Idq_in")
    5164                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_Idq_in")
    5165                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    5166                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    5167              
    5168              $C$DW$652       .dwtag  DW_TAG_member
    5169                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$68)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE  100

    5170                      .dwattr $C$DW$652, DW_AT_name("Vab_in")
    5171                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_Vab_in")
    5172                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    5173                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    5174              
    5175              $C$DW$653       .dwtag  DW_TAG_member
    5176                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$31)
    5177                      .dwattr $C$DW$653, DW_AT_name("spd_out")
    5178                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_spd_out")
    5179                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    5180                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    5181              
    5182              $C$DW$654       .dwtag  DW_TAG_member
    5183                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$68)
    5184                      .dwattr $C$DW$654, DW_AT_name("Vab_out")
    5185                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_Vab_out")
    5186                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    5187                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    5188              
    5189              $C$DW$655       .dwtag  DW_TAG_member
    5190                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$68)
    5191                      .dwattr $C$DW$655, DW_AT_name("Vdq_out")
    5192                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_Vdq_out")
    5193                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    5194                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    5195              
    5196              $C$DW$656       .dwtag  DW_TAG_member
    5197                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$67)
    5198                      .dwattr $C$DW$656, DW_AT_name("Rhf")
    5199                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_Rhf")
    5200                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    5201                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    5202              
    5203              $C$DW$657       .dwtag  DW_TAG_member
    5204                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$67)
    5205                      .dwattr $C$DW$657, DW_AT_name("Lhf")
    5206                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_Lhf")
    5207                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    5208                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    5209              
    5210              $C$DW$658       .dwtag  DW_TAG_member
    5211                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$67)
    5212                      .dwattr $C$DW$658, DW_AT_name("RoverL")
    5213                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_RoverL")
    5214                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    5215                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    5216              
    5217              $C$DW$659       .dwtag  DW_TAG_member
    5218                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$31)
    5219                      .dwattr $C$DW$659, DW_AT_name("Kp_Id")
    5220                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_Kp_Id")
    5221                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    5222                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    5223              
    5224              $C$DW$660       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE  101

    5225                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$31)
    5226                      .dwattr $C$DW$660, DW_AT_name("Kp_Iq")
    5227                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_Kp_Iq")
    5228                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    5229                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    5230              
    5231              $C$DW$661       .dwtag  DW_TAG_member
    5232                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$31)
    5233                      .dwattr $C$DW$661, DW_AT_name("Kp_spd")
    5234                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_Kp_spd")
    5235                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    5236                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    5237              
    5238              $C$DW$662       .dwtag  DW_TAG_member
    5239                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$31)
    5240                      .dwattr $C$DW$662, DW_AT_name("Ki_Id")
    5241                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_Ki_Id")
    5242                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    5243                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    5244              
    5245              $C$DW$663       .dwtag  DW_TAG_member
    5246                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$31)
    5247                      .dwattr $C$DW$663, DW_AT_name("Ki_Iq")
    5248                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_Ki_Iq")
    5249                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    5250                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    5251              
    5252              $C$DW$664       .dwtag  DW_TAG_member
    5253                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$31)
    5254                      .dwattr $C$DW$664, DW_AT_name("Ki_spd")
    5255                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_Ki_spd")
    5256                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    5257                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5258              
    5259              $C$DW$665       .dwtag  DW_TAG_member
    5260                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$31)
    5261                      .dwattr $C$DW$665, DW_AT_name("Kd_Id")
    5262                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_Kd_Id")
    5263                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    5264                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5265              
    5266              $C$DW$666       .dwtag  DW_TAG_member
    5267                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$31)
    5268                      .dwattr $C$DW$666, DW_AT_name("Kd_Iq")
    5269                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_Kd_Iq")
    5270                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    5271                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    5272              
    5273              $C$DW$667       .dwtag  DW_TAG_member
    5274                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$31)
    5275                      .dwattr $C$DW$667, DW_AT_name("Kd_spd")
    5276                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_Kd_spd")
    5277                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    5278                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    5279              
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE  102

    5280              $C$DW$668       .dwtag  DW_TAG_member
    5281                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$31)
    5282                      .dwattr $C$DW$668, DW_AT_name("Ui_Id")
    5283                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_Ui_Id")
    5284                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    5285                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    5286              
    5287              $C$DW$669       .dwtag  DW_TAG_member
    5288                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$31)
    5289                      .dwattr $C$DW$669, DW_AT_name("Ui_Iq")
    5290                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_Ui_Iq")
    5291                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    5292                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5293              
    5294              $C$DW$670       .dwtag  DW_TAG_member
    5295                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$31)
    5296                      .dwattr $C$DW$670, DW_AT_name("Ui_spd")
    5297                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_Ui_spd")
    5298                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    5299                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5300              
    5301              $C$DW$671       .dwtag  DW_TAG_member
    5302                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$68)
    5303                      .dwattr $C$DW$671, DW_AT_name("Idq_ref")
    5304                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_Idq_ref")
    5305                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    5306                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    5307              
    5308              $C$DW$672       .dwtag  DW_TAG_member
    5309                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$31)
    5310                      .dwattr $C$DW$672, DW_AT_name("IdRated")
    5311                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_IdRated")
    5312                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    5313                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    5314              
    5315              $C$DW$673       .dwtag  DW_TAG_member
    5316                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$31)
    5317                      .dwattr $C$DW$673, DW_AT_name("spd_ref")
    5318                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_spd_ref")
    5319                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    5320                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5321              
    5322              $C$DW$674       .dwtag  DW_TAG_member
    5323                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$31)
    5324                      .dwattr $C$DW$674, DW_AT_name("spd_max")
    5325                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_spd_max")
    5326                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    5327                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5328              
    5329              $C$DW$675       .dwtag  DW_TAG_member
    5330                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$66)
    5331                      .dwattr $C$DW$675, DW_AT_name("counter_current")
    5332                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_counter_current")
    5333                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    5334                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE  103

    5335              
    5336              $C$DW$676       .dwtag  DW_TAG_member
    5337                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$66)
    5338                      .dwattr $C$DW$676, DW_AT_name("counter_isr")
    5339                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_counter_isr")
    5340                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    5341                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    5342              
    5343              $C$DW$677       .dwtag  DW_TAG_member
    5344                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$66)
    5345                      .dwattr $C$DW$677, DW_AT_name("counter_speed")
    5346                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_counter_speed")
    5347                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    5348                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    5349              
    5350              $C$DW$678       .dwtag  DW_TAG_member
    5351                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$66)
    5352                      .dwattr $C$DW$678, DW_AT_name("counter_traj")
    5353                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_counter_traj")
    5354                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    5355                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    5356              
    5357              $C$DW$679       .dwtag  DW_TAG_member
    5358                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$69)
    5359                      .dwattr $C$DW$679, DW_AT_name("flag_enableCtrl")
    5360                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_flag_enableCtrl")
    5361                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    5362                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    5363              
    5364              $C$DW$680       .dwtag  DW_TAG_member
    5365                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$69)
    5366                      .dwattr $C$DW$680, DW_AT_name("flag_enableDcBusComp")
    5367                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    5368                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    5369                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5370              
    5371              $C$DW$681       .dwtag  DW_TAG_member
    5372                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$69)
    5373                      .dwattr $C$DW$681, DW_AT_name("flag_enablePowerWarp")
    5374                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    5375                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    5376                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5377              
    5378              $C$DW$682       .dwtag  DW_TAG_member
    5379                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$69)
    5380                      .dwattr $C$DW$682, DW_AT_name("flag_enableOffset")
    5381                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_flag_enableOffset")
    5382                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    5383                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    5384              
    5385              $C$DW$683       .dwtag  DW_TAG_member
    5386                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$69)
    5387                      .dwattr $C$DW$683, DW_AT_name("flag_enableSpeedCtrl")
    5388                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    5389                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE  104

    5390                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    5391              
    5392              $C$DW$684       .dwtag  DW_TAG_member
    5393                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$69)
    5394                      .dwattr $C$DW$684, DW_AT_name("flag_enableUserMotorParams")
    5395                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    5396                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    5397                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    5398              
    5399              $C$DW$685       .dwtag  DW_TAG_member
    5400                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$68)
    5401                      .dwattr $C$DW$685, DW_AT_name("Idq_offset_pu")
    5402                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_Idq_offset_pu")
    5403                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    5404                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    5405              
    5406              $C$DW$686       .dwtag  DW_TAG_member
    5407                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$68)
    5408                      .dwattr $C$DW$686, DW_AT_name("Vdq_offset_pu")
    5409                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    5410                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    5411                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    5412              
    5413              $C$DW$687       .dwtag  DW_TAG_member
    5414                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$31)
    5415                      .dwattr $C$DW$687, DW_AT_name("angle_pu")
    5416                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_angle_pu")
    5417                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    5418                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    5419              
    5420              $C$DW$688       .dwtag  DW_TAG_member
    5421                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$31)
    5422                      .dwattr $C$DW$688, DW_AT_name("speed_ref_pu")
    5423                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_speed_ref_pu")
    5424                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    5425                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    5426              
    5427              $C$DW$689       .dwtag  DW_TAG_member
    5428                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$31)
    5429                      .dwattr $C$DW$689, DW_AT_name("speed_fb_pu")
    5430                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_speed_fb_pu")
    5431                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    5432                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    5433              
    5434              $C$DW$690       .dwtag  DW_TAG_member
    5435                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$31)
    5436                      .dwattr $C$DW$690, DW_AT_name("speed_outMax_pu")
    5437                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_speed_outMax_pu")
    5438                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    5439                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    5440              
    5441              $C$DW$691       .dwtag  DW_TAG_member
    5442                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$69)
    5443                      .dwattr $C$DW$691, DW_AT_name("flag_enableCurrentCtrl")
    5444                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE  105

    5445                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    5446                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    5447              
    5448                      .dwendtag $C$DW$T$70
    5449              
    5450              $C$DW$T$240     .dwtag  DW_TAG_typedef
    5451                      .dwattr $C$DW$T$240, DW_AT_name("CTRL_Obj")
    5452                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$70)
    5453                      .dwattr $C$DW$T$240, DW_AT_language(DW_LANG_C)
    5454              
    5455              $C$DW$T$241     .dwtag  DW_TAG_pointer_type
    5456                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$T$240)
    5457                      .dwattr $C$DW$T$241, DW_AT_address_class(0x20)
    5458              
    5459              $C$DW$T$212     .dwtag  DW_TAG_pointer_type
    5460                      .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$70)
    5461                      .dwattr $C$DW$T$212, DW_AT_address_class(0x20)
    5462              
    5463              $C$DW$T$213     .dwtag  DW_TAG_typedef
    5464                      .dwattr $C$DW$T$213, DW_AT_name("CTRL_Handle")
    5465                      .dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$212)
    5466                      .dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
    5467              
    5468              $C$DW$692       .dwtag  DW_TAG_TI_far_type
    5469                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$213)
    5470              
    5471              $C$DW$T$242     .dwtag  DW_TAG_const_type
    5472                      .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$692)
    5473              
    5474              
    5475              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    5476                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    5477                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    5478              $C$DW$693       .dwtag  DW_TAG_member
    5479                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$22)
    5480                      .dwattr $C$DW$693, DW_AT_name("rsvd")
    5481                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_rsvd")
    5482                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5483                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    5484              
    5485              $C$DW$694       .dwtag  DW_TAG_member
    5486                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$72)
    5487                      .dwattr $C$DW$694, DW_AT_name("targetProc")
    5488                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_targetProc")
    5489                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5490                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    5491              
    5492              $C$DW$695       .dwtag  DW_TAG_member
    5493                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$22)
    5494                      .dwattr $C$DW$695, DW_AT_name("major")
    5495                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_major")
    5496                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5497                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    5498              
    5499              $C$DW$696       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE  106

    5500                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$22)
    5501                      .dwattr $C$DW$696, DW_AT_name("minor")
    5502                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_minor")
    5503                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5504                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    5505              
    5506                      .dwendtag $C$DW$T$73
    5507              
    5508              $C$DW$T$37      .dwtag  DW_TAG_typedef
    5509                      .dwattr $C$DW$T$37, DW_AT_name("CTRL_Version")
    5510                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    5511                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    5512              
    5513              $C$DW$T$250     .dwtag  DW_TAG_pointer_type
    5514                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$T$37)
    5515                      .dwattr $C$DW$T$250, DW_AT_address_class(0x20)
    5516              
    5517              
    5518              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    5519                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8353_Obj_")
    5520                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    5521              $C$DW$697       .dwtag  DW_TAG_member
    5522                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$75)
    5523                      .dwattr $C$DW$697, DW_AT_name("spiHandle")
    5524                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_spiHandle")
    5525                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5526                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    5527              
    5528              $C$DW$698       .dwtag  DW_TAG_member
    5529                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$77)
    5530                      .dwattr $C$DW$698, DW_AT_name("gpioHandle")
    5531                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_gpioHandle")
    5532                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5533                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    5534              
    5535              $C$DW$699       .dwtag  DW_TAG_member
    5536                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$79)
    5537                      .dwattr $C$DW$699, DW_AT_name("gpioNumber")
    5538                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_gpioNumber")
    5539                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5540                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    5541              
    5542              $C$DW$700       .dwtag  DW_TAG_member
    5543                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$69)
    5544                      .dwattr $C$DW$700, DW_AT_name("RxTimeOut")
    5545                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_RxTimeOut")
    5546                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5547                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    5548              
    5549              $C$DW$701       .dwtag  DW_TAG_member
    5550                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$69)
    5551                      .dwattr $C$DW$701, DW_AT_name("enableTimeOut")
    5552                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_enableTimeOut")
    5553                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5554                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE  107

    5555              
    5556                      .dwendtag $C$DW$T$80
    5557              
    5558              $C$DW$T$165     .dwtag  DW_TAG_typedef
    5559                      .dwattr $C$DW$T$165, DW_AT_name("DRV8353_Obj")
    5560                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$80)
    5561                      .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    5562              
    5563              $C$DW$T$163     .dwtag  DW_TAG_pointer_type
    5564                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$80)
    5565                      .dwattr $C$DW$T$163, DW_AT_address_class(0x20)
    5566              
    5567              $C$DW$T$164     .dwtag  DW_TAG_typedef
    5568                      .dwattr $C$DW$T$164, DW_AT_name("DRV8353_Handle")
    5569                      .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$163)
    5570                      .dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
    5571              
    5572              
    5573              $C$DW$T$83      .dwtag  DW_TAG_structure_type
    5574                      .dwattr $C$DW$T$83, DW_AT_name("_DRV_SPI_8353_Ctrl02_t_")
    5575                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x0a)
    5576              $C$DW$702       .dwtag  DW_TAG_member
    5577                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$69)
    5578                      .dwattr $C$DW$702, DW_AT_name("CLR_FLT")
    5579                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_CLR_FLT")
    5580                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5581                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    5582              
    5583              $C$DW$703       .dwtag  DW_TAG_member
    5584                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$69)
    5585                      .dwattr $C$DW$703, DW_AT_name("BRAKE")
    5586                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_BRAKE")
    5587                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5588                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    5589              
    5590              $C$DW$704       .dwtag  DW_TAG_member
    5591                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$69)
    5592                      .dwattr $C$DW$704, DW_AT_name("COAST")
    5593                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_COAST")
    5594                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5595                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    5596              
    5597              $C$DW$705       .dwtag  DW_TAG_member
    5598                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$69)
    5599                      .dwattr $C$DW$705, DW_AT_name("PWM1_DIR")
    5600                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_PWM1_DIR")
    5601                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5602                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    5603              
    5604              $C$DW$706       .dwtag  DW_TAG_member
    5605                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$69)
    5606                      .dwattr $C$DW$706, DW_AT_name("PWM1_COM")
    5607                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_PWM1_COM")
    5608                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5609                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE  108

    5610              
    5611              $C$DW$707       .dwtag  DW_TAG_member
    5612                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$82)
    5613                      .dwattr $C$DW$707, DW_AT_name("PWM_MODE")
    5614                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_PWM_MODE")
    5615                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5616                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    5617              
    5618              $C$DW$708       .dwtag  DW_TAG_member
    5619                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$69)
    5620                      .dwattr $C$DW$708, DW_AT_name("OTW_REP")
    5621                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_OTW_REP")
    5622                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5623                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    5624              
    5625              $C$DW$709       .dwtag  DW_TAG_member
    5626                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$69)
    5627                      .dwattr $C$DW$709, DW_AT_name("DIS_GDF")
    5628                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_DIS_GDF")
    5629                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5630                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    5631              
    5632              $C$DW$710       .dwtag  DW_TAG_member
    5633                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$69)
    5634                      .dwattr $C$DW$710, DW_AT_name("DIS_CPUV")
    5635                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_DIS_CPUV")
    5636                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5637                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    5638              
    5639              $C$DW$711       .dwtag  DW_TAG_member
    5640                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$69)
    5641                      .dwattr $C$DW$711, DW_AT_name("OCP_ACT")
    5642                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_OCP_ACT")
    5643                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5644                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    5645              
    5646                      .dwendtag $C$DW$T$83
    5647              
    5648              $C$DW$T$117     .dwtag  DW_TAG_typedef
    5649                      .dwattr $C$DW$T$117, DW_AT_name("DRV_SPI_8353_Ctrl02_t_")
    5650                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$83)
    5651                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    5652              
    5653              
    5654              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    5655                      .dwattr $C$DW$T$90, DW_AT_name("_DRV_SPI_8353_Ctrl03_t_")
    5656                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x03)
    5657              $C$DW$712       .dwtag  DW_TAG_member
    5658                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$85)
    5659                      .dwattr $C$DW$712, DW_AT_name("IDRIVEN_HS")
    5660                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_IDRIVEN_HS")
    5661                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5662                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    5663              
    5664              $C$DW$713       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE  109

    5665                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$87)
    5666                      .dwattr $C$DW$713, DW_AT_name("IDRIVEP_HS")
    5667                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_IDRIVEP_HS")
    5668                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5669                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    5670              
    5671              $C$DW$714       .dwtag  DW_TAG_member
    5672                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$89)
    5673                      .dwattr $C$DW$714, DW_AT_name("LOCK")
    5674                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_LOCK")
    5675                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5676                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    5677              
    5678                      .dwendtag $C$DW$T$90
    5679              
    5680              $C$DW$T$118     .dwtag  DW_TAG_typedef
    5681                      .dwattr $C$DW$T$118, DW_AT_name("DRV_SPI_8353_Ctrl03_t_")
    5682                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$90)
    5683                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    5684              
    5685              
    5686              $C$DW$T$97      .dwtag  DW_TAG_structure_type
    5687                      .dwattr $C$DW$T$97, DW_AT_name("_DRV_SPI_8353_Ctrl04_t_")
    5688                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x04)
    5689              $C$DW$715       .dwtag  DW_TAG_member
    5690                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$92)
    5691                      .dwattr $C$DW$715, DW_AT_name("IDRIVEN_LS")
    5692                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_IDRIVEN_LS")
    5693                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5694                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    5695              
    5696              $C$DW$716       .dwtag  DW_TAG_member
    5697                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$94)
    5698                      .dwattr $C$DW$716, DW_AT_name("IDRIVEP_LS")
    5699                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_IDRIVEP_LS")
    5700                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5701                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    5702              
    5703              $C$DW$717       .dwtag  DW_TAG_member
    5704                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$96)
    5705                      .dwattr $C$DW$717, DW_AT_name("TDRIVE")
    5706                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_TDRIVE")
    5707                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5708                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    5709              
    5710              $C$DW$718       .dwtag  DW_TAG_member
    5711                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$69)
    5712                      .dwattr $C$DW$718, DW_AT_name("CBC")
    5713                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_CBC")
    5714                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5715                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    5716              
    5717                      .dwendtag $C$DW$T$97
    5718              
    5719              $C$DW$T$119     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Wed Jul 04 10:32:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1815610                         PAGE  110

    5720                      .dwattr $C$DW$T$119, DW_AT_name("DRV_SPI_8353_Ctrl04_t_")
    5721                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$97)
    5722                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    5723              
    5724              
    5725              $C$DW$T$106     .dwtag  DW_TAG_structure_type
    5726                      .dwattr $C$DW$T$106, DW_AT_name("_DRV_SPI_8353_Ctrl05_t_")
    5727                      .dwattr $C$DW$T$106, DW_AT_byte_size(0x05)
    5728              $C$DW$719       .dwtag  DW_TAG_member
    5729                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$99)
    5730                      .dwattr $C$DW$719, DW_AT_name("VDS_LVL")
    5731                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_VDS_LVL")
    5732                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5733                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    5734              
    5735              $C$DW$720       .dwtag  DW_TAG_member
    5736                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$101)
    5737                      .dwattr $C$DW$720, DW_AT_name("OCP_DEG")
    5738                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_OCP_DEG")
    5739                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5740                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    5741              
    5742              $C$DW$721       .dwtag  DW_TAG_member
    5743                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$103)
    5744                      .dwattr $C$DW$721, DW_AT_name("OCP_MODE")
    5745                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_OCP_MODE")
    5746                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5747                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    5748              
    5749              $C$DW$722       .dwtag  DW_TAG_member
    5750                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$105)
    5751                      .dwattr $C$DW$722, DW_AT_name("DEAD_TIME")
