TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Wed Jun 27 11:48:31 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware_drv8353/motorware_1_01_00_18/sw/modules/user/src/32b/us
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware_drv8353\motorware_1_01_00_18\sw\solutions\instaspin
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("CTRL_setGains")

    3335                      .dwattr $C$DW$331, DW_AT_const_value(0x5f)
    3336              
    3337              $C$DW$332       .dwtag  DW_TAG_enumerator
    3338                      .dwattr $C$DW$332, DW_AT_name("USER_ErrorCode_estFreq_Hz_High")
    3339                      .dwattr $C$DW$332, DW_AT_const_value(0x60)
    3340              
    3341              $C$DW$333       .dwtag  DW_TAG_enumerator
    3342                      .dwattr $C$DW$333, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low")
    3343                      .dwattr $C$DW$333, DW_AT_const_value(0x61)
    3344              
    3345              $C$DW$334       .dwtag  DW_TAG_enumerator
    3346                      .dwattr $C$DW$334, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High")
    3347                      .dwattr $C$DW$334, DW_AT_const_value(0x62)
    3348              
    3349              $C$DW$335       .dwtag  DW_TAG_enumerator
    3350                      .dwattr $C$DW$335, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low")
    3351                      .dwattr $C$DW$335, DW_AT_const_value(0x63)
    3352              
    3353              $C$DW$336       .dwtag  DW_TAG_enumerator
    3354                      .dwattr $C$DW$336, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High")
    3355                      .dwattr $C$DW$336, DW_AT_const_value(0x64)
    3356              
    3357              $C$DW$337       .dwtag  DW_TAG_enumerator
    3358                      .dwattr $C$DW$337, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low")
    3359                      .dwattr $C$DW$337, DW_AT_const_value(0x65)
    3360              
    3361              $C$DW$338       .dwtag  DW_TAG_enumerator
    3362                      .dwattr $C$DW$338, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High")
    3363                      .dwattr $C$DW$338, DW_AT_const_value(0x66)
    3364              
    3365              $C$DW$339       .dwtag  DW_TAG_enumerator
    3366                      .dwattr $C$DW$339, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low")
    3367                      .dwattr $C$DW$339, DW_AT_const_value(0x67)
    3368              
    3369              $C$DW$340       .dwtag  DW_TAG_enumerator
    3370                      .dwattr $C$DW$340, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High")
    3371                      .dwattr $C$DW$340, DW_AT_const_value(0x68)
    3372              
    3373              $C$DW$341       .dwtag  DW_TAG_enumerator
    3374                      .dwattr $C$DW$341, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low")
    3375                      .dwattr $C$DW$341, DW_AT_const_value(0x69)
    3376              
    3377              $C$DW$342       .dwtag  DW_TAG_enumerator
    3378                      .dwattr $C$DW$342, DW_AT_name("USER_numErrorCodes")
    3379                      .dwattr $C$DW$342, DW_AT_const_value(0x6a)
    3380              
    3381                      .dwendtag $C$DW$T$74
    3382              
    3383              $C$DW$T$75      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   67

    3384                      .dwattr $C$DW$T$75, DW_AT_name("USER_ErrorCode_e")
    3385                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3386                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3387              
    3388              $C$DW$343       .dwtag  DW_TAG_TI_far_type
    3389                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$75)
    3390              
    3391              $C$DW$T$77      .dwtag  DW_TAG_const_type
    3392                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$343)
    3393              
    3394              
    3395              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    3396                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    3397              $C$DW$344       .dwtag  DW_TAG_enumerator
    3398                      .dwattr $C$DW$344, DW_AT_name("CTRL_Type_PID_spd")
    3399                      .dwattr $C$DW$344, DW_AT_const_value(0x00)
    3400              
    3401              $C$DW$345       .dwtag  DW_TAG_enumerator
    3402                      .dwattr $C$DW$345, DW_AT_name("CTRL_Type_PID_Id")
    3403                      .dwattr $C$DW$345, DW_AT_const_value(0x01)
    3404              
    3405              $C$DW$346       .dwtag  DW_TAG_enumerator
    3406                      .dwattr $C$DW$346, DW_AT_name("CTRL_Type_PID_Iq")
    3407                      .dwattr $C$DW$346, DW_AT_const_value(0x02)
    3408              
    3409                      .dwendtag $C$DW$T$82
    3410              
    3411              $C$DW$T$83      .dwtag  DW_TAG_typedef
    3412                      .dwattr $C$DW$T$83, DW_AT_name("CTRL_Type_e")
    3413                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3414                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3415              
    3416              $C$DW$347       .dwtag  DW_TAG_TI_far_type
    3417                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$83)
    3418              
    3419              $C$DW$T$84      .dwtag  DW_TAG_const_type
    3420                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$347)
    3421              
    3422              
    3423              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3424                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    3425                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    3426              $C$DW$348       .dwtag  DW_TAG_member
    3427                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    3428                      .dwattr $C$DW$348, DW_AT_name("alpha_sf")
    3429                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_alpha_sf")
    3430                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3431                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3432              
    3433              $C$DW$349       .dwtag  DW_TAG_member
    3434                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    3435                      .dwattr $C$DW$349, DW_AT_name("beta_sf")
    3436                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_beta_sf")
    3437                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3438                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   68

    3439              
    3440              $C$DW$350       .dwtag  DW_TAG_member
    3441                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$22)
    3442                      .dwattr $C$DW$350, DW_AT_name("numSensors")
    3443                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_numSensors")
    3444                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3445                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3446              
    3447                      .dwendtag $C$DW$T$23
    3448              
    3449              $C$DW$T$31      .dwtag  DW_TAG_typedef
    3450                      .dwattr $C$DW$T$31, DW_AT_name("CLARKE_Obj")
    3451                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    3452                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3453              
    3454              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3455                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    3456                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3457              
    3458              $C$DW$T$30      .dwtag  DW_TAG_typedef
    3459                      .dwattr $C$DW$T$30, DW_AT_name("CLARKE_Handle")
    3460                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3461                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3462              
    3463              
    3464              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3465                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    3466                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    3467              $C$DW$351       .dwtag  DW_TAG_member
    3468                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$24)
    3469                      .dwattr $C$DW$351, DW_AT_name("version")
    3470                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_version")
    3471                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3472                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3473              
    3474              $C$DW$352       .dwtag  DW_TAG_member
    3475                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$26)
    3476                      .dwattr $C$DW$352, DW_AT_name("state")
    3477                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_state")
    3478                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3479                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3480              
    3481              $C$DW$353       .dwtag  DW_TAG_member
    3482                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$26)
    3483                      .dwattr $C$DW$353, DW_AT_name("prevState")
    3484                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_prevState")
    3485                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3486                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3487              
    3488              $C$DW$354       .dwtag  DW_TAG_member
    3489                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$28)
    3490                      .dwattr $C$DW$354, DW_AT_name("errorCode")
    3491                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_errorCode")
    3492                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3493                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   69

    3494              
    3495              $C$DW$355       .dwtag  DW_TAG_member
    3496                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$30)
    3497                      .dwattr $C$DW$355, DW_AT_name("clarkeHandle_I")
    3498                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3499                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3500                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3501              
    3502              $C$DW$356       .dwtag  DW_TAG_member
    3503                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$31)
    3504                      .dwattr $C$DW$356, DW_AT_name("clarke_I")
    3505                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_clarke_I")
    3506                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3507                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3508              
    3509              $C$DW$357       .dwtag  DW_TAG_member
    3510                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$30)
    3511                      .dwattr $C$DW$357, DW_AT_name("clarkeHandle_V")
    3512                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3513                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3514                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3515              
    3516              $C$DW$358       .dwtag  DW_TAG_member
    3517                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$31)
    3518                      .dwattr $C$DW$358, DW_AT_name("clarke_V")
    3519                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_clarke_V")
    3520                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3521                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3522              
    3523              $C$DW$359       .dwtag  DW_TAG_member
    3524                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$33)
    3525                      .dwattr $C$DW$359, DW_AT_name("estHandle")
    3526                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_estHandle")
    3527                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3528                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3529              
    3530              $C$DW$360       .dwtag  DW_TAG_member
    3531                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$35)
    3532                      .dwattr $C$DW$360, DW_AT_name("parkHandle")
    3533                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_parkHandle")
    3534                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3535                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3536              
    3537              $C$DW$361       .dwtag  DW_TAG_member
    3538                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$36)
    3539                      .dwattr $C$DW$361, DW_AT_name("park")
    3540                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_park")
    3541                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3542                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3543              
    3544              $C$DW$362       .dwtag  DW_TAG_member
    3545                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$38)
    3546                      .dwattr $C$DW$362, DW_AT_name("pidHandle_Id")
    3547                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_pidHandle_Id")
    3548                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   70

    3549                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3550              
    3551              $C$DW$363       .dwtag  DW_TAG_member
    3552                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$39)
    3553                      .dwattr $C$DW$363, DW_AT_name("pid_Id")
    3554                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_pid_Id")
    3555                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3556                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3557              
    3558              $C$DW$364       .dwtag  DW_TAG_member
    3559                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$38)
    3560                      .dwattr $C$DW$364, DW_AT_name("pidHandle_Iq")
    3561                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3562                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3563                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3564              
    3565              $C$DW$365       .dwtag  DW_TAG_member
    3566                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$39)
    3567                      .dwattr $C$DW$365, DW_AT_name("pid_Iq")
    3568                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_pid_Iq")
    3569                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3570                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3571              
    3572              $C$DW$366       .dwtag  DW_TAG_member
    3573                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$38)
    3574                      .dwattr $C$DW$366, DW_AT_name("pidHandle_spd")
    3575                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_pidHandle_spd")
    3576                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3577                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3578              
    3579              $C$DW$367       .dwtag  DW_TAG_member
    3580                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$39)
    3581                      .dwattr $C$DW$367, DW_AT_name("pid_spd")
    3582                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_pid_spd")
    3583                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3584                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3585              
    3586              $C$DW$368       .dwtag  DW_TAG_member
    3587                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$41)
    3588                      .dwattr $C$DW$368, DW_AT_name("iparkHandle")
    3589                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_iparkHandle")
    3590                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3591                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3592              
    3593              $C$DW$369       .dwtag  DW_TAG_member
    3594                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$42)
    3595                      .dwattr $C$DW$369, DW_AT_name("ipark")
    3596                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ipark")
    3597                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3598                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3599              
    3600              $C$DW$370       .dwtag  DW_TAG_member
    3601                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$44)
    3602                      .dwattr $C$DW$370, DW_AT_name("svgenHandle")
    3603                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_svgenHandle")
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   71

    3604                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3605                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3606              
    3607              $C$DW$371       .dwtag  DW_TAG_member
    3608                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$45)
    3609                      .dwattr $C$DW$371, DW_AT_name("svgen")
    3610                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_svgen")
    3611                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3612                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3613              
    3614              $C$DW$372       .dwtag  DW_TAG_member
    3615                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$47)
    3616                      .dwattr $C$DW$372, DW_AT_name("trajHandle_Id")
    3617                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_trajHandle_Id")
    3618                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3619                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3620              
    3621              $C$DW$373       .dwtag  DW_TAG_member
    3622                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$48)
    3623                      .dwattr $C$DW$373, DW_AT_name("traj_Id")
    3624                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_traj_Id")
    3625                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3626                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3627              
    3628              $C$DW$374       .dwtag  DW_TAG_member
    3629                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$47)
    3630                      .dwattr $C$DW$374, DW_AT_name("trajHandle_spd")
    3631                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_trajHandle_spd")
    3632                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3633                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3634              
    3635              $C$DW$375       .dwtag  DW_TAG_member
    3636                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$48)
    3637                      .dwattr $C$DW$375, DW_AT_name("traj_spd")
    3638                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_traj_spd")
    3639                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3640                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3641              
    3642              $C$DW$376       .dwtag  DW_TAG_member
    3643                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$47)
    3644                      .dwattr $C$DW$376, DW_AT_name("trajHandle_spdMax")
    3645                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3646                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3647                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3648              
    3649              $C$DW$377       .dwtag  DW_TAG_member
    3650                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$48)
    3651                      .dwattr $C$DW$377, DW_AT_name("traj_spdMax")
    3652                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_traj_spdMax")
    3653                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3654                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3655              
    3656              $C$DW$378       .dwtag  DW_TAG_member
    3657                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$49)
    3658                      .dwattr $C$DW$378, DW_AT_name("motorParams")
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   72

    3659                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_motorParams")
    3660                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3661                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3662              
    3663              $C$DW$379       .dwtag  DW_TAG_member
    3664                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$52)
    3665                      .dwattr $C$DW$379, DW_AT_name("waitTimes")
    3666                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_waitTimes")
    3667                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3668                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3669              
    3670              $C$DW$380       .dwtag  DW_TAG_member
    3671                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$51)
    3672                      .dwattr $C$DW$380, DW_AT_name("counter_state")
    3673                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_counter_state")
    3674                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3675                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3676              
    3677              $C$DW$381       .dwtag  DW_TAG_member
    3678                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$53)
    3679                      .dwattr $C$DW$381, DW_AT_name("numIsrTicksPerCtrlTick")
    3680                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3681                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3682                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3683              
    3684              $C$DW$382       .dwtag  DW_TAG_member
    3685                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$53)
    3686                      .dwattr $C$DW$382, DW_AT_name("numCtrlTicksPerCurrentTick")
    3687                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3688                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3689                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3690              
    3691              $C$DW$383       .dwtag  DW_TAG_member
    3692                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$53)
    3693                      .dwattr $C$DW$383, DW_AT_name("numCtrlTicksPerSpeedTick")
    3694                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3695                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3696                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3697              
    3698              $C$DW$384       .dwtag  DW_TAG_member
    3699                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$53)
    3700                      .dwattr $C$DW$384, DW_AT_name("numCtrlTicksPerTrajTick")
    3701                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3702                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3703                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3704              
    3705              $C$DW$385       .dwtag  DW_TAG_member
    3706                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$51)
    3707                      .dwattr $C$DW$385, DW_AT_name("ctrlFreq_Hz")
    3708                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3709                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3710                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3711              
    3712              $C$DW$386       .dwtag  DW_TAG_member
    3713                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$51)
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   73

    3714                      .dwattr $C$DW$386, DW_AT_name("trajFreq_Hz")
    3715                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3716                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3717                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3718              
    3719              $C$DW$387       .dwtag  DW_TAG_member
    3720                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$20)
    3721                      .dwattr $C$DW$387, DW_AT_name("trajPeriod_sec")
    3722                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3723                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3724                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3725              
    3726              $C$DW$388       .dwtag  DW_TAG_member
    3727                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$54)
    3728                      .dwattr $C$DW$388, DW_AT_name("ctrlPeriod_sec")
    3729                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3730                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3731                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3732              
    3733              $C$DW$389       .dwtag  DW_TAG_member
    3734                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$20)
    3735                      .dwattr $C$DW$389, DW_AT_name("maxVsMag_pu")
    3736                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3737                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3738                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3739              
    3740              $C$DW$390       .dwtag  DW_TAG_member
    3741                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$55)
    3742                      .dwattr $C$DW$390, DW_AT_name("Iab_in")
    3743                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_Iab_in")
    3744                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3745                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3746              
    3747              $C$DW$391       .dwtag  DW_TAG_member
    3748                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$55)
    3749                      .dwattr $C$DW$391, DW_AT_name("Iab_filt")
    3750                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_Iab_filt")
    3751                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3752                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3753              
    3754              $C$DW$392       .dwtag  DW_TAG_member
    3755                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$55)
    3756                      .dwattr $C$DW$392, DW_AT_name("Idq_in")
    3757                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_Idq_in")
    3758                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3759                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3760              
    3761              $C$DW$393       .dwtag  DW_TAG_member
    3762                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$55)
    3763                      .dwattr $C$DW$393, DW_AT_name("Vab_in")
    3764                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_Vab_in")
    3765                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3766                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3767              
    3768              $C$DW$394       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   74

    3769                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    3770                      .dwattr $C$DW$394, DW_AT_name("spd_out")
    3771                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_spd_out")
    3772                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3773                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3774              
    3775              $C$DW$395       .dwtag  DW_TAG_member
    3776                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$55)
    3777                      .dwattr $C$DW$395, DW_AT_name("Vab_out")
    3778                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_Vab_out")
    3779                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3780                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3781              
    3782              $C$DW$396       .dwtag  DW_TAG_member
    3783                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$55)
    3784                      .dwattr $C$DW$396, DW_AT_name("Vdq_out")
    3785                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_Vdq_out")
    3786                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3787                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3788              
    3789              $C$DW$397       .dwtag  DW_TAG_member
    3790                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$54)
    3791                      .dwattr $C$DW$397, DW_AT_name("Rhf")
    3792                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_Rhf")
    3793                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3794                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3795              
    3796              $C$DW$398       .dwtag  DW_TAG_member
    3797                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$54)
    3798                      .dwattr $C$DW$398, DW_AT_name("Lhf")
    3799                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_Lhf")
    3800                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3801                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3802              
    3803              $C$DW$399       .dwtag  DW_TAG_member
    3804                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$54)
    3805                      .dwattr $C$DW$399, DW_AT_name("RoverL")
    3806                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_RoverL")
    3807                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3808                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3809              
    3810              $C$DW$400       .dwtag  DW_TAG_member
    3811                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    3812                      .dwattr $C$DW$400, DW_AT_name("Kp_Id")
    3813                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_Kp_Id")
    3814                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3815                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3816              
    3817              $C$DW$401       .dwtag  DW_TAG_member
    3818                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
    3819                      .dwattr $C$DW$401, DW_AT_name("Kp_Iq")
    3820                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_Kp_Iq")
    3821                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3822                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3823              
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   75

    3824              $C$DW$402       .dwtag  DW_TAG_member
    3825                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
    3826                      .dwattr $C$DW$402, DW_AT_name("Kp_spd")
    3827                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_Kp_spd")
    3828                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3829                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3830              
    3831              $C$DW$403       .dwtag  DW_TAG_member
    3832                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    3833                      .dwattr $C$DW$403, DW_AT_name("Ki_Id")
    3834                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_Ki_Id")
    3835                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3836                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3837              
    3838              $C$DW$404       .dwtag  DW_TAG_member
    3839                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    3840                      .dwattr $C$DW$404, DW_AT_name("Ki_Iq")
    3841                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_Ki_Iq")
    3842                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3843                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3844              
    3845              $C$DW$405       .dwtag  DW_TAG_member
    3846                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    3847                      .dwattr $C$DW$405, DW_AT_name("Ki_spd")
    3848                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_Ki_spd")
    3849                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3850                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3851              
    3852              $C$DW$406       .dwtag  DW_TAG_member
    3853                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    3854                      .dwattr $C$DW$406, DW_AT_name("Kd_Id")
    3855                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_Kd_Id")
    3856                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3857                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3858              
    3859              $C$DW$407       .dwtag  DW_TAG_member
    3860                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    3861                      .dwattr $C$DW$407, DW_AT_name("Kd_Iq")
    3862                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_Kd_Iq")
    3863                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3864                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3865              
    3866              $C$DW$408       .dwtag  DW_TAG_member
    3867                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    3868                      .dwattr $C$DW$408, DW_AT_name("Kd_spd")
    3869                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Kd_spd")
    3870                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3871                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3872              
    3873              $C$DW$409       .dwtag  DW_TAG_member
    3874                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    3875                      .dwattr $C$DW$409, DW_AT_name("Ui_Id")
    3876                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Ui_Id")
    3877                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3878                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   76

    3879              
    3880              $C$DW$410       .dwtag  DW_TAG_member
    3881                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    3882                      .dwattr $C$DW$410, DW_AT_name("Ui_Iq")
    3883                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Ui_Iq")
    3884                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3885                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3886              
    3887              $C$DW$411       .dwtag  DW_TAG_member
    3888                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    3889                      .dwattr $C$DW$411, DW_AT_name("Ui_spd")
    3890                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Ui_spd")
    3891                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3892                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3893              
    3894              $C$DW$412       .dwtag  DW_TAG_member
    3895                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$55)
    3896                      .dwattr $C$DW$412, DW_AT_name("Idq_ref")
    3897                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Idq_ref")
    3898                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3899                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3900              
    3901              $C$DW$413       .dwtag  DW_TAG_member
    3902                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$20)
    3903                      .dwattr $C$DW$413, DW_AT_name("IdRated")
    3904                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_IdRated")
    3905                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3906                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3907              
    3908              $C$DW$414       .dwtag  DW_TAG_member
    3909                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    3910                      .dwattr $C$DW$414, DW_AT_name("spd_ref")
    3911                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_spd_ref")
    3912                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3913                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3914              
    3915              $C$DW$415       .dwtag  DW_TAG_member
    3916                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
    3917                      .dwattr $C$DW$415, DW_AT_name("spd_max")
    3918                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_spd_max")
    3919                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3920                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3921              
    3922              $C$DW$416       .dwtag  DW_TAG_member
    3923                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$53)
    3924                      .dwattr $C$DW$416, DW_AT_name("counter_current")
    3925                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_counter_current")
    3926                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3927                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3928              
    3929              $C$DW$417       .dwtag  DW_TAG_member
    3930                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$53)
    3931                      .dwattr $C$DW$417, DW_AT_name("counter_isr")
    3932                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_counter_isr")
    3933                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   77

    3934                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3935              
    3936              $C$DW$418       .dwtag  DW_TAG_member
    3937                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$53)
    3938                      .dwattr $C$DW$418, DW_AT_name("counter_speed")
    3939                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_counter_speed")
    3940                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3941                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3942              
    3943              $C$DW$419       .dwtag  DW_TAG_member
    3944                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$53)
    3945                      .dwattr $C$DW$419, DW_AT_name("counter_traj")
    3946                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_counter_traj")
    3947                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3948                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3949              
    3950              $C$DW$420       .dwtag  DW_TAG_member
    3951                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$56)
    3952                      .dwattr $C$DW$420, DW_AT_name("flag_enableCtrl")
    3953                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3954                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3955                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3956              
    3957              $C$DW$421       .dwtag  DW_TAG_member
    3958                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$56)
    3959                      .dwattr $C$DW$421, DW_AT_name("flag_enableDcBusComp")
    3960                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3961                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3962                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3963              
    3964              $C$DW$422       .dwtag  DW_TAG_member
    3965                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$56)
    3966                      .dwattr $C$DW$422, DW_AT_name("flag_enablePowerWarp")
    3967                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3968                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3969                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3970              
    3971              $C$DW$423       .dwtag  DW_TAG_member
    3972                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$56)
    3973                      .dwattr $C$DW$423, DW_AT_name("flag_enableOffset")
    3974                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_flag_enableOffset")
    3975                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3976                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3977              
    3978              $C$DW$424       .dwtag  DW_TAG_member
    3979                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$56)
    3980                      .dwattr $C$DW$424, DW_AT_name("flag_enableSpeedCtrl")
    3981                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3982                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3983                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3984              
    3985              $C$DW$425       .dwtag  DW_TAG_member
    3986                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$56)
    3987                      .dwattr $C$DW$425, DW_AT_name("flag_enableUserMotorParams")
    3988                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   78

    3989                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3990                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3991              
    3992              $C$DW$426       .dwtag  DW_TAG_member
    3993                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$55)
    3994                      .dwattr $C$DW$426, DW_AT_name("Idq_offset_pu")
    3995                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3996                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3997                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3998              
    3999              $C$DW$427       .dwtag  DW_TAG_member
    4000                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$55)
    4001                      .dwattr $C$DW$427, DW_AT_name("Vdq_offset_pu")
    4002                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4003                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4004                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4005              
    4006              $C$DW$428       .dwtag  DW_TAG_member
    4007                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    4008                      .dwattr $C$DW$428, DW_AT_name("angle_pu")
    4009                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_angle_pu")
    4010                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4011                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4012              
    4013              $C$DW$429       .dwtag  DW_TAG_member
    4014                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    4015                      .dwattr $C$DW$429, DW_AT_name("speed_ref_pu")
    4016                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_speed_ref_pu")
    4017                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4018                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4019              
    4020              $C$DW$430       .dwtag  DW_TAG_member
    4021                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    4022                      .dwattr $C$DW$430, DW_AT_name("speed_fb_pu")
    4023                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_speed_fb_pu")
    4024                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4025                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4026              
    4027              $C$DW$431       .dwtag  DW_TAG_member
    4028                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    4029                      .dwattr $C$DW$431, DW_AT_name("speed_outMax_pu")
    4030                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4031                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4032                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4033              
    4034              $C$DW$432       .dwtag  DW_TAG_member
    4035                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$56)
    4036                      .dwattr $C$DW$432, DW_AT_name("flag_enableCurrentCtrl")
    4037                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4038                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4039                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4040              
    4041                      .dwendtag $C$DW$T$57
    4042              
    4043              $C$DW$T$85      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   79

    4044                      .dwattr $C$DW$T$85, DW_AT_name("CTRL_Obj")
    4045                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
    4046                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4047              
    4048              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    4049                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    4050                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    4051              
    4052              $C$DW$T$87      .dwtag  DW_TAG_typedef
    4053                      .dwattr $C$DW$T$87, DW_AT_name("CTRL_Handle")
    4054                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    4055                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4056              
    4057              $C$DW$433       .dwtag  DW_TAG_TI_far_type
    4058                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$87)
    4059              
    4060              $C$DW$T$88      .dwtag  DW_TAG_const_type
    4061                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$433)
    4062              
    4063              
    4064              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4065                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    4066                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    4067              $C$DW$434       .dwtag  DW_TAG_member
    4068                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$21)
    4069                      .dwattr $C$DW$434, DW_AT_name("rsvd")
    4070                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_rsvd")
    4071                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4072                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4073              
    4074              $C$DW$435       .dwtag  DW_TAG_member
    4075                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$59)
    4076                      .dwattr $C$DW$435, DW_AT_name("targetProc")
    4077                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_targetProc")
    4078                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4079                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4080              
    4081              $C$DW$436       .dwtag  DW_TAG_member
    4082                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$21)
    4083                      .dwattr $C$DW$436, DW_AT_name("major")
    4084                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_major")
    4085                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4086                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4087              
    4088              $C$DW$437       .dwtag  DW_TAG_member
    4089                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$21)
    4090                      .dwattr $C$DW$437, DW_AT_name("minor")
    4091                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_minor")
    4092                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4093                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4094              
    4095                      .dwendtag $C$DW$T$60
    4096              
    4097              $C$DW$T$24      .dwtag  DW_TAG_typedef
    4098                      .dwattr $C$DW$T$24, DW_AT_name("CTRL_Version")
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   80

    4099                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    4100                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    4101              
    4102              
    4103              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4104                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    4105                      .dwattr $C$DW$T$19, DW_AT_declaration
    4106                      .dwendtag $C$DW$T$19
    4107              
    4108              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    4109                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    4110                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    4111              
    4112              $C$DW$T$33      .dwtag  DW_TAG_typedef
    4113                      .dwattr $C$DW$T$33, DW_AT_name("EST_Handle")
    4114                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4115                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4116              
    4117              
    4118              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4119                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    4120                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    4121              $C$DW$438       .dwtag  DW_TAG_member
    4122                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    4123                      .dwattr $C$DW$438, DW_AT_name("sinTh")
    4124                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_sinTh")
    4125                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4126                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4127              
    4128              $C$DW$439       .dwtag  DW_TAG_member
    4129                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    4130                      .dwattr $C$DW$439, DW_AT_name("cosTh")
    4131                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_cosTh")
    4132                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4133                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4134              
    4135                      .dwendtag $C$DW$T$61
    4136              
    4137              $C$DW$T$42      .dwtag  DW_TAG_typedef
    4138                      .dwattr $C$DW$T$42, DW_AT_name("IPARK_Obj")
    4139                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    4140                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4141              
    4142              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    4143                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    4144                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    4145              
    4146              $C$DW$T$41      .dwtag  DW_TAG_typedef
    4147                      .dwattr $C$DW$T$41, DW_AT_name("IPARK_Handle")
    4148                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    4149                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4150              
    4151              
    4152              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4153                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   81

    4154                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    4155              $C$DW$440       .dwtag  DW_TAG_member
    4156                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$62)
    4157                      .dwattr $C$DW$440, DW_AT_name("value")
    4158                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_value")
    4159                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4160                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4161              
    4162                      .dwendtag $C$DW$T$63
    4163              
    4164              $C$DW$T$55      .dwtag  DW_TAG_typedef
    4165                      .dwattr $C$DW$T$55, DW_AT_name("MATH_vec2")
    4166                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    4167                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4168              
    4169              
    4170              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4171                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    4172                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    4173              $C$DW$441       .dwtag  DW_TAG_member
    4174                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$65)
    4175                      .dwattr $C$DW$441, DW_AT_name("type")
    4176                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_type")
    4177                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4178                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4179              
    4180              $C$DW$442       .dwtag  DW_TAG_member
    4181                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$53)
    4182                      .dwattr $C$DW$442, DW_AT_name("numPolePairs")
    4183                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_numPolePairs")
    4184                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4185                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4186              
    4187              $C$DW$443       .dwtag  DW_TAG_member
    4188                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$54)
    4189                      .dwattr $C$DW$443, DW_AT_name("Lr_H")
    4190                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_Lr_H")
    4191                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4192                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4193              
    4194              $C$DW$444       .dwtag  DW_TAG_member
    4195                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$54)
    4196                      .dwattr $C$DW$444, DW_AT_name("Ls_d_H")
    4197                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_Ls_d_H")
    4198                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4199                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4200              
    4201              $C$DW$445       .dwtag  DW_TAG_member
    4202                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$54)
    4203                      .dwattr $C$DW$445, DW_AT_name("Ls_q_H")
    4204                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_Ls_q_H")
    4205                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4206                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4207              
    4208              $C$DW$446       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   82

    4209                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$54)
    4210                      .dwattr $C$DW$446, DW_AT_name("Rr_Ohm")
    4211                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_Rr_Ohm")
    4212                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4213                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4214              
    4215              $C$DW$447       .dwtag  DW_TAG_member
    4216                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$54)
    4217                      .dwattr $C$DW$447, DW_AT_name("Rs_Ohm")
    4218                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_Rs_Ohm")
    4219                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4220                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4221              
    4222              $C$DW$448       .dwtag  DW_TAG_member
    4223                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$54)
    4224                      .dwattr $C$DW$448, DW_AT_name("ratedFlux_VpHz")
    4225                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    4226                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4227                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4228              
    4229                      .dwendtag $C$DW$T$66
    4230              
    4231              $C$DW$T$49      .dwtag  DW_TAG_typedef
    4232                      .dwattr $C$DW$T$49, DW_AT_name("MOTOR_Params")
    4233                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    4234                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4235              
    4236              
    4237              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4238                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    4239                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    4240              $C$DW$449       .dwtag  DW_TAG_member
    4241                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    4242                      .dwattr $C$DW$449, DW_AT_name("sinTh")
    4243                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_sinTh")
    4244                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4245                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4246              
    4247              $C$DW$450       .dwtag  DW_TAG_member
    4248                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$20)
    4249                      .dwattr $C$DW$450, DW_AT_name("cosTh")
    4250                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_cosTh")
    4251                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4252                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4253              
    4254                      .dwendtag $C$DW$T$67
    4255              
    4256              $C$DW$T$36      .dwtag  DW_TAG_typedef
    4257                      .dwattr $C$DW$T$36, DW_AT_name("PARK_Obj")
    4258                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    4259                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4260              
    4261              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4262                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    4263                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   83

    4264              
    4265              $C$DW$T$35      .dwtag  DW_TAG_typedef
    4266                      .dwattr $C$DW$T$35, DW_AT_name("PARK_Handle")
    4267                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4268                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4269              
    4270              
    4271              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    4272                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    4273                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    4274              $C$DW$451       .dwtag  DW_TAG_member
    4275                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    4276                      .dwattr $C$DW$451, DW_AT_name("Kp")
    4277                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_Kp")
    4278                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4279                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4280              
    4281              $C$DW$452       .dwtag  DW_TAG_member
    4282                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    4283                      .dwattr $C$DW$452, DW_AT_name("Ki")
    4284                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_Ki")
    4285                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4286                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4287              
    4288              $C$DW$453       .dwtag  DW_TAG_member
    4289                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    4290                      .dwattr $C$DW$453, DW_AT_name("Kd")
    4291                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_Kd")
    4292                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4293                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4294              
    4295              $C$DW$454       .dwtag  DW_TAG_member
    4296                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    4297                      .dwattr $C$DW$454, DW_AT_name("Ui")
    4298                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_Ui")
    4299                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4300                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4301              
    4302              $C$DW$455       .dwtag  DW_TAG_member
    4303                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    4304                      .dwattr $C$DW$455, DW_AT_name("refValue")
    4305                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_refValue")
    4306                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4307                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4308              
    4309              $C$DW$456       .dwtag  DW_TAG_member
    4310                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    4311                      .dwattr $C$DW$456, DW_AT_name("fbackValue")
    4312                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_fbackValue")
    4313                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4314                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4315              
    4316              $C$DW$457       .dwtag  DW_TAG_member
    4317                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    4318                      .dwattr $C$DW$457, DW_AT_name("outMin")
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   84

    4319                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_outMin")
    4320                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4321                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4322              
    4323              $C$DW$458       .dwtag  DW_TAG_member
    4324                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    4325                      .dwattr $C$DW$458, DW_AT_name("outMax")
    4326                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_outMax")
    4327                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4328                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4329              
    4330                      .dwendtag $C$DW$T$68
    4331              
    4332              $C$DW$T$39      .dwtag  DW_TAG_typedef
    4333                      .dwattr $C$DW$T$39, DW_AT_name("PID_Obj")
    4334                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    4335                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4336              
    4337              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4338                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    4339                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    4340              
    4341              $C$DW$T$38      .dwtag  DW_TAG_typedef
    4342                      .dwattr $C$DW$T$38, DW_AT_name("PID_Handle")
    4343                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4344                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4345              
    4346              
    4347              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    4348                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    4349                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    4350              $C$DW$459       .dwtag  DW_TAG_member
    4351                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$20)
    4352                      .dwattr $C$DW$459, DW_AT_name("maxModulation")
    4353                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_maxModulation")
    4354                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4355                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4356              
    4357                      .dwendtag $C$DW$T$69
    4358              
    4359              $C$DW$T$45      .dwtag  DW_TAG_typedef
    4360                      .dwattr $C$DW$T$45, DW_AT_name("SVGEN_Obj")
    4361                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    4362                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4363              
    4364              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4365                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    4366                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4367              
    4368              $C$DW$T$44      .dwtag  DW_TAG_typedef
    4369                      .dwattr $C$DW$T$44, DW_AT_name("SVGEN_Handle")
    4370                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4371                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4372              
    4373              
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   85

    4374              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4375                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    4376                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    4377              $C$DW$460       .dwtag  DW_TAG_member
    4378                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    4379                      .dwattr $C$DW$460, DW_AT_name("targetValue")
    4380                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_targetValue")
    4381                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4382                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4383              
    4384              $C$DW$461       .dwtag  DW_TAG_member
    4385                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    4386                      .dwattr $C$DW$461, DW_AT_name("intValue")
    4387                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_intValue")
    4388                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4389                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4390              
    4391              $C$DW$462       .dwtag  DW_TAG_member
    4392                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    4393                      .dwattr $C$DW$462, DW_AT_name("minValue")
    4394                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_minValue")
    4395                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4396                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4397              
    4398              $C$DW$463       .dwtag  DW_TAG_member
    4399                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$20)
    4400                      .dwattr $C$DW$463, DW_AT_name("maxValue")
    4401                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_maxValue")
    4402                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4403                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4404              
    4405              $C$DW$464       .dwtag  DW_TAG_member
    4406                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$20)
    4407                      .dwattr $C$DW$464, DW_AT_name("maxDelta")
    4408                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_maxDelta")
    4409                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4410                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4411              
    4412                      .dwendtag $C$DW$T$70
    4413              
    4414              $C$DW$T$48      .dwtag  DW_TAG_typedef
    4415                      .dwattr $C$DW$T$48, DW_AT_name("TRAJ_Obj")
    4416                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    4417                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4418              
    4419              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4420                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    4421                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4422              
    4423              $C$DW$T$47      .dwtag  DW_TAG_typedef
    4424                      .dwattr $C$DW$T$47, DW_AT_name("TRAJ_Handle")
    4425                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4426                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4427              
    4428              
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   86

    4429              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4430                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    4431                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    4432              $C$DW$465       .dwtag  DW_TAG_member
    4433                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$54)
    4434                      .dwattr $C$DW$465, DW_AT_name("iqFullScaleCurrent_A")
    4435                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    4436                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4437                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4438              
    4439              $C$DW$466       .dwtag  DW_TAG_member
    4440                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    4441                      .dwattr $C$DW$466, DW_AT_name("iqFullScaleVoltage_V")
    4442                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    4443                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4444                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4445              
    4446              $C$DW$467       .dwtag  DW_TAG_member
    4447                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$54)
    4448                      .dwattr $C$DW$467, DW_AT_name("iqFullScaleFreq_Hz")
    4449                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    4450                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4451                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4452              
    4453              $C$DW$468       .dwtag  DW_TAG_member
    4454                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$53)
    4455                      .dwattr $C$DW$468, DW_AT_name("numIsrTicksPerCtrlTick")
    4456                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4457                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4458                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4459              
    4460              $C$DW$469       .dwtag  DW_TAG_member
    4461                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$53)
    4462                      .dwattr $C$DW$469, DW_AT_name("numCtrlTicksPerCurrentTick")
    4463                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4464                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4465                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4466              
    4467              $C$DW$470       .dwtag  DW_TAG_member
    4468                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$53)
    4469                      .dwattr $C$DW$470, DW_AT_name("numCtrlTicksPerEstTick")
    4470                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    4471                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4472                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4473              
    4474              $C$DW$471       .dwtag  DW_TAG_member
    4475                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$53)
    4476                      .dwattr $C$DW$471, DW_AT_name("numCtrlTicksPerSpeedTick")
    4477                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4478                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4479                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4480              
    4481              $C$DW$472       .dwtag  DW_TAG_member
    4482                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$53)
    4483                      .dwattr $C$DW$472, DW_AT_name("numCtrlTicksPerTrajTick")
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   87

    4484                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4485                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4486                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4487              
    4488              $C$DW$473       .dwtag  DW_TAG_member
    4489                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$22)
    4490                      .dwattr $C$DW$473, DW_AT_name("numCurrentSensors")
    4491                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_numCurrentSensors")
    4492                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4493                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4494              
    4495              $C$DW$474       .dwtag  DW_TAG_member
    4496                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$22)
    4497                      .dwattr $C$DW$474, DW_AT_name("numVoltageSensors")
    4498                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_numVoltageSensors")
    4499                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4500                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4501              
    4502              $C$DW$475       .dwtag  DW_TAG_member
    4503                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$54)
    4504                      .dwattr $C$DW$475, DW_AT_name("offsetPole_rps")
    4505                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_offsetPole_rps")
    4506                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4507                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4508              
    4509              $C$DW$476       .dwtag  DW_TAG_member
    4510                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$54)
    4511                      .dwattr $C$DW$476, DW_AT_name("fluxPole_rps")
    4512                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_fluxPole_rps")
    4513                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4514                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4515              
    4516              $C$DW$477       .dwtag  DW_TAG_member
    4517                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$54)
    4518                      .dwattr $C$DW$477, DW_AT_name("zeroSpeedLimit")
    4519                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    4520                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4521                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4522              
    4523              $C$DW$478       .dwtag  DW_TAG_member
    4524                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$54)
    4525                      .dwattr $C$DW$478, DW_AT_name("forceAngleFreq_Hz")
    4526                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    4527                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4528                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4529              
    4530              $C$DW$479       .dwtag  DW_TAG_member
    4531                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$54)
    4532                      .dwattr $C$DW$479, DW_AT_name("maxAccel_Hzps")
    4533                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    4534                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4535                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4536              
    4537              $C$DW$480       .dwtag  DW_TAG_member
    4538                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   88

    4539                      .dwattr $C$DW$480, DW_AT_name("maxAccel_est_Hzps")
    4540                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    4541                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4542                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4543              
    4544              $C$DW$481       .dwtag  DW_TAG_member
    4545                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$54)
    4546                      .dwattr $C$DW$481, DW_AT_name("directionPole_rps")
    4547                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_directionPole_rps")
    4548                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4549                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4550              
    4551              $C$DW$482       .dwtag  DW_TAG_member
    4552                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$54)
    4553                      .dwattr $C$DW$482, DW_AT_name("speedPole_rps")
    4554                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_speedPole_rps")
    4555                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4556                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4557              
    4558              $C$DW$483       .dwtag  DW_TAG_member
    4559                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$54)
    4560                      .dwattr $C$DW$483, DW_AT_name("dcBusPole_rps")
    4561                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_dcBusPole_rps")
    4562                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4563                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4564              
    4565              $C$DW$484       .dwtag  DW_TAG_member
    4566                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$54)
    4567                      .dwattr $C$DW$484, DW_AT_name("fluxFraction")
    4568                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_fluxFraction")
    4569                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4570                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4571              
    4572              $C$DW$485       .dwtag  DW_TAG_member
    4573                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$54)
    4574                      .dwattr $C$DW$485, DW_AT_name("indEst_speedMaxFraction")
    4575                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    4576                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4577                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4578              
    4579              $C$DW$486       .dwtag  DW_TAG_member
    4580                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$54)
    4581                      .dwattr $C$DW$486, DW_AT_name("powerWarpGain")
    4582                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_powerWarpGain")
    4583                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4584                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4585              
    4586              $C$DW$487       .dwtag  DW_TAG_member
    4587                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$53)
    4588                      .dwattr $C$DW$487, DW_AT_name("systemFreq_MHz")
    4589                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_systemFreq_MHz")
    4590                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4591                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4592              
    4593              $C$DW$488       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   89

    4594                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$54)
    4595                      .dwattr $C$DW$488, DW_AT_name("pwmPeriod_usec")
    4596                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    4597                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4598                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4599              
    4600              $C$DW$489       .dwtag  DW_TAG_member
    4601                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$54)
    4602                      .dwattr $C$DW$489, DW_AT_name("voltage_sf")
    4603                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_voltage_sf")
    4604                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4605                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4606              
    4607              $C$DW$490       .dwtag  DW_TAG_member
    4608                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$54)
    4609                      .dwattr $C$DW$490, DW_AT_name("current_sf")
    4610                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_current_sf")
    4611                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4612                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4613              
    4614              $C$DW$491       .dwtag  DW_TAG_member
    4615                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$54)
    4616                      .dwattr $C$DW$491, DW_AT_name("voltageFilterPole_rps")
    4617                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    4618                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4619                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4620              
    4621              $C$DW$492       .dwtag  DW_TAG_member
    4622                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$54)
    4623                      .dwattr $C$DW$492, DW_AT_name("maxVsMag_pu")
    4624                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4625                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4626                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4627              
    4628              $C$DW$493       .dwtag  DW_TAG_member
    4629                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$54)
    4630                      .dwattr $C$DW$493, DW_AT_name("estKappa")
    4631                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_estKappa")
    4632                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4633                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4634              
    4635              $C$DW$494       .dwtag  DW_TAG_member
    4636                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$65)
    4637                      .dwattr $C$DW$494, DW_AT_name("motor_type")
    4638                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_motor_type")
    4639                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4640                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4641              
    4642              $C$DW$495       .dwtag  DW_TAG_member
    4643                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$53)
    4644                      .dwattr $C$DW$495, DW_AT_name("motor_numPolePairs")
    4645                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_motor_numPolePairs")
    4646                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4647                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4648              
TMS320C2000 Assembler PC v15.12.3 Wed Jun 27 11:48:31 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\a0393005\AppData\Local\Temp\1204810                         PAGE   90

    4649              $C$DW$496       .dwtag  DW_TAG_member
    4650                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$54)
    4651                      .dwattr $C$DW$496, DW_AT_name("motor_ratedFlux")
    4652                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_motor_ratedFlux")
    4653                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4654                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4655              
    4656              $C$DW$497       .dwtag  DW_TAG_member
    4657                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$54)
    4658                      .dwattr $C$DW$497, DW_AT_name("motor_Rr")
    4659                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_motor_Rr")
    4660                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4661                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4662              
    4663              $C$DW$498       .dwtag  DW_TAG_member
    4664                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$54)
    4665                      .dwattr $C$DW$498, DW_AT_name("motor_Rs")
    4666                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_motor_Rs")
    4667                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4668                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    4669              
    4670              $C$DW$499       .dwtag  DW_TAG_member
    4671                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
    4672                      .dwattr $C$DW$499, DW_AT_name("motor_Ls_d")
    4673                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_motor_Ls_d")
    4674                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4675                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    4676              
    4677              $C$DW$500       .dwtag  DW_TAG_member
    4678                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$54)
    4679                      .dwattr $C$DW$500, DW_AT_name("motor_Ls_q")
    4680                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_motor_Ls_q")
    4681                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4682                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    4683              
    4684              $C$DW$501       .dwtag  DW_TAG_member
    4685                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$54)
    4686                      .dwattr $C$DW$501, DW_AT_name("maxCurrent")
    4687                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_maxCurrent")
    4688                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4689                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    4690              
